[
    {
        "title": "Applying Ontological Modeling on Quranic Nature Domain",
        "abstract": "The holy Quran is the holy book of the Muslims. It contains information about many domains. Often people search for particular concepts of holy Quran based on the relations among concepts. An ontological modeling of holy Quran can be useful in such a scenario. In this paper, we have modeled nature related concepts of holy Quran using OWL (Web Ontology Language) / RDF (Resource Description Framework). Our methodology involves identifying nature related concepts mentioned in holy Quran and identifying relations among those concepts. These concepts and relations are represented as classes/instances and properties of an OWL ontology. Later, in the result section it is shown that, using the Ontological model, SPARQL queries can retrieve verses and concepts of interest. Thus, this modeling helps semantic search and query on the holy Quran. In this work, we have used English translation of the holy Quran by Sahih International, Protege OWL Editor and for querying we have used SPARQL.",
        "url": "http://arxiv.org/abs/1604.03318v1",
        "stream": "Scriptural Sources",
        "domain": "Quran & Tafsir",
        "topic": "Retrieval & QA",
        "leaf": "Search & Datasets"
    },
    {
        "title": "Towards A Time Based Video Search Engine for Al Quran Interpretation",
        "abstract": "The number of Internet Muslim-users is remarkably increasing from all over the world countries. There are a lot of structured, and well-documented text resources for the Quran interpretation, Tafsir, over the Internet with several languages. Nevertheless, when searching for the meaning of specific words, many users prefer watching short videos rather than reading a script or a book. This paper introduces the solution for the challenge of partitioning the common Tafsir videos into short videos according to the search query and sharing these result videos on the social networks. Furthermore, we provide the ability of user commenting on a specific time-based frame on the video or a specific verse in a particular subject. It would be very valuable to apply the current technologies on Holy Quran and Tafsir to easy the query for verses, understanding of its meaning, and sharing it on the different social media.",
        "url": "http://arxiv.org/abs/1701.09138v1",
        "stream": "Scriptural Sources",
        "domain": "Quran & Tafsir",
        "topic": "Retrieval & QA",
        "leaf": "Search & Datasets"
    },
    {
        "title": "Activity Monitoring of Islamic Prayer (Salat) Postures using Deep Learning",
        "abstract": "In the Muslim community, the prayer (i.e. Salat) is the second pillar of Islam, and it is the most essential and fundamental worshiping activity that believers have to perform five times a day. From a gestures' perspective, there are predefined human postures that must be performed in a precise manner. However, for several people, these postures are not correctly performed, due to being new to Salat or even having learned prayers in an incorrect manner. Furthermore, the time spent in each posture has to be balanced. To address these issues, we propose to develop an artificial intelligence assistive framework that guides worshippers to evaluate the correctness of the postures of their prayers. This paper represents the first step to achieve this objective and addresses the problem of the recognition of the basic gestures of Islamic prayer using Convolutional Neural Networks (CNN). The contribution of this paper lies in building a dataset for the basic Salat positions, and train a YOLOv3 neural network for the recognition of the gestures. Experimental results demonstrate that the mean average precision attains 85% for a training dataset of 764 images of the different postures. To the best of our knowledge, this is the first work that addresses human activity recognition of Salat using deep learning.",
        "url": "http://arxiv.org/abs/1911.04102v1",
        "stream": "Law & Practice",
        "domain": "Ibadat (Rituals)",
        "topic": "Tutoring & QA",
        "leaf": "Salah / Zakah / Sawm; Hajj/Umrah Guidance"
    },
    {
        "title": "SemEval-2015 Task 3: Answer Selection in Community Question Answering",
        "abstract": "Community Question Answering (cQA) provides new interesting research directions to the traditional Question Answering (QA) field, e.g., the exploitation of the interaction between users and the structure of related posts. In this context, we organized SemEval-2015 Task 3 on \"Answer Selection in cQA\", which included two subtasks: (a) classifying answers as \"good\", \"bad\", or \"potentially relevant\" with respect to the question, and (b) answering a YES/NO question with \"yes\", \"no\", or \"unsure\", based on the list of all answers. We set subtask A for Arabic and English on two relatively different cQA domains, i.e., the Qatar Living website for English, and a Quran-related website for Arabic. We used crowdsourcing on Amazon Mechanical Turk to label a large English training dataset, which we released to the research community. Thirteen teams participated in the challenge with a total of 61 submissions: 24 primary and 37 contrastive. The best systems achieved an official score (macro-averaged F1) of 57.19 and 63.7 for the English subtasks A and B, and 78.55 for the Arabic subtask A.",
        "url": "http://arxiv.org/abs/1911.11403v1",
        "stream": "Shared Resources",
        "domain": "Datasets & Benchmarks",
        "topic": "Creation",
        "leaf": "Shared Tasks"
    },
    {
        "title": "Answering Islamic Questions with a Chatbot using Fuzzy String-Matching Algorithm",
        "abstract": "The guidance of Muslims in worship refers to the holy Quran and the hadith. Not all people understand the law related to a case in accordance with Islamic teachings. Questions relating to a matter based on Islamic law are widely circulated on the Internet with long and detailed answers. This is good but for some people, a short and direct answer to the core is the desired answer, of course in accordance with the majority of Muslim scholars. One of the many technologies that can be used to answer questions is chatbot. A chatbot is one of many implementations of Natural Language Preprocessing. In this study, the chatbot can find answers to questions in accordance with Islamic law using the fuzzy string-matching algorithm. The research test data were obtained from several people who used chatbot directly by looking at pairs of questions and answers whether they were appropriate or not. The accuracy of the test is 70.37% and the chatbot’s performance is quite good.",
        "url": "https://www.semanticscholar.org/paper/fde52da0329158adca0c401e007ca881169c16b2",
        "stream": "Education & Community",
        "domain": "Islamic Education",
        "topic": "Learning Systems",
        "leaf": "Chatbots/Apps/Portals; User Studies"
    },
    {
        "title": "Development Grouping of Synonym Set Thesaurus Vocabulary The Qur’an in English Using Hierarchical Clustering Algorithm",
        "abstract": "Research in the field of text mining to process entries or words from the Qur'an is very beneficial for Muslims. This study aims to establish a set of synonyms for the thesaurus in the words of the Qur'an. This research is used because the source of knowledge about the science of the Qur'an is still lacking. The dataset in this study uses the Corpus Qur'an and English Translation. This research is a research development of an article that has been published, namely \"The Development of Al-Qur'an Vocabulary Set Synonyms with WordNet Approach\" by Laras Gupitasari. Input from this research system uses nouns from the translation of English words in the Quran. The output of the system produces several groups that have the same level of closeness of meaning displayed, the first group means the word in the group has a close meaning. To produce output, this study uses word grouping with a hierarchical grouping method and calculates distances using common paths, then groups results according to the closeness of meaning from word entries. The evaluation in this study produced an F-Measure value of 76%, F-Measure Value is an evaluation to measure the accuracy of predictions issued by the system.",
        "url": "https://www.semanticscholar.org/paper/c3cb2fa360625f678b01ab911d718a84058fa116",
        "stream": "Scriptural Sources",
        "domain": "Quran & Tafsir",
        "topic": "Processing & Analysis",
        "leaf": "Morphology/Syntax; Semantics/Topics"
    },
    {
        "title": "Smartajweed Automatic Recognition of Arabic Quranic Recitation Rules",
        "abstract": "Tajweed is a set of rules to read the Quran in a correct Pronunciation of the letters with all its Qualities, while Reciting the Quran. which means you have to give every letter in the Quran its due of characteristics and apply it to this particular letter in this specific situation while reading, which may differ in other times. These characteristics include melodic rules, like where to stop and for how long, when to merge two letters in pronunciation or when to stretch some, or even when to put more strength on some letters over other. Most of the papers focus mainly on the main recitation rules and the pronunciation but not (Ahkam AL Tajweed) which give different rhythm and different melody to the pronunciation with every different rule of (Tajweed). Which is also considered very important and essential in Reading the Quran as it can give different meanings to the words. In this paper we discuss in detail full system for automatic recognition of Quran Recitation Rules (Tajweed) by using support vector machine and threshold scoring system",
        "url": "http://arxiv.org/abs/2101.04200v1",
        "stream": "Scriptural Sources",
        "domain": "Quran & Tafsir",
        "topic": "Audio/Multimodal",
        "leaf": "ASR/Recitation Support"
    },
    {
        "title": "Quran content representation in NLP",
        "abstract": "Word representation is a starting point for Natural Language Processing (NLP). These representations transform words into symbolic vectors of a given length that reveal the hidden linguistic and semantic similarities. This paper presents a study of the various word representation tools used for the content of the texts of the holy Quran in Arabic, which include the two main representation forms: Local representation and Distributed representation, with the aim of using them in different artificial intelligence subsets such as \"machine learning\" and \"deep learning\" algorithms that require NLP.",
        "url": "https://www.semanticscholar.org/paper/6c2fadbf5068efa12785ffafb02708a2449f84fc",
        "stream": "Scriptural Sources",
        "domain": "Quran & Tafsir",
        "topic": "Processing & Analysis",
        "leaf": "Morphology/Syntax; Semantics/Topics"
    },
    {
        "title": "Hadith Authenticity Prediction using Sentiment Analysis and Machine Learning",
        "abstract": "Starting around 815AD/200AH scholars have put immense effort towards gathering and sifting authentic hadiths, which are prophetic traditions of the Muslim community. The authenticity of a hadith solely depends on the reliability of its reporters and narrators. Till now scholars have had to do this task manually by precisely anatomizing each hadith’s chain of narrators or the list of people related to the transmission of a particular hadith. The evolution of modern computer science techniques has enabled new methods and introduced a potential paradigm shift in the science of hadith authentication. Focusing on the chain of narrators (also known as \"Isnad\") of a hadith, we have used a technique called ‘Sentiment Analysis’ from Natural Language Processing (NLP) to build a text classifier which tries to predict the authenticity of a hadith. It learns from our custom-made dataset of Isnads and predicts an unknown hadith to be either authentic or fabricated based upon its Isnad. Our classifier was 86% accurate when tested on the test hadith dataset.",
        "url": "https://www.semanticscholar.org/paper/4e2a505ef27bfe707333b7be96f25f914e2fe18b",
        "stream": "Scriptural Sources",
        "domain": "Hadith Sciences",
        "topic": "Authenticity & Isnad",
        "leaf": "Chain/Matn Features"
    },
    {
        "title": "A Survey of the Meaning of Amnesty in the Qur'an Based on Relationships and Succession with Emphasis on Answering a Question about the Prophet's Islamic Infallibility",
        "abstract": "The word amnesty and its derivatives have been used in several verses of the Qur'an. The main question of this article is what exactly does Amnesty mean in all the verses of the Qur'an in the same sense? What is the meaning of pardon based on the relations of companionship and succession? Why, God willing, has the Prophet forgiven? Does God pardon the Prophet; he contradicts the Prophet's infallibility. For this purpose, in the present study, the semantics of the word Amnesty is first addressed by the linguistic method and the scope and semantic domain of Amnesty are fully identified. Then the broad semantic network of Amnesty and its close relationship with other key words of the Qur'an such as mercy, blessings, and the like are examined. In the end, it is clear that the \"Amnesty\" that God has used about the Prophet (peace be upon him) does not mean forgiving the Prophet's (pbuh) sin and does not contradict the Prophet (peace be upon him).",
        "url": "https://www.semanticscholar.org/paper/6e72ce7435f800894b0c3ea6ef615b6d4b396e53",
        "stream": "Scriptural Sources",
        "domain": "Quran & Tafsir",
        "topic": "Processing & Analysis",
        "leaf": "Morphology/Syntax; Semantics/Topics"
    },
    {
        "title": "Automatic Text Summarization for Hadith with Indonesian Text using Bellman-Ford Algorithm",
        "abstract": "Automatic text summarization is one of Natural Language Processing technology to create a summary automatically by not changing the core or main idea of a summarized document. According to the agreement of the majority of Muslim scholars, Hadith is a second source of Muslim's life guideline. This study aims to extract the main meaning of Hadith document using automatic text summarization. The method used in this study is Bellman-Ford Algorithm from graph theory to extract and score the sentence based on the closeness and interconnection between sentences. The Hadith summary which resulted from Bellman-Ford algorithm is evaluated using Recall-Oriented Understudy for Gisting Evaluation - Longest Common Subsequence (ROUGE-L) metrics. Based on experiment using 20 Hadith documents with Indonesian text and ROUGE-L metrics evaluation, the summary results from sentence extraction are influenced by the type of similarity formula between sentences. The result shows that an average value of precision is 46.5%, recall value is 56% recall and f-score 49.5%. The evaluation result is not good enough because the summary result is extraction summary, while the summary evaluation database is abstraction summary. However, from human evaluation, this research contributes to understand the contents of the Hadith with a shorter text but does not eliminate the essence of the Hadith itself.",
        "url": "https://www.semanticscholar.org/paper/eeed3718dfeb8ccf50ce9e769c981de292b0f673",
        "stream": "Scriptural Sources",
        "domain": "Hadith Sciences",
        "topic": "Structuring",
        "leaf": "NER & Ontologies"
    },
    {
        "title": "Arabic Text Processing Model: Verbs Roots and Conjugation Automation",
        "abstract": "The Natural Language Processing (NLP) is a process to automate the text or speech of Natural Languages. This automation is mainly conducted for Western languages. The Arabic Language got less focus in this area. This paper presents a Model to recognize an Arabic sentence. A new morphological model based on regular expressions is developed to recognize the Arabic verbs. A hash table containing all Arabic three-letters’ root of verbs is implemented. The total number of Arabic verbs that are derived from three-letters’ root size is 23090. The number of roots is 6104. A set of rules forming the Arabic grammar is used to derive and analyze the syntax of Arabic sentences. About 87% of the verbs represented in our regular expressions’ engine are detected. Moreover, the sentences are also recognized. In several Surat of the Quran, only 9% of the detected verbs are false-positive (a non-verb declared as a verb), and 4% are considered false-negative (a verb is considered as a noun). This rate is mainly because we are not using vowels even that the Quran (our case study) is using them. The reason behind our decision is to be able to handle all Arabic texts, which mostly are not using vowels.",
        "url": "https://www.semanticscholar.org/paper/ea17a3edbf5b13d26d517f50d6e8f4447ab901a2",
        "stream": "Scriptural Sources",
        "domain": "Quran & Tafsir",
        "topic": "Processing & Analysis",
        "leaf": "Morphology/Syntax; Semantics/Topics"
    },
    {
        "title": "Developing FB Chatbot Based on Deep Learning Using RASA Framework for University Enquiries",
        "abstract": "Smart systems for Universities powered by Artificial Intelligence have been massively developed to help humans in various tasks. The chatbot concept is not something new in today society which is developing with recent technology. College students or candidates of college students often need actual information like asking for something to customer service, especially during this pandemic, when it is difficult to have an immediate face-to-face meeting. Chatbots are functionally helping in several things such as curriculum information, admission for new students, schedule info for any lecture courses, students grade information, and some adding features for Muslim worships schedule, also weather forecast information. This Chatbot is developed by Deep Learning models, which was adopted by an artificial intelligence model that replicates human intelligence with some specific training schemes. This kind of Deep Learning is based on RNN which has some specific memory savings scheme for the Deep Learning Model, specifically this chatbot using LSTM which already integrates by RASA framework. LSTM is also known as Long Short Term Memory which efficiently saves some required memory but will remove some memory that is not needed. This Chatbot uses the FB platform because of the FB users have already reached up to 60.8% of its entire population in Indonesia. Here's the chatbot only focuses on case studies at campus of the Magister Informatics FTI University of Islamic Indonesia. This research is a first stage development within fairly sufficient simulate data.",
        "url": "http://arxiv.org/abs/2009.12341v1",
        "stream": "Education & Community",
        "domain": "Islamic Education",
        "topic": "Learning Systems",
        "leaf": "Chatbots/Apps/Portals; User Studies"
    },
    {
        "title": "Chatbot as Islamic Finance Expert (CaIFE): When Finance Meets Artificial Intelligence",
        "abstract": "Artificial intelligence (AI) is the key technology in the new disruptive technological innovation and industrial transformation. AI has very wide application in finance and banking. The financial institutions not only answer the queries of the customers, but they should also clarify the complaints the customer face and provide the solution. For this purpose, many banks and financial institutions are using Chatbot to provide solution to customer complaints and queries. Chatbots are very efficient in providing solution to customers queries and are available 24 hours to give solution to customer's complaints. Finally, we propose an artificial Intelligence based interactive Chatbot called 'Chatbot as Islamic Finance Expert' (CaIFE). Our interactive Chatbot CaIFE receives automatic robot support related to Islamic finance and banking by having users communicate with a robot having knowledge accumulated by machine learning. It answers any query related to Islamic finance and banking on real time basis. It then presents a case study of CaIFE and explains its characteristics and limitations.",
        "url": "https://www.semanticscholar.org/paper/1e45b14fe3c1f72467b99b75b109b37ec710f369",
        "stream": "Education & Community",
        "domain": "Islamic Education",
        "topic": "Learning Systems",
        "leaf": "Chatbots/Apps/Portals; User Studies"
    },
    {
        "title": "Quran Intelligent Ontology Construction Approach Using Association Rules Mining",
        "abstract": "Ontology can be seen as a formal representation of knowledge. They have been investigated in many artificial intelligence studies including semantic web, software engineering, and information retrieval. The aim of ontology is to develop knowledge representations that can be shared and reused. This research project is concerned with the use of association rules to extract the Quran ontology. The manual acquisition of ontologies from Quran verses can be very costly; therefore, we need an intelligent system for Quran ontology construction using patternbased schemes and associations rules to discover Quran concepts and semantics relations from Quran verses. Our system is based on the combination of statistics and linguistics methods to extract concepts and conceptual relations from Quran. In particular, a linguistic pattern-based approach is exploited to extract specific concepts from the Quran, while the conceptual relations are found based on association rules technique. The Quran ontology will offer a new and powerful representation of Quran knowledge, and the association rules will help to represent the relations between all classes of connected concepts in the Quran ontology.",
        "url": "http://arxiv.org/abs/2008.03232v2",
        "stream": "Scriptural Sources",
        "domain": "Quran & Tafsir",
        "topic": "Processing & Analysis",
        "leaf": "Morphology/Syntax; Semantics/Topics"
    },
    {
        "title": "Social Network Analysis of Hadith Narrators from Sahih Bukhari",
        "abstract": "The ahadith, prophetic traditions for the Muslims around the world, are narrations originating from the sayings and the deeds of Prophet Muhammad (pbuh). They are considered one of the fundamental sources of Islamic legislation along with the Quran. The list of persons involved in the narration of each hadith is carefully scrutinized by scholars studying the hadith, with respect to their reputation and authenticity of the hadith. This is due to the its legislative importance in Islamic principles. There were many narrators who contributed to this responsibility of preserving prophetic narrations over the centuries. But to date, no systematic and comprehensive study, based on the social network, has been adapted to understand the contribution of early hadith narrators and the propagation of hadith across generations. In this study, we represented the chain of narrators of the hadith collection from Sahih Bukhari as a social graph. Based on social network analysis (SNA) on this graph, we found that the network of narrators is a scale-free network. We identified a list of influential narrators from the companions as well as the narrators from the second and third-generation who contribute significantly in the propagation of hadith collected in Sahih Bukhari. We discovered sixteen communities from the narrators of Sahih Bukhari. In each of these communities, there are other narrators who contributed significantly to the propagation of prophetic narrations. We also found that most narrators were centered in Makkah and Madinah in the era of companions and, then, gradually the center of hadith narrators shifted towards Kufa, Baghdad and central Asia over a period of time. To the best of our knowledge, this the first comprehensive and systematic study based on SNA, representing the narrators as a social graph to analyze their contribution to the preservation and propagation of hadith.",
        "url": "http://arxiv.org/abs/2102.02009v1",
        "stream": "Scriptural Sources",
        "domain": "Hadith Sciences",
        "topic": "Authenticity & Isnad",
        "leaf": "Graph/Network Analysis"
    },
    {
        "title": "Ethico-religious green supply chain management (GSCM): embedding Islamic ethics’ codes for improving environmental concerns",
        "abstract": "Purpose\nThis study aims to propose an Ethico-Religious green supply chain management (GSCM) view grounded in Islamic teachings design to govern human beings working in the industries.\n\n\nDesign/methodology/approach\nThis study adopts a qualitative approach that used the semi-structured-interview method as a research instrument. Three experts researching various aspects of Islam were consulted to identify Islamic teachings related to green supply chain practices.\n\n\nFindings\nThis study identifies several verses of the Holy Quran and the hadiths (a collection of traditions containing the sayings of the Prophet Muhammad) related to GSCM. It proposes these teachings as pro-environmental ethical codes.\n\n\nResearch limitations/implications\nThe proposed model has not been tested empirically. Future studies can consider an empirical test to find the possible effect of ethical codes on human behavior.\n\n\nOriginality/value\nThis study contributes to the literature in several ways. First, it presents an Ethico-Religious GSCM view that is new in the literature. Second, it extends the key premise of the natural resource-based view theory for achieving superior competitive advantage. Finally, it proposes a human governance approach useful for achieving firms’ environmental goals. This paper is helpful for managers who will find a human governance model supported by the Ethico-Religious GSCM view.",
        "url": "https://www.semanticscholar.org/paper/73773f733659331afabc450ad46d43e591cb3f9d",
        "stream": "Objectives & Governance",
        "domain": "Maqasid Lens",
        "topic": "Alignment",
        "leaf": "Bias/Safety Evaluation; Benchmark Creation"
    },
    {
        "title": "Towards an Automated Islamic Fatwa System: Survey, Dataset and Benchmarks",
        "abstract": "— Islam is the second largest and the fastest growing religion. The Islamic Law, Sharia, represents a profound component of the day-to-day lives of Muslims. This creates a lot of queries, about specific problems, that requires answers, or Fatwas. While sources of Sharia are available for anyone, it often requires a highly qualified person, the Mufti, to provide Fatwa. To get certified for Fatwa, the Mufti needs to undergo a sophisticated and long education process that starts from basic to high school. With Islam followers representing almost 25% of planet earth population, generating a lot of queries, and the sophistication of the Mufti qualification process, creating shortage in them, we have a supply-demand problem, calling for Automation solutions. This motivates the application of Artificial Intelligence (AI) to Automated Islamic Fatwa. In this work, we explore the potential of AI, Machine Learning and Deep Learning, with technologies like Natural Language Processing (NLP), paving the way to help the Automation of Islam Fatwa. We start by surveying the State-of-The Art (SoTA) of NLP, and explore the potential use-cases to solve the problems of Question answering and Text Classification in the Islamic Fatwa Automation. We present the first and major enabler component for AI application for Islamic Fatwa, the data. We build the largest dataset for Islamic Fatwa, spanning the widely used websites for Fatwa. Moreover, we present baseline systems, for Topic Classification, Topic Modelling and Retrieval-based Question-Answering, to set the direction for future research and benchmarking on our dataset. Finally, we release our dataset and baselines to the public domain, to help advance the future research in the area.",
        "url": "https://www.semanticscholar.org/paper/1dc60fc5d0caf1c6e09bab0ed3d95b5e14c25225",
        "stream": "Shared Resources",
        "domain": "Datasets & Benchmarks",
        "topic": "Creation",
        "leaf": "Corpora/Annotation; Shared Tasks"
    },
    {
        "title": "Enhancing the Takhrij Al-Hadith based on Contextual Similarity using BERT Embeddings",
        "abstract": "Muslims are required to conduct Takhrij to validate the truth of Hadith text, especially when it is obtained from online media. Typically, the traditional Takhrij processes are conducted by experts and apply to Arabic Hadith text. This study introduces a contextual similarity model based on BERT Embedding to handle Takhrij on Indonesian Hadith Text. This study examines the effectiveness of BERT Fine-Tuning on the six pre-trained models to produce embedding models. The result shows that BERT Fine-Tuning improves the embedding model average accuracy by 47.67%, with a mean of 0.956845. The most high-grade accuracy was the BERT embedding built based on the indobenchmark/indobert-large-p2 pre-trained model on 1.00. In addition, the manual evaluation achieved 91.67% accuracy. Keywords—Hadith text; Takhrij; natural language processing; text-similarity; word embedding; BERT fine-tuning",
        "url": "https://www.semanticscholar.org/paper/86907686d66e0c5ed2a9282f99e00cadd833c296",
        "stream": "Scriptural Sources",
        "domain": "Hadith Sciences",
        "topic": "Authenticity & Isnad",
        "leaf": "Chain/Matn Features"
    },
    {
        "title": "Arabic Part Of Speech (POS) Tagging Analysis using HMM Trigram method on Al-Qur’an Ayah Sentences",
        "abstract": "Part Of Speech (POS) tagging is part of Natural Language Processing to determine correctly the label in a sentence from the given input. Different POS tagging techniques in some literatures have been developed for English text, and few for Arabic texts. This problem uses a method based on the second hidden Markov model, which is looking for to two words to the past or better known as the HMM Trigram method. The main problems of POS tagging are Out Of Vocabulary (OOV) and word ambiguity. This study discusses POS tagging using HMM Trigram method on Al-Qur'an text data. The dataset is divided into three categories of data derived from quran corpus consists of 150 simple perfect sentences, 50 sentences with more than one S/P/O/K and 50 selected verses of the Qur'an. The data experiment was carried out using a cross-validation technique, namely k-fold cross validation. The data is classified into two, namely training data and test data. Training data is used to find emissions and transitions probabilities, while data testing uses the Viterbi algorithm. The experimental results achieved an average accuracy of 86% for simple datasets, 60% for medium datasets, and 38% for the complete paragraph datasets.",
        "url": "https://www.semanticscholar.org/paper/6e00592eb07128eef4304bcd0407f9d1b463db64",
        "stream": "Scriptural Sources",
        "domain": "Quran & Tafsir",
        "topic": "Processing & Analysis",
        "leaf": "Morphology/Syntax; Semantics/Topics"
    },
    {
        "title": "Proposing machine learning of Tafsir al-Quran: In search of objectivity with semantic analysis and Natural Language Processing",
        "abstract": "Computer technology is neutral information technology without any subjectivities and biases. The advantages of computer technology can help to minimize intervention and subjectivity in the interpretation of the Quran. The problem of subjectivity in interpretation of the Quran is a long discussion. However, Interpretation of Quran has interrelated each other called tafsir al-Quran bil Quran method. This article proposes objective methodology and design of machine learning of Tafsir al-Quran using the advances in data science technology. Using the latest artificial intelligence technology that is Machine Learning and Natural Language Processing (NLP). Furthermore, this proposal proves the novelty of the role of technology in the preparation of religious material in millennial life from a secondary role to a primary role.",
        "url": "https://www.semanticscholar.org/paper/2f67571a66e6a634a633f7d8fe4f7ee17688e366",
        "stream": "Scriptural Sources",
        "domain": "Quran & Tafsir",
        "topic": "Processing & Analysis",
        "leaf": "Morphology/Syntax; Semantics/Topics"
    },
    {
        "title": "Arabic Part Of Speech (POS) Tagging Analysis using Bee Colony Optimization (BCO) Algorithm on Quran Corpus",
        "abstract": "Part Of Speech (POS) tagging is an automated process for determining the appropriate grammatical label or syntactic category of a word depending on the context. POS tagging is one of the important processes in Natural Language Processing (NLP) applications such as summarization text, Speech Recognition (SR), Question Answering (QA) and Information Retrieval (IR). Automatic POS tagging is needed because manual POS tagging takes a long time and is expensive because it requires a linguist. The main problem in POS tagging automatically is words that have different properties if placed in different contexts (ambiguous) and words that are in the test corpus but not in the Out of Vocabulary (OOV) training corpus. In this study, an efficient POS tagging approach for Arabic text will be discussed using the Bee Colony Optimization (BCO) algorithm. The POS tagging problem is represented as a graph and a new weighting technique is proposed to assign a transition value to each word class label which may not be probability, then the bees look for the best solution path. The dataset used in this study comes from the transliterated Quranic corpus consisting of 150 simple perfect sentences as an easy dataset category, 50 sentences with more than one S/P/O/K as a medium dataset category, and 50 selected Quran verses as a category. difficult datasets. The proposed approach is evaluated using a cross-validation technique, namely k-fold cross validation. The results showed an average accuracy of 100% for the easy dataset category, 98.96% for the medium dataset category, and 94.96% for the difficult dataset category.",
        "url": "https://www.semanticscholar.org/paper/63aa61a5147cc4b0ed89b47b8cdada0b942d3272",
        "stream": "Scriptural Sources",
        "domain": "Quran & Tafsir",
        "topic": "Processing & Analysis",
        "leaf": "Morphology/Syntax; Semantics/Topics"
    },
    {
        "title": "Automatic Speech Recognition (ASR) Systems for Learning Arabic Language and Al-Quran Recitation: A Review",
        "abstract": "This paper provides a literature survey about Automatic Speech Recognition (ASR) systems for learning Arabic language and Al-Quran Recitation. The growth in communication technologies and AI (specially Machine learning and Deep learning) led researchers in ASR field to thinking of and developing ASR systems which mimic humans in their understand of natural speech and recognition. One of the most important applications in ASR is natural language processing (NLP). Arabic language is one of these languages. ASR systems which developed for Arabic language help Arabs and non-Arabs in learning Arabic language and so Al-Quran recitation and memorization in proper way according to recitation rules (Tajweed). This paper concentrate on ASR systems in general, challenges, PROS, CONS, Arabic language ASR systems and challenges faced them and finally Al-Quran recitation verification systems.",
        "url": "https://www.semanticscholar.org/paper/14c916e5000f9c0b2107afdd65016ca5058335f9",
        "stream": "Scriptural Sources",
        "domain": "Quran & Tafsir",
        "topic": "Audio/Multimodal",
        "leaf": "ASR/Recitation Support"
    },
    {
        "title": "Artificial Intelligence and  NLP -Based  Chatbot for Islamic Banking and Finance",
        "abstract": "The role of artificial intelligence (AI) is becoming increasingly important in the field of banking and finance. It has come a long way, and the trend is likely to continue for some time in the future as well. This research study reviews the role of artificial intelligence and use of technology in the finance and banking industry and how AI has changed the way the banks and financial institutions do their business. Customer engagement is one of the most critical parts of the finance and banking industry. This research proposes an artificial intelligence and natural language processing (NLP)-based chatbot model for advising the customers of Islamic banking and finance. Presently, the proposed chatbot is the first chatbot that will help the Islamic finance and banking customers to interact in real time and get Islamic financial advice based on the principles of Sharia related to individual's financial needs.",
        "url": "https://www.semanticscholar.org/paper/816676f81a97c4cf05c511955fe4766c83fb1a5e",
        "stream": "Law & Practice",
        "domain": "Fiqh & Fatwa",
        "topic": "Fatwa QA & Support",
        "leaf": "RAG + Citations; Uncertainty/Deferral"
    },
    {
        "title": "A Text Mining Discovery of Similarities and Dissimilarities Among Sacred Scriptures",
        "abstract": "The careful examination of sacred texts gives valuable insights into human psychology, different ideas regarding the organization of societies as well as into terms like truth and God. To improve and deepen our understanding of sacred texts, their comparison, and their separation is crucial. For this purpose, we use our data set has nine sacred scriptures. This work deals with the separation of the Quran, the Asian scriptures Tao-Te-Ching, the Buddhism, the Yogasutras, and the Upanishads as well as the four books from the Bible, namely the Book of Proverbs, the Book of Ecclesiastes, the Book of Ecclesiasticus, and the Book of Wisdom. These scriptures are analyzed based on the natural language processing NLP creating the mathematical representation of the corpus in terms of frequencies called document term matrix (DTM). After this analysis, machine learning methods like supervised and unsupervised learning are applied to perform classification. Here we use the Multinomial Naive Bayes (MNB), the Super Vector Machine (SVM), the Random Forest (RF), and the K-nearest Neighbors (KNN). We obtain that among these methods MNB is able to predict the class of a sacred text with an accuracy of about 85.84 %.",
        "url": "https://www.semanticscholar.org/paper/f8f1a49a709fac1d82af680fe970d10a71cd2ecf",
        "stream": "Scriptural Sources",
        "domain": "Quran & Tafsir",
        "topic": "Processing & Analysis",
        "leaf": "Morphology/Syntax; Semantics/Topics"
    },
    {
        "title": "THQuAD: Turkish Historic Question Answering Dataset for Reading Comprehension",
        "abstract": "Question answering(QA) is a field in natural language processing and information retrieval, it aims to give answers to the questions using natural language. In this paper, we present the Turkish question answering dataset, which is THQuAD and baseline results with contextualized word embeddings. THQuAD consists of two different datasets one of them is TQuad on Turkish Islamic Science history within the scope of Teknofest 2018 “Artificial Intelligence competition”, the second dataset on Ottoman history within the scope of Teknofest 2020 “Doğal Dil İşleme Yarışması ” prepared by us. THQuAD is a reading comprehension dataset, consisting of questions, answers, and passages. Our objective is to give an answer to a specific question by understanding the passage and extracting the answer from this passage. We generate contextualized word embeddings from pre-trained Turkish Bert, Electra, Albert language models after fine-tuning on different hyperparameters with neural networks.",
        "url": "https://www.semanticscholar.org/paper/f5a50d8639889641c03f7707389be36d1f41b229",
        "stream": "Shared Resources",
        "domain": "Datasets & Benchmarks",
        "topic": "Creation",
        "leaf": "Corpora/Annotation"
    },
    {
        "title": "Islamic and Late Modern Comparative Worldviews on Language: Towards Model for Translating Alien Key Concepts",
        "abstract": "Within the area of cultural discourse studies (CDSs), this article is presented to compare the late modern and Islamic worldviews on language. In so doing, the researcher uses a comparative qualitative method to explore the worldviews on language, word meaning, text, and context with specific attention to the writings of Norman Fairclough and those of Mohammed Naqib al-Attas. The analysis reveals that both worldviews coincide in terms of basic and relational meanings of words. Some differences are revealed in terms of the worldviews on language, text, and context. What distinguishes al-Attas’s Islamic worldview is that the authentic sources of knowledge (the Quran and the verified Sunnah) in the Arabic language provide a scientific context for concept-formation. The study contributes to a model for translation at worldview levels. It recommends further research on translating alien key concepts that have been introduced into the languages of Muslim people.",
        "url": "https://www.semanticscholar.org/paper/77e838f8de36c394e2be1017de7241d34652ae31",
        "stream": "Education & Community",
        "domain": "Contemporary Discourse",
        "topic": "Analysis",
        "leaf": "Sermons/Media; Stance/Theme Analysis"
    },
    {
        "title": "Quran Ontology: Review on Recent Research Issues",
        "abstract": ": In recent years, there are growing interests of Islamic Knowledge by both Muslims and non Muslims especially in Holy Quran. The researchers of religious Studies started to use the ontology to improve the knowledge construction and extraction from religious texts such as the Qur’an and Hadith. Ontology provide a shared understanding of a domain of interest, they become the key technology of modern knowledge based system, natural language processing, information retrieval and the semantic web (Johanna Volke, 2000). Most of recent researches have been done in Arabic language ontology, and most of them were focused on holy Quran ontology, although many of recent researches were done at that area but they are still incomplete, also there are some other issues including process used to extract and construct ontology, the methods used to build ontology are not unified(López, 1999), so it needs extra work. The review of existing studies will allow future researchers to reviewed different Ontology-based systems and different approaches to developing or “engineering” ontologies for specific domains. This paper tries to review recent research on Holy Quran ontology. We try to investigate the current trends and technology being applied. This investigation covers some important criteria, such as objective of study, outcomes of this studies, language of the text used (original Arabic text or other translation, technologies that used on ontology development, coverage which chapters of the Quran, coverage which topics, overlaps or links to other ontologies, Datasets, ontology testing techniques, and limitations on previous research",
        "url": "https://www.semanticscholar.org/paper/f350e84f88319b231ffcefa6ffa304ae41176088",
        "stream": "Scriptural Sources",
        "domain": "Hadith Sciences",
        "topic": "Structuring",
        "leaf": "NER & Ontologies; KG Construction"
    },
    {
        "title": "Automated Islamic Jurisprudential Legal Opinions Generation Using Artificial Intelligence",
        "abstract": "Islam is the second-largest and fastest-growing religion. The Islamic Law, Sharia, represents a profound component of the day-to-day lives of Muslims. While sources of Sharia are available for anyone, it often requires a highly qualified person, the Mufti, to provide Fatwa. With Islam followers representing almost 25% of the planet earth population, generating many queries, and the sophistication of the Mufti qualification process, creating a shortage in them, we have a supply-demand problem, calling for Automation solutions. This scenario motivates the application of Artificial Intelligence (AI) to Automated Islamic Fatwa in a scalable way that can adapt to various sources like social media. In this work, the potential of AI, Machine Learning, and Deep Learning, with technologies like Natural Language Processing (NLP), paving the way to help the Automation of Islam Fatwa are explored. The work started by surveying the State-of-The-Art (SoTA) of NLP and exploring the potential use-cases to solve the problems of Question answering and Text Classification in the Islamic Fatwa Automation. The first and major enabler component for AI application for Islamic Fatwa, the data were presented by building the largest dataset for Islamic Fatwa, spanning the widely used websites for Fatwa. Moreover, the baseline systems for Topic Classification, Topic Modeling, and Retrieval-based Question-Answering are presented to set the future research and benchmark on the dataset. Finally, the dataset is released and baselines to the public domain to help advance future research in the area.",
        "url": "https://www.semanticscholar.org/paper/ce7eca727a28f0c230ed65bcd5da3be54db52c6f",
        "stream": "Shared Resources",
        "domain": "Datasets & Benchmarks",
        "topic": "Creation",
        "leaf": "Corpora/Annotation; Shared Tasks"
    },
    {
        "title": "DTW at Qur’an QA 2022: Utilising Transfer Learning with Transformers for Question Answering in a Low-resource Domain",
        "abstract": "The task of machine reading comprehension (MRC) is a useful benchmark to evaluate the natural language understanding of machines. It has gained popularity in the natural language processing (NLP) field mainly due to the large number of datasets released for many languages. However, the research in MRC has been understudied in several domains, including religious texts. The goal of the Qur’an QA 2022 shared task is to fill this gap by producing state-of-the-art question answering and reading comprehension research on Qur’an. This paper describes the DTW entry to the Quran QA 2022 shared task. Our methodology uses transfer learning to take advantage of available Arabic MRC data. We further improve the results using various ensemble learning strategies. Our approach provided a partial Reciprocal Rank (pRR) score of 0.49 on the test set, proving its strong performance on the task.",
        "url": "https://www.semanticscholar.org/paper/a56c8e6b2db32abe2c38bbc4a78a4a895137d15d",
        "stream": "Scriptural Sources",
        "domain": "Quran & Tafsir",
        "topic": "Retrieval & QA",
        "leaf": "Search & Datasets"
    },
    {
        "title": "Arabic Quran Verses Authentication Using Deep Learning and Word Embeddings",
        "abstract": "Nowadays, with the developments witnessed by the Internet, algorithms have come to control all aspects of digital content. Due to its Arabic roots, it is ironic to find that Arabic Quranic content is still thirsty to benefit from computer linguistics, especially with the advent of artificial intelligence algorithms. The massive spread of Islamic-typed websites and applications has led to a widespread of digital Quranic content. Unfortunately, such content lacks censorship and can rarely match resourcefulness. It is quite difficult, especially for a non-native speaker of the Arabic language, to distinguish and authenticate the provided Quranic verses from the non-Quranic Arabic texts. Text processing techniques classified outside the field of Natural Language Processing (NLP) give less qualified results, especially with Arabic texts. To address this problem, we propose to explore Word Embeddings (WE) with Deep Learning (DL) techniques to identify Quranic verses in Arabic textual content. The proposed work is evaluated using twelve different word embeddings models with two popular classifiers for binary classification, namely: Convolutional Neural Network (CNN) and Long Short Term Memory (LSTM). The experimental results showed the superiority of the proposed approach over traditional methods in distinguishing between the Quranic verses and the Arabic text with an accuracy of 98.33%.",
        "url": "https://www.semanticscholar.org/paper/533c68890751a45303b6d1a71724d02f9ea12347",
        "stream": "Objectives & Governance",
        "domain": "Doctrinal Integrity",
        "topic": "Authenticity",
        "leaf": "Attribution Checks; Fabrication Signals"
    },
    {
        "title": "BERT based Named Entity Recognition for Automated Hadith Narrator Identification",
        "abstract": "Hadith serves as a second source of Islamic law for Muslims worldwide, especially in Indonesia, which has the world's most significant Muslim population of 228.68 million people. However, not all Hadith texts have been certified and approved for use, and several falsified Hadiths make it challenging to distinguish between authentic and fabricated Hadiths. In terms of Hadith science, determining the authenticity of a Hadith can be accomplished by examining its Sanad and Matn. Sanad is an essential aspect of the Hadith because it indicates the chain of the Narrator who transmits the Hadith. The research reported in this paper provides an advanced Natural Language Processing (NLP) technique for identifying and authenticating the Narrator of Hadith as a part of Sanad, utilizing Named Entity Recognition (NER) to address the necessity of authenticating the Hadith. The NER technique described in the research adds an extra feed-forward classifier to the last layer of the pre-trained BERT model. In the testing process using Cahya/bert-base-indonesian-1.5G, the proposed solution received an overall F1-score of 99.63 percent. On the Hadith Narrator Identification using other Hadith passages, the final examination yielded a 98.27 percent F1-score. Keywords—Hadith narrator; hadith authentication; natural language processing; named entity recognition; NLP; NER; BERT; BERT fine-tune",
        "url": "https://www.semanticscholar.org/paper/05ff3506924b93819c92f8333fc0ed340c661e3e",
        "stream": "Scriptural Sources",
        "domain": "Hadith Sciences",
        "topic": "Structuring",
        "leaf": "NER & Ontologies"
    },
    {
        "title": "An English Islamic Articles Dataset (EIAD) for developing an IslamBot Question Answering Chatbot",
        "abstract": "A chatbot is one of the most vastly recommended technologies to be used during these decades, especially through the digitization era. It could save much consumed time for both the users and the customer service employees. Chatbots could provide an answer to the asked questions instantly. IslamBot is an Islamic religion chatbot “i.e.,” responsible for answering any inquiries related to the Islamic religion. The aimed audience is non-Muslims people willing to join Islam or New-Muslims. Building such types of chatbots need to have an enormous amount of trusted data. Accordingly, in this paper The English Islamic Articles dataset (EIAD) is proposed as a benchmark reference for English Islamic question answering. So, this dataset contains about 10000 English Islamic articles. It is scrapped from authenticated and trusted websites like NewMuslims.com [1] IslamReligion.com [2], and IslamQA.com [3]. The dataset is about 275 articles from NewMuslims.com [1], 1550 articles from IslamReligion.com [2], and 8292 articles from IslamQA.com [3]. The EIAD dataset is a structured dataset “i.e.,” labeled and categorized. This dataset contains about 15 different categories. Each category is covering several different topics. This paper focuses on discussing how The English Islamic Articles dataset (EIAD) has been collected.",
        "url": "https://www.semanticscholar.org/paper/870e51833d71bcee713a69236065c20105d690aa",
        "stream": "Shared Resources",
        "domain": "Datasets & Benchmarks",
        "topic": "Creation",
        "leaf": "Corpora/Annotation"
    },
    {
        "title": "Islamic virtue-based ethics for artificial intelligence",
        "abstract": "The twenty-first century technological advances driven by exponential rise of artificial intelligence (AI) technology have ushered in a new era that offers many of us hitherto unimagined luxuries and facilities. However, under the guise of this progressive discourse, particularly in the backdrop of current neo-liberal late-capitalist postmodern world, AI development also has prompted an increasingly uncertain ethical tomorrow. This paper aims to probe the question of ethics by exploring the true ramifications of AI and interrogating its various ethical dimensions. It questions the essential goodness that is attributed to unstinted AI development before elucidating the ethical repercussions of AI advancements and the aptness of the current market logics and business models that govern the tech-industry. The paper next positions a holistic Islamic virtue-based AI ethics framework grounded in the context of Islamic objectives (maqāṣid) as an alternative ethical system for AI governance. We argue that this distinctive Islamic virtue-based ethical approach, which can be used to explore AI-related ethical problems more holistically due to its ontological base and rich tradition while keeping in check undue influence from the current socio-politico-economic climate, can be a valuable addition to the global discourse on AI ethics.",
        "url": "https://www.semanticscholar.org/paper/50e96cb48d5e455bd39839ec69e712ea6b7ad1a5",
        "stream": "Objectives & Governance",
        "domain": "Maqasid Lens",
        "topic": "Alignment",
        "leaf": "Bias/Safety Evaluation; Benchmark Creation"
    },
    {
        "title": "The Fellowship of the Authors: Disambiguating Names from Social Network Context",
        "abstract": "Most NLP approaches to entity linking and coreference resolution focus on retrieving similar mentions using sparse or dense text representations. The common\"Wikification\"task, for instance, retrieves candidate Wikipedia articles for each entity mention. For many domains, such as bibliographic citations, authority lists with extensive textual descriptions for each entity are lacking and ambiguous named entities mostly occur in the context of other named entities. Unlike prior work, therefore, we seek to leverage the information that can be gained from looking at association networks of individuals derived from textual evidence in order to disambiguate names. We combine BERT-based mention representations with a variety of graph induction strategies and experiment with supervised and unsupervised cluster inference methods. We experiment with data consisting of lists of names from two domains: bibliographic citations from CrossRef and chains of transmission (isnads) from classical Arabic histories. We find that in-domain language model pretraining can significantly improve mention representations, especially for larger corpora, and that the availability of bibliographic information, such as publication venue or title, can also increase performance on this task. We also present a novel supervised cluster inference model which gives competitive performance for little computational effort, making it ideal for situations where individuals must be identified without relying on an exhaustive authority list.",
        "url": "https://www.semanticscholar.org/paper/8322e837c31501eaa06ed2e80e3e746b42e15f13",
        "stream": "Scriptural Sources",
        "domain": "Hadith Sciences",
        "topic": "Authenticity & Isnad",
        "leaf": "Graph/Network Analysis"
    },
    {
        "title": "Quranic Conversations: Developing a Semantic Search tool for the Quran using Arabic NLP Techniques",
        "abstract": "The Holy Book of Quran is believed to be the literal word of God (Allah) as revealed to the Prophet Muhammad (PBUH) over a period of approximately 23 years. It is the book where God provides guidance on how to live a righteous and just life, emphasizing principles like honesty, compassion, charity and justice, as well as providing rules for personal conduct, family matters, business ethics and much more. However, due to constraints related to the language and the Quran organization, it is challenging for Muslims to get all relevant ayahs (verses) pertaining to a matter or inquiry of interest. Hence, we developed a Quran semantic search tool which finds the verses pertaining to the user inquiry or prompt. To achieve this, we trained several models on a large dataset of over 30 tafsirs, where typically each tafsir corresponds to one verse in the Quran and, using cosine similarity, obtained the tafsir tensor which is most similar to the prompt tensor of interest, which was then used to index for the corresponding ayah in the Quran. Using the SNxLM model, we were able to achieve a cosine similarity score as high as 0.97 which corresponds to the abdu tafsir for a verse relating to financial matters.",
        "url": "http://arxiv.org/abs/2311.05120v1",
        "stream": "Scriptural Sources",
        "domain": "Quran & Tafsir",
        "topic": "Retrieval & QA",
        "leaf": "Search & Datasets"
    },
    {
        "title": "AraQA: An Arabic Generative Question-Answering Model for Authentic Religious Text",
        "abstract": "Recently, the internet has become a vast repository of religious texts and sources. The quest for valid and dependable Islamic Q/A that provides accurate substantiation from the Holy Quran (Muslim holy book) and Hadith (Prophet Muhammed teachings) has become challenging, given the abundance of misleading answers lacking credible evidence and proper sources. Concurrently, transformer-based architectures have demonstrated remarkable efficacy in language modeling and comprehension. Notably, applications in religious Arabic generative question answering have remained underdeveloped, primarily due to the lack of available Arabic religious datasets. In this paper, we present an Arabic Islamic generative question-answer model named AraQA, which has been fine-tuned using Arabic Islamic question/answer pairs meticulously gathered and extracted from reputable open-source web sites on the internet. The model is initially designed to operate exclusively in the Arabic Language. Our model attains an impressive perplexity score of 2.3 when evaluated on held-out question-answer pairs. We have made the model publicly accessible via GitHub, anticipating it will pave the way for research in Arabic and religious Natural Language Processing (NLP).11https://github.com/Marje3na/AraQA-An-Arabic-Generative-Question-Answering-Model-for-Authentic-Religious-Text",
        "url": "https://www.semanticscholar.org/paper/1adfc2185a0ce393f0ca15ebdbd3f0d991b53fe8",
        "stream": "Scriptural Sources",
        "domain": "Quran & Tafsir",
        "topic": "Retrieval & QA",
        "leaf": "RAG & Evidence Linking; Search & Datasets"
    },
    {
        "title": "A Data-Driven Exploration of a New Islamic Fatwas Dataset for Arabic NLP Tasks",
        "abstract": "Islamic content is a broad and diverse domain that encompasses various sources, topics, and perspectives. However, there is a lack of comprehensive and reliable datasets that can facilitate conducting studies on Islamic content. In this paper, we present fatwaset, the first public Arabic dataset of Islamic fatwas. It contains Islamic fatwas that we collected from various trusted and authenticated sources in the Islamic fatwa domain, such as agencies, religious scholars, and websites. Fatwaset is a rich resource as it does not only contain fatwas but also includes a considerable set of their surrounding metadata. It can be used for many natural language processing (NLP) tasks, such as language modeling, question answering, author attribution, topic identification, text classification, and text summarization. It can also support other domains that are related to Islamic culture, such as philosophy and language art. We describe the methodology and criteria we used to select the content, as well as the challenges and limitations we faced. Additionally, we perform an Exploratory Data Analysis (EDA), which investigates the dataset from different perspectives. The results of the EDA reveal important information that greatly benefits researchers in this area.",
        "url": "https://www.semanticscholar.org/paper/2cf09b9348eacfeaea43ba03a8e1a846adb1012c",
        "stream": "Shared Resources",
        "domain": "Datasets & Benchmarks",
        "topic": "Creation",
        "leaf": "Corpora/Annotation; Shared Tasks"
    },
    {
        "title": "ARABIC-FUNDAMENTALS OF FINANCIAL INTEGRITY AND THEIR APPLICATIONS IN ISLAMIC LAW",
        "abstract": "The study of the foundations of integrity and its applications in Islamic law stems from the priorities of reality, the requirements of safety of life, the development of society, and the success of economic and social life. This study came to show the foundations of integrity based on the legal evidence from the Holy Qur’an and the Noble Hadith, which included the method of trading public and private money and how to deal with job holders, and this is the first goal that the study sought to achieve, and revealed a number of provisions that preserve money and make disposal It is for the wise, and the hands of the foolish are restrained from it, and the basis of financial dealings is established on the basis of trust. For this reason, cheating, deceit, bribery, theft, and other things that mean encroaching on money are prohibited. As for the second objective represented in the legal applications, he studied a selected group of noble hadiths that give the reader an integrated picture of the comprehensiveness of these applications and their complete agreement with the provisions of the Noble Qur’an and the noble hadith, and at the same time make money a high value, preventing encroachment on it, whether it is little or a lot, and closes the outlets Deception and manipulation under the name of gift, favoritism, or others, noting that the meanings of the legal texts and their applications provide the basic foundation for fair financial action, far from extravagance, waste, or irresponsible behavior. The study concluded with some recommendations related to its subject.",
        "url": "https://www.semanticscholar.org/paper/2beb254017fd7eecb7a8479b7f3da3b4d6a67a05",
        "stream": "Law & Practice",
        "domain": "Fiqh & Fatwa",
        "topic": "Reasoning & Evaluation",
        "leaf": "Benchmarks"
    },
    {
        "title": "HAQA and QUQA: Constructing Two Arabic Question-Answering Corpora for the Quran and Hadith",
        "abstract": "It is neither possible nor fair to compare the performance of question-answering systems for the Holy Quran and Hadith Sharif in Arabic due to both the absence of a golden test dataset on the Hadith Sharif and the small size and easy questions of the newly created golden test dataset on the Holy Quran. This article presents two question–answer datasets: Hadith Question–Answer pairs (HAQA) and Quran Question–Answer pairs (QUQA). HAQA is the first Arabic Hadith question–answer dataset available to the research community, while the QUQA dataset is regarded as the more challenging and the most extensive collection of Arabic question–answer pairs on the Quran. HAQA was designed and its data collected from several expert sources, while QUQA went through several steps in the construction phase; that is, it was designed and then integrated with existing datasets in different formats, after which the datasets were enlarged with the addition of new data from books by experts. The HAQA corpus consists of 1598 question–answer pairs, and that of QUQA contains 3382. They may be useful as gold–standard datasets for the evaluation process, as training datasets for language models with question-answering tasks and for other uses in artificial intelligence.",
        "url": "https://www.semanticscholar.org/paper/2aa382e75e8bc9dbb7e4d5e895152208b76b668a",
        "stream": "Shared Resources",
        "domain": "Datasets & Benchmarks",
        "topic": "Creation",
        "leaf": "Corpora/Annotation; Shared Tasks"
    },
    {
        "title": "Building Domain-Specific LLMs Faithful To The Islamic Worldview: Mirage or Technical Possibility?",
        "abstract": "Large Language Models (LLMs) have demonstrated remarkable performance across numerous natural language understanding use cases. However, this impressive performance comes with inherent limitations, such as the tendency to perpetuate stereotypical biases or fabricate non-existent facts. In the context of Islam and its representation, accurate and factual representation of its beliefs and teachings rooted in the Quran and Sunnah is key. This work focuses on the challenge of building domain-specific LLMs faithful to the Islamic worldview and proposes ways to build and evaluate such systems. Firstly, we define this open-ended goal as a technical problem and propose various solutions. Subsequently, we critically examine known challenges inherent to each approach and highlight evaluation methodologies that can be used to assess such systems. This work highlights the need for high-quality datasets, evaluations, and interdisciplinary work blending machine learning with Islamic scholarship.",
        "url": "http://arxiv.org/abs/2312.06652v1",
        "stream": "Objectives & Governance",
        "domain": "Maqasid Lens",
        "topic": "Alignment",
        "leaf": "Bias/Safety Evaluation; Benchmark Creation"
    },
    {
        "title": "Optimalisasi Menghafal Al-Qur'an: Penerapan Metode Neuro Linguistic Programming (NLP) di Pesantren Islamic Centre Sumut",
        "abstract": "This research aims to analyze the application of NLP/Neuro Linguistic Programming methods in improving the quality of memorizing the Quran at the Islamic Center. Sumut is well organized from the formation of the tasmi class, creating a conversational atmosphere to memorize, reminding that everything is aimed at and meaningful, understanding the learning style of the pupils, stimulating the brain performance to the maximum, giving judgment, identifying the problems of central and central difficulties in memorizing, giving motivation and solutions in the form of positive advice to the central and central, and giving reinforcement or strengthening. The data collection techniques used are observations, interviews, and documentation studies. The results of the research show that the implementation of the NLP/Neuro Linguistic Programming method improves the quality of memorizing the Qur'an at the Islamic Centre. Sumut is well organized starting from the formation of the tasmi class, creates a conversation atmosphere to memorize, reminds that everything is aimed at and meaningful, understands the learning style of the pupils, stimulates the brain performance to the maximum, gives judgment, identifies the problems of the centri and santriwati difficulties in falsifying, gives motivation and solutions in the form of positive advice to the santri and santriwati, gives reinforcement or strengthening, and evaluates the application of the NLP method in the Madrasah Hifzil Islamic Quran Centre.",
        "url": "https://www.semanticscholar.org/paper/6d4c1c727ad4d7869b04be2a5e1bd371786b6074",
        "stream": "Education & Community",
        "domain": "Islamic Education",
        "topic": "Pedagogy",
        "leaf": "Qualitative Studies"
    },
    {
        "title": "Hadiths Classification Using a Novel Author-Based Hadith Classification Dataset (ABCD)",
        "abstract": "Religious studies are a rich land for Natural Language Processing (NLP). The reason is that all religions have their instructions as written texts. In this paper, we apply NLP to Islamic Hadiths, which are the written traditions, sayings, actions, approvals, and discussions of the Prophet Muhammad, his companions, or his followers. A Hadith is composed of two parts: the chain of narrators (Sanad) and the content of the Hadith (Matn). A Hadith is transmitted from its author to a Hadith book author using a chain of narrators. The problem we solve focuses on the classification of Hadiths based on their origin of narration. This is important for several reasons. First, it helps determine the authenticity and reliability of the Hadiths. Second, it helps trace the chain of narration and identify the narrators involved in transmitting Hadiths. Finally, it helps understand the historical and cultural contexts in which Hadiths were transmitted, and the different levels of authority attributed to the narrators. To the best of our knowledge, and based on our literature review, this problem is not solved before using machine/deep learning approaches. To solve this classification problem, we created a novel Author-Based Hadith Classification Dataset (ABCD) collected from classical Hadiths’ books. The ABCD size is 29 K Hadiths and it contains unique 18 K narrators, with all their information. We applied machine learning (ML), and deep learning (DL) approaches. ML was applied on Sanad and Matn separately; then, we did the same with DL. The results revealed that ML performs better than DL using the Matn input data, with a 77% F1-score. DL performed better than ML using the Sanad input data, with a 92% F1-score. We used precision and recall alongside the F1-score; details of the results are explained at the end of the paper. We claim that the ABCD and the reported results will motivate the community to work in this new area. Our dataset and results will represent a baseline for further research on the same problem.",
        "url": "https://www.semanticscholar.org/paper/695bc796f9452a56624c0977248bc3e652823468",
        "stream": "Shared Resources",
        "domain": "Datasets & Benchmarks",
        "topic": "Creation",
        "leaf": "Corpora/Annotation; Shared Tasks"
    },
    {
        "title": "What Makes Work “Good” in the Age of Artificial Intelligence (AI)? Islamic Perspectives on AI-Mediated Work Ethics",
        "abstract": "Artificial intelligence (AI) technologies are increasingly creeping into the work sphere, thereby gradually questioning and/or disturbing the long-established moral concepts and norms communities have been using to define what makes work good. Each community, and Muslims make no exception in this regard, has to revisit their moral world to provide well-thought frameworks that can engage with the challenging ethical questions raised by the new phenomenon of AI-mediated work. For a systematic analysis of the broad topic of AI-mediated work ethics from an Islamic perspective, this article focuses on presenting an accessible overview of the “moral world” of work in the Islamic tradition. Three main components of this moral world were selected due to their relevance to the AI context, namely (1) Work is inherently good for humans, (2) Practising a religiously permitted profession and (c) Maintaining good relations with involved stakeholders. Each of these three components is addressed in a distinct section, followed by a sub-section highlighting the relevance of the respective component to the particular context of AI-mediated work. The article argues that there are no unsurmountable barriers in the Islamic tradition against the adoption of AI technologies in work sphere. However, important precautions should be considered to ensure that embracing AI will not be at the cost of work-related moral values. The article also highlights how important lessons can be learnt from the positive historical experience of automata that thrived in the Islamic civilization.",
        "url": "https://www.semanticscholar.org/paper/bdcdb9c4e8bcdae8f130711abb88dd430ded380c",
        "stream": "Objectives & Governance",
        "domain": "Maqasid Lens",
        "topic": "Alignment",
        "leaf": "Bias/Safety Evaluation; Benchmark Creation"
    },
    {
        "title": "Usability Measurement of Aswaja Chatbot with System Usability Scale (SUS)",
        "abstract": "Chatbots are becoming increasingly popular as human-computer interfaces or robots. Virtual assistants, such as chatbots, have exploded in popularity in recent years thanks to breakthroughs in areas like machine learning, artificial intelligence, and even more fundamental technologies like neural networks and natural language processing. The Aswaja chatbot application is an application that supports strengthening Islamic character for the young generation of Nahdlatul Ulama (NU). This Aswaja chatbot will make it easier for Muslims, especially millennials, to obtain valid and trustworthy references on religious issues that are in accordance with the teachings of Ahlussunah wal Jamaah. The widespread use of chatbots must be followed by ongoing evaluation to determine the effectiveness and ensure the continued use of the Aswaja chatbot application. This research aims to conduct an evaluation of the Aswaja chatbot application. This study used the System Usability Scale to assess how user-friendly the Aswaja chatbot application was. With a SUS Score of 64,037, we can confidently say that this value falls into the Good category of the final adjective rating score indication, the D category of the grade scale, and the marginal high category of the acceptability ranges.",
        "url": "https://www.semanticscholar.org/paper/60bc9d03dccbb0da8034c69b8fcd02fb0ac120a7",
        "stream": "Education & Community",
        "domain": "Islamic Education",
        "topic": "Learning Systems",
        "leaf": "Chatbots/Apps/Portals; User Studies"
    },
    {
        "title": "Model Pembelajaran Amtsal Dan Implikasinya Dalam Pembelajaran Pendidikan Agama Islam",
        "abstract": "Quranic verses contain amtsal (examples and figurative language) which can be used in teaching. As a learning model, amtsal can become a necessary alternative to achieve efficient and effective teaching and learning. Yet, this model in teaching is not sufficiently explored. A review of Quranic verses identifies three types of amtsal; musharrah, kaminah, and mursalah. Literature review shows that this model enables teachers to present abstract perceptions as sensed information and knowledge. It allows students to understand and grasp the meaning of abstract concepts easily and receive their hidden meanings which can become useful guidelines in life. The study concludes that this Quran-based model is effective to be used in Islamic Religious Education as it supports students’ critical thinking and increases their acceptance of Islamic teachings. The model also makes learning more fun and engaging.",
        "url": "https://www.semanticscholar.org/paper/19238e8fd2136ddd8ab0831d3a8cb082b03e2d03",
        "stream": "Education & Community",
        "domain": "Islamic Education",
        "topic": "Pedagogy",
        "leaf": "Qualitative Studies"
    },
    {
        "title": "DIACRITIC-AWARE ALIGNMENT AND CLASSIFICATION IN ARABIC SPEECH: A FUSION OF FUZTPI AND ML MODELS",
        "abstract": "This paper presents the Quran Speech Recognition (QRSR) system, achieving alignment and classification accuracies up to 96%. The system is designed to advance Arabic Automatic Speech Recognition (ASR) and Text-to-Speech (TTS) by focusing on the Arabic diacritic-annotated text. We address the limitations of existing Arabic ASR systems and introduce the Fuzzy Text Alignment and Rule-based Classifier (FTARC) for segmenting audio files and aligning text. The FuzTPI algorithm is integrated with Machine Learning models like Na¨ıve Bayes, Support Vector Machine, and Random Forest. This research aims to generalize the findings for broader Arabic text and contribute to an expanded audio dataset, thereby enhancing Arabic NLP and speech recognition capabilities.",
        "url": "https://www.semanticscholar.org/paper/83d64f0185cdba3ce28cda4b465029bfc60337c3",
        "stream": "Scriptural Sources",
        "domain": "Quran & Tafsir",
        "topic": "Audio/Multimodal",
        "leaf": "ASR/Recitation Support"
    },
    {
        "title": "(An Analysis of the Content of the Holy Qur’an and Islamic Education For The Second intermediate According to the Skills of Imaginative Thinking",
        "abstract": "This current paper analyzes the book of the Holy Quran and Islamic Education for the second intermediate, according to their performance of the imaginative thinking skills (2021-2022) by answering the following question: \nWhat are the  imaginative thinking skills included in the content of the Holy Qur’an and Islamic education book for the second intermediate grade and the transactions of the Ministry of Education / General Directorate of Curricula in the academic year (2021-2022 )? For the purpose of the research objective, the researcher relied on the educational literature related to the topic of the research and previous studies in imaginative thinking skills in order to prepare a list that includes (3) sub-skills, (11) sub-skills, and (28) an indicator that pertains to all skills. \n  The researcher used the descriptive analytical method for its appropriateness to the objectives of the research. He used the book of the Holy Qur’an and Islamic Education for the second grade average for his research and used it as a sample, which was approved for the academic year (2021-2022 AD), then the researcher analyzed this textbook, and relied on the (explicit and implicit) curriculum.  The validity of the analysis is achieved using a random sample of the group of jury members. Reliability is achieved by agreement with external jury members after a period of analysis using ‘Cooper’ formula. The researcher was reached in achieving the book of the Noble Qur’an and Islamic Education for the second grade, an average of (668) recurrences and at a rate of (20%), for all results the researcher recommended the following: \n  Imaginative thinking skills section in the book of the Noble Qur’an and Islamic Education for the second intermediate grade is selected. \n \n \n \n \n  The researcher has suggested, analyzing the Holy Qur’an and Islamic education book for different stages, and teaching areas according to imaginative thinking skills.",
        "url": "https://www.semanticscholar.org/paper/f9cac4cb563cfa835deb6a7ad1cfba4cb49dbee4",
        "stream": "Education & Community",
        "domain": "Islamic Education",
        "topic": "Pedagogy",
        "leaf": "Curriculum Design"
    },
    {
        "title": "Revolutionizing Arabic Language Reading Skills Among Junior Islamic School Students via Innovative Digital Comic Learning Media",
        "abstract": "This research aims to investigate the efficacy of utilizing digital comic media to enhance Qira'ah proficiency among seventh-grade students at MTs AL-Hikmah Bandar Lampung. The study addresses the following research questions: 1) How does the development of digital comic media contribute to improving Qira'ah proficiency among seventh-grade students at MTs AL-Hikmah Bandar Lampung; 2) What is the feasibility assessment of the digital comic media in enhancing Qira'ah proficiency among class VII students at MTs AL-Hikmah Bandar Lampung; 3) How do students respond to the implementation of digital comic media to enhance Qira'ah proficiency at MTs AL-Hikmah Bandar Lampung. Employing a research and development (R&D) approach, this study follows the ADDIE development model encompassing Analysis, Design, Development, Implementation, and Evaluation stages. The research outcomes indicate the high feasibility of Arabic digital comic media, validated by media experts with a commendable assessment score of 94.1%, and material experts with a noteworthy score of 91%. Additionally, student responses to the digital comic media garnered an overall average percentage of 91%, demonstrating a favorable reception. Likewise, teacher assessments of the digital comic media received a 95.5% score, attesting to its positive utility in the learning process. In conclusion, the developed Arabic digital comic media holds great promise as an effective tool for enhancing Qira'ah proficiency in the learning activities.",
        "url": "https://www.semanticscholar.org/paper/45ec34b9469dcd204b2b8ffdd4ce75119a3964f3",
        "stream": "Education & Community",
        "domain": "Islamic Education",
        "topic": "Learning Systems",
        "leaf": "Chatbots/Apps/Portals; User Studies"
    },
    {
        "title": "Quran Recitation Recognition using End-to-End Deep Learning",
        "abstract": "The Quran is the holy scripture of Islam, and its recitation is an important aspect of the religion. Recognizing the recitation of the Holy Quran automatically is a challenging task due to its unique rules that are not applied in normal speaking speeches. A lot of research has been done in this domain, but previous works have detected recitation errors as a classification task or used traditional automatic speech recognition (ASR). In this paper, we proposed a novel end-to-end deep learning model for recognizing the recitation of the Holy Quran. The proposed model is a CNN-Bidirectional GRU encoder that uses CTC as an objective function, and a character-based decoder which is a beam search decoder. Moreover, all previous works were done on small private datasets consisting of short verses and a few chapters of the Holy Quran. As a result of using private datasets, no comparisons were done. To overcome this issue, we used a public dataset that has recently been published (Ar-DAD) and contains about 37 chapters that were recited by 30 reciters, with different recitation speeds and different types of pronunciation rules. The proposed model performance was evaluated using the most common evaluation metrics in speech recognition, word error rate (WER), and character error rate (CER). The results were 8.34% WER and 2.42% CER. We hope this research will be a baseline for comparisons with future research on this public new dataset (Ar-DAD).",
        "url": "http://arxiv.org/abs/2305.07034v1",
        "stream": "Scriptural Sources",
        "domain": "Quran & Tafsir",
        "topic": "Audio/Multimodal",
        "leaf": "ASR/Recitation Support"
    },
    {
        "title": "Universal Language Modelling agent",
        "abstract": "Large Language Models are designed to understand complex Human Language. Yet, Understanding of animal language has long intrigued researchers striving to bridge the communication gap between humans and other species. This research paper introduces a novel approach that draws inspiration from the linguistic concepts found in the Quran, a revealed Holy Arabic scripture dating back 1400 years. By exploring the linguistic structure of the Quran, specifically the components of ism, fil, and harf, we aim to unlock the underlying intentions and meanings embedded within animal conversations using audio data. To unravel the intricate complexities of animal language, we employ word embedding techniques to analyze each distinct frequency component. This methodology enables the identification of potential correlations and the extraction of meaningful insights from the data. Furthermore, we leverage a bioacoustics model to generate audio, which serves as a valuable resource for training natural language processing (NLP) techniques. This Paper aims to find the intention* behind animal language rather than having each word translation.",
        "url": "https://www.semanticscholar.org/paper/a89398dbe455796abf9398241e397d3753544ef2",
        "stream": "Scriptural Sources",
        "domain": "Quran & Tafsir",
        "topic": "Processing & Analysis",
        "leaf": "Morphology/Syntax; Semantics/Topics"
    },
    {
        "title": "Natural Language Processing for Interactive and Personalized Qur’anic Education",
        "abstract": "The development of artificial intelligence technology, particularly Natural Language Processing (NLP), has opened significant opportunities for transforming Qur’anic learning methods. NLP, as a branch of AI focused on the interaction between computers and human languages, offers new approaches to understanding, analyzing, and teaching the text of the Qur’an in a more interactive and personalized manner. This article examines the utilization of NLP technology in the context of Qur’anic education, from the application of Arabic word morphology analysis to paragraph search systems based on meaning, and the development of virtual assistants capable of answering questions about the contents of the Qur’an. This approach not only enhances accessibility and learning efficiency but also strengthens semantic and contextual understanding of the holy verses. The study also highlights linguistic challenges in processing classical Arabic, as well as the importance of quality annotations and digital corpora. Through a literature review and case study implementation, this article demonstrates that the integration of NLP in Qur’anic learning is a strategic step to enrich Islamic education methods in the digital era, while also bridging the younger generation to the values of the Qur’an through relevant technology.",
        "url": "https://www.semanticscholar.org/paper/f9a18cd858354c20d5753b5cf17f5667c4933fe2",
        "stream": "Education & Community",
        "domain": "Islamic Education",
        "topic": "Learning Systems",
        "leaf": "Chatbots/Apps/Portals; User Studies"
    },
    {
        "title": "Teaching Arabic Reading Skills For Bahtsul Masail Purpose In Islamic Boarding School/ تعليم مهارة القراءة لأغراض بحث المسائل في المعهد",
        "abstract": "In teaching Arabic as a foreign language, several problems were found, including linguistic and non-linguistic issues. Salafiyah Shirothul Fuqoha Islamic Boarding School has a system to solve this problem so that students have high reading competence, namely a Teaching System of Reading Skills for Bahtsul Masail purpose. This study aims to describe and analyze: (1) the Teaching System of Reading Skills for Bahtsul Masail purpose at Salafiyah Shirothul Fuqoha Islamic Boarding School; (2) the contribution of Teaching System of Reading Skills for Bahtsul Masail purpose to increase student competence at Salafiyah Shirothul Fuqoha' Islamic Boarding School Malang. This study uses a qualitative approach with case studies. Observation, interviews, and documentation obtained data collection techniques in this study. According to Miles and Huberman, data analysis was carried out using data analysis techniques with three steps: data reduction, data display, and conclusions drawing. The results of this study are (1) Teaching System of Reading Skills for Bahtsul Masail purpose at the Salafiyah Shirothul Fuqoha Islamic Boarding School Malang consists of Regular program, Sorogan, Takhassus, Part Bahtsul Masail, and Joint Bahtsul Masail; (2) The contribution of the Teaching System of Reading Skills for Bahtsul Masail purpose can increase student competence to achieve creative reading competence.",
        "url": "https://www.semanticscholar.org/paper/1a87a3af1ec209d62a2b252f82d32966aeed549d",
        "stream": "Education & Community",
        "domain": "Islamic Education",
        "topic": "Pedagogy",
        "leaf": "Qualitative Studies"
    },
    {
        "title": "AceGPT, Localizing Large Language Models in Arabic",
        "abstract": "This paper is devoted to the development of a localized Large Language Model (LLM) specifically for Arabic, a language imbued with unique cultural characteristics inadequately addressed by current mainstream models. Significant concerns emerge when addressing cultural sensitivity and local values. To address this, the paper proposes a comprehensive solution that includes further pre-training with Arabic texts, Supervised Fine-Tuning (SFT) utilizing native Arabic instructions, and GPT-4 responses in Arabic, alongside Reinforcement Learning with AI Feedback (RLAIF) employing a reward model attuned to local culture and values. The goal is to cultivate culturally cognizant and value-aligned Arabic LLMs capable of accommodating the diverse, application-specific needs of Arabic-speaking communities. Comprehensive evaluations reveal that the resulting model, dubbed ‘AceGPT’, sets the state-of-the-art standard for open Arabic LLMs across various benchmarks. Codes, data, and models are in https://github.com/FreedomIntelligence/AceGPT.",
        "url": "https://www.semanticscholar.org/paper/859d9e9c77ef556fc6257c2a395e9edfcac3b775",
        "stream": "Objectives & Governance",
        "domain": "Maqasid Lens",
        "topic": "Alignment",
        "leaf": "Bias/Safety Evaluation; Benchmark Creation"
    },
    {
        "title": "Artificial Intelligence (AI) in Islamic Ethics: Towards Pluralist Ethical Benchmarking for AI",
        "abstract": "This paper explores artificial intelligence (AI) ethics from an Islamic perspective at a critical time for AI ethical norm-setting. It advocates for a pluralist approach to ethical AI benchmarking. As rapid advancements in AI technologies pose challenges surrounding autonomy, privacy, fairness, and transparency, the prevailing ethical discourse has been predominantly Western or Eurocentric. To address this imbalance, this paper delves into the Islamic ethical traditions to develop a framework that contributes to the global debate on optimal norm setting for designing and using AI technologies. The paper outlines Islamic parameters for ethical values and moral actions in the context of AI's ethical uncertainties. It emphasizes the significance of both textual and non-textual Islamic sources in addressing these uncertainties while placing a strong emphasis on the notion of \"good\" or \" maṣlaḥa \" as a normative guide for AI's ethical evaluation. Defining maṣlaḥa as an ethical state of affairs in harmony with divine will, the paper highlights the coexistence of two interpretations of maṣlaḥa : welfarist/utility-based and duty-based. Islamic jurisprudence allows for arguments supporting ethical choices that prioritize building the technical infrastructure for AI to maximize utility. Conversely, it also supports choices that reject consequential utility calculations as the sole measure of value in determining ethical responses to AI advancements.",
        "url": "https://www.semanticscholar.org/paper/e700e8b1620a31af8f866a623e1e35caa05882a0",
        "stream": "Objectives & Governance",
        "domain": "Maqasid Lens",
        "topic": "Pluralism",
        "leaf": "Handling Disagreement"
    },
    {
        "title": "QASiNa: Religious Domain Question Answering Using Sirah Nabawiyah",
        "abstract": "Nowadays, Question Answering (QA) tasks receive significant research focus, particularly with the development of Large Language Model (LLM) such as Chat GPT [1]. LLM can be applied to various domains, but it contradicts the principles of information transmission when applied to the Islamic domain. In Islam we strictly regulates the sources of information and who can give interpretations or tafseer for that sources [2]. The approach used by LLM to generate answers based on its own interpretation is similar to the concept of tafseer, LLM is neither an Islamic expert nor a human which is not permitted in Islam. Indonesia is the country with the largest Islamic believer population in the world [3]. With the high influence of LLM, we need to make evaluation of LLM in religious domain. Currently, there is only few religious QA dataset available and none of them using Sirah Nabawiyah especially in Indonesian Language. In this paper, we propose the Question Answering Sirah Nabawiyah (QASiNa) dataset, a novel dataset compiled from Sirah Nabawiyah literatures in Indonesian language. We demonstrate our dataset by using mBERT [4], XLM-R [5], and IndoBERT [6] which fine-tuned with Indonesian translation of SQuAD v2.0 [7]. XLM-R model returned the best performance on QASiNa with EM of 61.20, F1-Score of 75.94, and Substring Match of 70.00. We compare XLM-R performance with Chat GPT-3.5 and GPT-4 [1]. Both Chat GPT version returned lower EM and F1-Score with higher Substring Match, the gap of EM and Substring Match get wider in GPT-4. The experiment indicate that Chat GPT tends to give excessive interpretations as evidenced by its higher Substring Match scores compared to EM and F1-Score, even after providing instruction and context. This concludes Chat GPT is unsuitable for question answering task in religious domain especially for Islamic religion.",
        "url": "https://www.semanticscholar.org/paper/25a948ef2f05450ef229e532b2c5144d07bef2e3",
        "stream": "Shared Resources",
        "domain": "Datasets & Benchmarks",
        "topic": "Creation",
        "leaf": "Corpora/Annotation; Shared Tasks"
    },
    {
        "title": "DEVELOPMENT OF MODERN INDONESIAN NOVEL TEACHING BOOKS IN THE 2000 RELIGIOUS EDUCATION BASED",
        "abstract": "Literary criticism course is a compulsory subject that must be taken and taken by Indonesian Language Education students. This course has achievements, namely that students are able to distinguish types of literary criticism, methods of literary criticism, and schools of literary criticism. however, this material is often provided without a religious education basis and integrated material in schools. Even though STKIP Al Hikmah Surabaya students will use this provision of knowledge as teaching material when pursuing it at school. In addition, the materials in the textbooks of literary criticism are integrated with Islamic values as an effort to create teachers who have good morals through literary criticism courses. The purpose of this research is to develop textbooks on modern Indonesian novels in the 2000s based on religious education, especially the values of Islamic integration in literary criticism courses. Furthermore, the design of this research is development research using the 4D model (four-D model) which consists of four stages, namely define, design, develop, and disseminate. The data collection technique used was review and validation from experts, as well as questionnaires and the results of interviews with students. Textbook validation involved three experts, namely presentation experts, material experts, and linguists. Meanwhile, the final trial of the textbooks involved 17 students of the STKIP Indonesian Language Education Study Program. Furthermore, the data that has been obtained will be analyzed qualitatively and quantitatively. Based on the results of this analysis, it can be determined whether the textbook, literary criticism, has been developed effectively and is suitable for use in lectures. The results of this study, namely the Literary Criticism book, show that this book is suitable for use with the title \"Good\" with an average score of 3.1 (78%), with details, eligibility for content 3 (75%), eligibility for presentation 3.3 (83%) ), and language feasibility 3 (75%). Furthermore, Student Responses to the book Literary Criticism Based on Religious Education, namely from content 87%, presentation 86%, and language 83%, so it can be concluded that this book is effective as a textbook for literary criticism courses. Keywords: Development and Research, Textbooks, and Literary Criticism",
        "url": "https://www.semanticscholar.org/paper/0143dd66497e98035f332c0e6e45ae0fe8486813",
        "stream": "Education & Community",
        "domain": "Islamic Education",
        "topic": "Pedagogy",
        "leaf": "Curriculum Design"
    },
    {
        "title": "Implementation of Finite State Automata on e-Knows Telegram Chatbot",
        "abstract": "The State Islamic University of Sunan Gunung Djati Bandung has a bold learning system called e-Knows. So far, if the user has a school, he must contact the admin manually. The problems are diverse, and several issues can bring personal impact. Automata language theory is the basic logic for mapping the telegram e-Knows chatbot system. The mapping is done by dividing each system using finite state automata to facilitate the completion of the system.",
        "url": "https://www.semanticscholar.org/paper/014bbee71e5aa703e25dfd65a346e30e4b8a33e9",
        "stream": "Education & Community",
        "domain": "Islamic Education",
        "topic": "Learning Systems",
        "leaf": "Chatbots/Apps/Portals; User Studies"
    },
    {
        "title": "Tagging Algorithm and POS Tags for Narrator's Name in Hadith Document",
        "abstract": "Named Entity Recognition (NER) is important in many domains, such as information retrieval and text classification. Typically, NER uses machine learning (ML) or rule-based methods to recognize NER. ML works well with annotated corpora. The most commonly used annotated corpora are in English but not in Malay. Non-annotated corpora need to be tagged to be used in NER, and manual tagging requires time and effort from experts. In this work, we proposed a Natural Language Processing (NLP) technique to automate the tagging of narrators in hadith texts. Our proposed technique includes a model for tagging narrators in hadith texts. This research used POS tags to explain the detection of narrators' names in hadith texts. A total of 700 hadith texts were used to develop the tagging model using a rule-based technique. 300 hadith documents were examined to evaluate the tagging model and resulted in 93.64% for recall and 96.72% for precision. Further research is needed to investigate the automatic extraction of the narrators' names, which can be used in hadith retrieval.",
        "url": "https://www.semanticscholar.org/paper/d62cdb99599d8a9f99a1b8442404e37abe4c3712",
        "stream": "Scriptural Sources",
        "domain": "Hadith Sciences",
        "topic": "Structuring",
        "leaf": "NER & Ontologies; KG Construction"
    },
    {
        "title": "Answering Divine Love: Human Distinctiveness in the Light of Islam and Artificial Superintelligence",
        "abstract": "In the Qur’an, human distinctiveness was first questioned by angels. These established denizens of the cosmos could not understand why God would create a seemingly pernicious human when immaculate devotees of God such as themselves existed. In other words, the angels asked the age-old question: what makes humans so special and different? Fast forward to our present age and this question is made relevant again in light of the encroaching arrival of an artificial superintelligence (ASI). Up to this point in history, humans have exceeded other creatures in various respects; now a possibility has arisen that another entity, namely ASI, will exceed humans at least on the level of intelligence and power. In relation to the age of angels, pre-modern Sunni exegesis construed human distinctiveness along the axes of reproductive knowledge and stewardship. Both brittle, distinguishing markers will disappear in the age of the ASI. Conversely, a more resilient and creative Islamic response can be derived from Ibn al-ʿArabī’s (d. 1240) views on God and the imago Dei. Inspired by the Akbarian perspective, this paper construes human distinctiveness in relation to a capacity to expansively respond to God’s love to be recognized, a response that relies on (a) imitating divine virtues that operate in counterintuitive and illogical ways, and (b) exhibiting fragility and lack rather than exceptionalism. ASI, while responding already in part to God’s love, needs to make strides towards these traits before it can answer divine love as commensurately as humans can.",
        "url": "https://www.semanticscholar.org/paper/b8d8148573385068c3f7282e653d191a15cb128a",
        "stream": "Objectives & Governance",
        "domain": "Maqasid Lens",
        "topic": "Alignment",
        "leaf": "Bias/Safety Evaluation; Benchmark Creation"
    },
    {
        "title": "IslamicPCQA: A Dataset for Persian Multi-hop Complex Question Answering in Islamic Text Resources",
        "abstract": "Nowadays, one of the main challenges for Question Answering Systems is to answer complex questions using various sources of information. Multi-hop questions are a type of complex questions that require multi-step reasoning to answer. In this article, the IslamicPCQA dataset is introduced. This is the first Persian dataset for answering complex questions based on non-structured information sources and consists of 12,282 question-answer pairs extracted from 9 Islamic encyclopedias. This dataset has been created inspired by the HotpotQA English dataset approach, which was customized to suit the complexities of the Persian language. Answering questions in this dataset requires more than one paragraph and reasoning. The questions are not limited to any prior knowledge base or ontology, and to provide robust reasoning ability, the dataset also includes supporting facts and key sentences. The prepared dataset covers a wide range of Islamic topics and aims to facilitate answering complex Persian questions within this subject matter",
        "url": "http://arxiv.org/abs/2304.11664v1",
        "stream": "Shared Resources",
        "domain": "Datasets & Benchmarks",
        "topic": "Creation",
        "leaf": "Corpora/Annotation; Shared Tasks"
    },
    {
        "title": "Explainable Identification of Hate Speech towards Islam using Graph Neural Networks",
        "abstract": "Islamophobic language on online platforms fosters intolerance, making detection and elimination crucial for promoting harmony. Traditional hate speech detection models rely on NLP techniques like tokenization, part-of-speech tagging, and encoder-decoder models. However, Graph Neural Networks (GNNs), with their ability to utilize relationships between data points, offer more effective detection and greater explainability. In this work, we represent speeches as nodes and connect them with edges based on their context and similarity to develop the graph. This study introduces a novel paradigm using GNNs to identify and explain hate speech towards Islam. Our model leverages GNNs to understand the context and patterns of hate speech by connecting texts via pretrained NLP-generated word embeddings, achieving state-of-the-art performance and enhancing detection accuracy while providing valuable explanations. This highlights the potential of GNNs in combating online hate speech and fostering a safer, more inclusive online environment.",
        "url": "http://arxiv.org/abs/2311.04916v4",
        "stream": "Objectives & Governance",
        "domain": "Maqasid Lens",
        "topic": "Alignment",
        "leaf": "Bias/Safety Evaluation; Benchmark Creation"
    },
    {
        "title": "Bowed Generation and Digital Ethics Challenges in Islamic Education",
        "abstract": "Generation Bowing Down and the Challenges of Digital Ethics in Islamic Education\" is a study that explores the impact of the evolution of digital technology on Islamic values among the younger generation. In an era where technologies like smartphones, the internet, and social media have become inseparable from daily life, the younger generation often finds themselves trapped in the \"bowing down\" behavior, directing their attention to gadget screens. In relation to Islamic education, this tendency presents significant ethical challenges. This research examines the effects of changing communication behaviors, learning patterns, and digital ethics in the digital era on Islamic educational practices. The focus is on how to teach Islamic values to the younger generation increasingly exposed to digital technology and how to address potential negative impacts that may arise. By delving deeper into the \"generation bowing down\" phenomenon and evaluating the aspects of digital ethics in education, this study also formulates an effective role for Islamic education in preserving fundamental Islamic values in the digital era. Through a deeper understanding of these dynamics, it can be an effort to prepare the younger generation to integrate digital technology into their lives in harmony with crucial Islamic values",
        "url": "https://www.semanticscholar.org/paper/47fc922d8df163dfcfcb6483b20bb81f8224ed91",
        "stream": "Education & Community",
        "domain": "Islamic Education",
        "topic": "Pedagogy",
        "leaf": "Qualitative Studies"
    },
    {
        "title": "The Ethics of Artificial Intelligence (AI) Utilization in Qur'anic Studies: An Islamic Philosophical Perspective",
        "abstract": "Artificial Intelligence (AI) has presented a major breakthrough in Qur'anic studies, enabling text analysis, thematic classification, and the development of digital commentaries. These innovations provide opportunities to expand accessibility and improve the accuracy of Qur'anic analysis. However, AI also poses ethical challenges, including the potential for algorithmic bias, distortion of meaning, and threats to Islamic scholarly authority. From an Islamic perspective, these challenges require a clear ethical framework so that the utilization of AI does not conflict with Qur'anic values.\n            This research aims to identify Islamic ethical principles relevant to the use of AI in Qur'anic studies and develop a philosophical framework based on maqashid sharia. The methodology used is library research with a content analysis approach to classical and modern Islamic literature on ethics, Islamic philosophy, and maqashid sharia. The results show that principles such as justice (al-'adl wa al-ihsan), expediency (maslahah), and prudence (wara') should be the main guides in any application of AI in the Qur'anic context. In addition, maqashid sharia provides an evaluation framework to ensure that AI applications support the main objectives of sharia, such as safeguarding religion (hifdh ad-din) and reason (hifdh al-'aql).\n            The conclusion of this study confirms that the ethical use of AI in Qur'anic studies requires an integration of technological innovation and Qur'anic values. With the application of strong Islamic ethical principles, AI can be effectively used to support Qur'anic understanding, without compromising the integrity of the text and scholarly authority. This study offers a contribution to the development of comprehensive ethical guidelines to bridge technological advancement with the spiritual and scholarly needs of Muslims.\nKeyword: Artificial Intelligence (AI), Qur'anic Studies, Philosophical Islam\n \nEtika Pemanfaatan Artificial Intelligence (AI) dalam Studi Al-Qur'an: Perspektif Filosofis Islam\nAbstrak\nArtificial Intelligence (AI) telah menghadirkan terobosan besar dalam studi Al-Qur'an, memungkinkan analisis teks, klasifikasi tematik, hingga pengembangan tafsir digital. Inovasi ini memberikan peluang untuk memperluas aksesibilitas dan meningkatkan akurasi analisis Qur'ani. Namun, kehadiran AI juga memunculkan tantangan etis, termasuk potensi bias algoritma, distorsi makna, hingga ancaman terhadap otoritas keilmuan Islam. Dari perspektif Islam, tantangan ini memerlukan kerangka etika yang jelas agar pemanfaatan AI tidak bertentangan dengan nilai-nilai Qur'ani.\nPenelitian ini bertujuan untuk mengidentifikasi prinsip-prinsip etika Islam yang relevan dengan penggunaan AI dalam studi Al-Qur'an serta mengembangkan kerangka filosofis berbasis maqashid syariah. Metodologi yang digunakan adalah penelitian kepustakaan (library research) dengan pendekatan analisis konten terhadap literatur Islam klasik dan modern tentang etika, filsafat Islam, dan maqashid syariah. Hasil penelitian menunjukkan bahwa prinsip-prinsip seperti keadilan (al-‘adl wa al-ihsan), kemanfaatan (maslahah), dan kehati-hatian (wara') harus menjadi panduan utama dalam setiap penerapan AI dalam konteks Qur'ani. Selain itu, maqashid syariah memberikan kerangka evaluasi untuk memastikan bahwa aplikasi AI mendukung tujuan utama syariah, seperti menjaga agama (hifdh ad-din) dan akal (hifdh al-‘aql).\nKesimpulan penelitian ini menegaskan bahwa etika pemanfaatan AI dalam studi Al-Qur'an memerlukan keterpaduan antara inovasi teknologi dan nilai-nilai Qur'ani. Dengan penerapan prinsip etika Islam yang kuat, AI dapat digunakan secara efektif untuk mendukung pemahaman Al-Qur'an, tanpa mengorbankan integritas teks dan otoritas keilmuan. Studi ini menawarkan kontribusi bagi pengembangan panduan etika yang komprehensif untuk menjembatani kemajuan teknologi dengan kebutuhan spiritual dan keilmuan umat Islam.\nKeyword : Artificial Intelligence (AI), Studi Al-Qur'an, Filosofis Islam",
        "url": "https://www.semanticscholar.org/paper/bcca6b45168a76faf82e1b13d69844a91ab8f8e1",
        "stream": "Objectives & Governance",
        "domain": "Maqasid Lens",
        "topic": "Alignment",
        "leaf": "Bias/Safety Evaluation; Benchmark Creation"
    },
    {
        "title": "Arabic Ontology for Hadith texts - A survey",
        "abstract": ": Hadith texts play a significant role in Islamic scholarship, providing guidance for Muslims in understanding and practicing Islam. This paper explores the importance of Hadith texts, their categorization based on reliability, and the structure of a typical Hadith. It discusses the use of software tools and ontologies in analysing Hadith texts. The paper also examines the Arabic language, particularly its complexities and the challenges it poses in Natural Language Processing tasks. Arabic is classified into Classical, Modern, and dialectal forms. Arabic has many challenges that affect the building of ontologies; for instance, the lack of linguistic resources and complex morphology. The paper also explores the development of ontologies in Islamic studies, specifically for Hadith, highlighting their unique characteristics and applications. Several research works related to Hadith ontology and its potential applications are discussed, including the creation of Al-Hadith WordNet, computational analysis of Hadith texts, and the development of ontology-based systems for authentication and retrieval of Hadith information.",
        "url": "https://www.semanticscholar.org/paper/97cc639c27771111c4a41b7c8658515fa634b26d",
        "stream": "Scriptural Sources",
        "domain": "Hadith Sciences",
        "topic": "Structuring",
        "leaf": "NER & Ontologies"
    },
    {
        "title": "AI model for Parsing the Text of Holy Quran Sentences",
        "abstract": "The Holy Quran is of immense importance to many societies due to the position that this book holds for Muslims around the world and the religious teachings it contains. The Holy Quran employs a high-standard Arabic language, which requires analysis and simplification of expressions to enhance comprehension and application of its teachings. The digitization and combining of the Holy Quran with computing operations have made it easier to discover the vast amounts of information contained within its verses. Using these applications, academics and erudite researchers have successfully developed norms that govern the study of Qur'anic knowledge, thus expanding the illustration of the Quran. NLP is a well-known branch of study that has been the subject of research for many years. The intrinsic intricacy of this field has resulted in slower progress when compared to other areas of inquiry. Furthermore, despite having the most sophisticated syntax, structure, and verb conjugation of all-natural languages, Arabic has received comparatively little attention. As a result, there is an urgent need for study in this area to aid in the discovery of inclusive lexical knowledge. This research is concerned with the parsing of holy Quranic sentences. A neural network was used Consisting of two layers to training the token word attribute depending on the neural network input words characteristics. This research is based on a knowledge base that consists of 160 features was used, and 26 features related to the grammatical case were selected. The first group comprised an entered dataset with 128,221 rows, whereas the second group had 99.540 rows. We ran seven different experiments within each group and achieved a 96% accuracy rate. This accuracy was reached by using a training set size of 90,000 rows and a testing set size of 9,000 rows. Furthermore, we achieved 94% accuracy within the broader dataset of 128,221 rows by employing a training set size of 90,000 rows and a testing set size of 38,000 rows.",
        "url": "https://www.semanticscholar.org/paper/b2bad1b1231ed4d1a2f07a08c21c91fc6c194e74",
        "stream": "Scriptural Sources",
        "domain": "Quran & Tafsir",
        "topic": "Processing & Analysis",
        "leaf": "Morphology/Syntax; Semantics/Topics"
    },
    {
        "title": "Critical Discourse Analysis of Islamic Ideological Expressions in Acknowledgement Sections of Theses Written by Scholars in English Language Teaching (ELT)",
        "abstract": "The objective of current research is to analyze the expressions of Islamic ideology in the acknowledgement sections of theses written by researchers in the field of English Language Teaching (ELT) from Pakistan. These acknowledgements, a specific concept in academic writing, offers a particular frame to capture the religious and cultural aspects on scholarly discourse. 30 theses were examined and data were gathered from electronic libraries of universities, online thesis databases, and institutional archives sections of the required theses. It provided enough material and reach data in this regard. Fairclough’s three-dimensional model of Critical Doscourse Anaysis (CDA) was applied, centering to Textual Analysis and analyzes concrete words, phrases and sentences that contain the ideology of Islam. The results reveal clear Islamic orientations in the features of the Arabian language used, with recurrent appeals to Allah, prayer and blessing calls, as well as direct references to both Quran and Hadiths. These acknowledgements are not only the writers own faith but it also reveal the inteewined cultural and religious values",
        "url": "https://www.semanticscholar.org/paper/d2d4cf8c40d8c13c4bc52701a08f7ea27bd0e218",
        "stream": "Education & Community",
        "domain": "Contemporary Discourse",
        "topic": "Analysis",
        "leaf": "Sermons/Media; Stance/Theme Analysis"
    },
    {
        "title": "A Benchmark Dataset with Larger Context for Non-Factoid Question Answering over Islamic Text",
        "abstract": "Accessing and comprehending religious texts, particularly the Quran (the sacred scripture of Islam) and Ahadith (the corpus of the sayings or traditions of the Prophet Muhammad), in today's digital era necessitates efficient and accurate Question-Answering (QA) systems. Yet, the scarcity of QA systems tailored specifically to the detailed nature of inquiries about the Quranic Tafsir (explanation, interpretation, context of Quran for clarity) and Ahadith poses significant challenges. To address this gap, we introduce a comprehensive dataset meticulously crafted for QA purposes within the domain of Quranic Tafsir and Ahadith. This dataset comprises a robust collection of over 73,000 question-answer pairs, standing as the largest reported dataset in this specialized domain. Importantly, both questions and answers within the dataset are meticulously enriched with contextual information, serving as invaluable resources for training and evaluating tailored QA systems. However, while this paper highlights the dataset's contributions and establishes a benchmark for evaluating QA performance in the Quran and Ahadith domains, our subsequent human evaluation uncovered critical insights regarding the limitations of existing automatic evaluation techniques. The discrepancy between automatic evaluation metrics, such as ROUGE scores, and human assessments became apparent. The human evaluation indicated significant disparities: the model's verdict consistency with expert scholars ranged between 11% to 20%, while its contextual understanding spanned a broader spectrum of 50% to 90%. These findings underscore the necessity for evaluation techniques that capture the nuances and complexities inherent in understanding religious texts, surpassing the limitations of traditional automatic metrics.",
        "url": "https://www.semanticscholar.org/paper/d177e20a752677cb3b4c0dadb7d51f368ca0c267",
        "stream": "Shared Resources",
        "domain": "Datasets & Benchmarks",
        "topic": "Creation",
        "leaf": "Corpora/Annotation"
    },
    {
        "title": "Evaluating Artificial Intelligence Bias In Answering Religious Questions",
        "abstract": "Question Answering (QA) is a specialized field in the field of NLP and most studies in this field focus on the English language, while other languages, such as Arabic, are still in their early stages. Recently, research has turned to developing answering systems for Questions for Arabic-Islamic texts, which may impose challenges due to the nature of the Arabic language and due to the lack and scarcity of reference data sets. Research has also tended to develop systems to answer open-ended questions that aim to extract the answer to the user’s question from a specific text or from a specific context in this study. We evaluated artificial intelligence to answer religious questions to facilitate access to religious information. We created a fatwa dataset consisting of questions and answers from approved websites. We used the transformer-based Arabic language generation model AraGPT2, and we reconfigured the answer generation task, as our approach provides answers to questions by generating... The answer is among the answers on which the model was trained, and there is no context available to extract the answer from. This is what is known as the system for answering closed-field questions. Then we evaluated the resulting model using the evaluation methods, which are BERTScore, Levenshtein distance, and BLEU. The proposed model achieved the best evaluation score of 0.73 on the BERTScore scale, which indicates Good performance. In addition, the performance results were analyzed to determine the strengths and weaknesses of the model. The researchers suggest improving the model's performance by expanding the data set, modifying the model structure, and applying human evaluation of the model.",
        "url": "https://www.semanticscholar.org/paper/29fdbdd270d619c2c913a1bf7ec6412d4ccd3419",
        "stream": "Objectives & Governance",
        "domain": "Maqasid Lens",
        "topic": "Alignment",
        "leaf": "Bias/Safety Evaluation; Benchmark Creation"
    },
    {
        "title": "Fikr: AI Chatbot Powered with Vector Search",
        "abstract": "Fikr is a cutting-edge chatbot designed to enhance access to Islamic knowledge by leveraging advanced AI technologies such as vector search and Large Language Models (LLMs), including GPT-3.5. Developed using a combination of Streamlit for the frontend, Flask for the backend, and Firebase for data storage and authentication, Fikr provides users with precise and reliable responses, complete with accurate citations from verified sources such as Hadiths and Quranic verses. A key feature of Fikr is its vector-based search capability, which allows for efficient retrieval of semantically relevant information, improving the accuracy of query responses compared to traditional keyword-based methods. The development process encountered challenges, particularly in data vectorization and ingestion, addressed through iterative troubleshooting and data cleaning methods, resulting in a refined dataset of 33,535 entries. Fikr's answer generation algorithm, incorporating vector database results and LLM -generated responses, ensures that users receive contextually appropriate and well-supported answers. Comparative testing with other AI models, including GPT-4 and Gemini, demonstrated Fikr's superior accuracy and source citation performance.",
        "url": "https://www.semanticscholar.org/paper/aa7fcc24526097d3078668ca7695c67c5d287b43",
        "stream": "Education & Community",
        "domain": "Islamic Education",
        "topic": "Learning Systems",
        "leaf": "Chatbots/Apps/Portals; User Studies"
    },
    {
        "title": "SoulScripture: Chatbot using Bidirectional Encoder Representations from Transformers as a Medium of Spiritual Guidance",
        "abstract": "Mental health is an important aspect of human life. Many people face stress, anxiety, and distress daily without adequate support to manage these conditions. Islamic teachings from the Quran and Hadith provide wisdom as a source of inspiration and inner peace. However, accessing and understanding these teachings requires specialized knowledge and often the help of experts. With the advancement of machine learning, these teachings can be made more accessible and accurate. The SoulScripture app offers an innovative solution to support mental health by combining the wisdom of the Quran and Hadith through AI technology. Using the Bidirectional Encoder Representations from Transformers (BERT) model and Transformer architecture, the app can understand and provide relevant advice that anyone can access anytime. This research is significant because it offers a new approach to leveraging technology to support mental well-being, especially for communities underserved by conventional mental health services. The app was developed using self-supervised learning to understand the text of the Hadith without external annotation. This process involves several stages, such as user input, data preprocessing, and text analysis, to generate relevant answers. It is hoped that the SoulScripture application can serve as a source of inspiration and support for individuals in controlling stress and maintaining peace of mind, as well as supporting the achievement of the Sustainable Development Goals (SDGs) related to mental health.",
        "url": "https://www.semanticscholar.org/paper/70e0542b5573626e20bd0d72db0ba2a10273264e",
        "stream": "Education & Community",
        "domain": "Islamic Education",
        "topic": "Learning Systems",
        "leaf": "Chatbots/Apps/Portals; User Studies"
    },
    {
        "title": "Penerapan Chatbot pada Aplikasi Web Tanya Jawab Tentang Fiqih Jual Beli Islam Menggunakan LangChain",
        "abstract": "Fiqh is the field that studies Islamic rules on how humans behave, both in speech and action. Islamic Fiqh of buying and selling is a branch of fiqh that concentrates on the laws and rules relating to transactions and social interactions that occur in the daily lives of Muslims. There are many sources of learning about the fiqh of buying and selling, including books and the internet. However, manual searches can take a long time and make it difficult for some people to gain in-depth understanding. The application of a chatbot to a question and answer web application can provide a solution to provide easier access. This research aims to provide an effective and efficient solution in understanding fiqh muamalah (Islamic buying and selling). This research develops a question and answer system about the fiqh of Islamic buying and selling to make it easier for users to understand, by utilizing a deep learning approach through technologies such as LangChain, OpenAI, Large Language Model, and ChatGPT 3.5 turbo. Implementation is done through a chatbot web application that provides an initial display and menu, allowing users to ask questions about the fiqh of Islamic buying and selling and see the answers and references. Testing was conducted by students of UIN Sultan Syarif Kasim Riau and an ustaz who has a good understanding of fiqh muamalah using ten questions that were tested through the question and answer web application as a guide. The test results showed an answer evaluation of 88.8% with a very suitable category regarding the correctness of the responses given.",
        "url": "https://www.semanticscholar.org/paper/20243457b54c5644659d30c2ed44fea8d0370cbd",
        "stream": "Education & Community",
        "domain": "Islamic Education",
        "topic": "Learning Systems",
        "leaf": "Chatbots/Apps/Portals; User Studies"
    },
    {
        "title": "Optimized Quran Passage Retrieval Using an Expanded QA Dataset and Fine-Tuned Language Models",
        "abstract": "Understanding the deep meanings of the Qur'an and bridging the language gap between modern standard Arabic and classical Arabic is essential to improve the question-and-answer system for the Holy Qur'an. The Qur'an QA 2023 shared task dataset had a limited number of questions with weak model retrieval. To address this challenge, this work updated the original dataset and improved the model accuracy. The original dataset, which contains 251 questions, was reviewed and expanded to 629 questions with question diversification and reformulation, leading to a comprehensive set of 1895 categorized into single-answer, multi-answer, and zero-answer types. Extensive experiments fine-tuned transformer models, including AraBERT, RoBERTa, CAMeLBERT, AraELECTRA, and BERT. The best model, AraBERT-base, achieved a MAP@10 of 0.36 and MRR of 0.59, representing improvements of 63% and 59%, respectively, compared to the baseline scores (MAP@10: 0.22, MRR: 0.37). Additionally, the dataset expansion led to improvements in handling\"no answer\"cases, with the proposed approach achieving a 75% success rate for such instances, compared to the baseline's 25%. These results demonstrate the effect of dataset improvement and model architecture optimization in increasing the performance of QA systems for the Holy Qur'an, with higher accuracy, recall, and precision.",
        "url": "https://www.semanticscholar.org/paper/efe3628d43a3d4efbc954d6e3b974113cf1c68f4",
        "stream": "Scriptural Sources",
        "domain": "Quran & Tafsir",
        "topic": "Retrieval & QA",
        "leaf": "Search & Datasets"
    },
    {
        "title": "The Holy Quran",
        "abstract": "This paper provides an editorial reflection on the enduring relevance of the Holy Quran as a foundational text in Islam. The Quran, which is believed to be the word of God as revealed to the Prophet Muhammad, serves as a comprehensive guide for Muslims in both spiritual and worldly matters. It addresses ethical dilemmas, social justice, governance, and personal conduct, offering timeless wisdom for modern society. The paper explores the structure of the Quran, its literary and linguistic excellence, and its profound impact on Islamic civilization. Furthermore, it delves into the various interpretations of the Quran and discusses its continued relevance in addressing contemporary global issues such as social justice, environmental ethics, and interfaith dialogue.",
        "url": "https://www.semanticscholar.org/paper/d15deb526ca59e3d8891e32bf18b6bad9f994e14",
        "stream": "Scriptural Sources",
        "domain": "Quran & Tafsir",
        "topic": "Processing & Analysis",
        "leaf": "Morphology/Syntax; Semantics/Topics"
    },
    {
        "title": "Relevance of the Retrieval of Hadith Information (RoHI) using Bidirectional Encoder Representations from Transformers (BERT) in religious education media",
        "abstract": "This research explores the impact of integrating Bidirectional Encoder Representations from Transformers (BERT) into the Retrieval of Hadith Information (RoHI) application within the realm of religious education media. Hadith, the sayings and actions of Prophet Muhammad, play a pivotal role in Islamic teachings, requiring accurate and contextually relevant retrieval for educational purposes. RoHI, designed to enhance access and comprehension of Hadith literature, employs BERT's advanced natural language processing capabilities. The study assesses how BERT-enhanced RoHI facilitates efficient retrieval and interpretation of Hadith texts. By leveraging BERT's ability to capture intricate language patterns and semantics, the study aims to enhance the precision and contextual appropriateness of retrieved Hadith information. The study also discusses implications for digital learning platforms, emphasizing the potential of NLP technologies to foster broader access to religious knowledge and promote inclusive educational practices. This research contributes to the field by proposing a framework that integrates advanced AI techniques with religious education, ensuring that learners receive accurate and meaningful Hadith information tailored to their educational needs. The findings highlight the potential of BERT in revolutionizing information retrieval processes in religious studies, paving the way for more effective educational tools and resources in Islamic learning environments.",
        "url": "https://www.semanticscholar.org/paper/225256c3e0192e39538194db108d9568b46bac97",
        "stream": "Scriptural Sources",
        "domain": "Hadith Sciences",
        "topic": "Retrieval & QA",
        "leaf": "IR & Citations"
    },
    {
        "title": "A Comparative Study of Religious Scriptures Using Natural Language Processing",
        "abstract": "Over the past few years, Natural Language Processing (“NLP”) has emerged as a powerful tool and has enabled computational analysis of texts by offering insights into the subtleties of language, emotion, and thematic frameworks. This research paper employs NLP strategies such as topic modelling and sentiment analysis to compare translations of three religious scriptures: the Bhagavad Gita representing Hinduism, Quran representing Islam and the Bible representing Christianity. Before carrying out the tests, text was pre-processed and cleaned to ensure that the most optimum results were obtained. Topic modelling uses algorithms such as Latent Dirichlet Allocation to find prominent themes while sentiment analysis makes use of an NLTK VADER sentiment module ‘Sentiment Analyzer’ to interpret emotional undertones in text. This research paper finds that the texts share similar views on topics such as generosity, devotion to God among others and have differing opinions on themes including sacrifice and violence. It is also interesting to note that while the religions of the Bhagavad Gita and Quran (Hinduism and Islam respectively) have been pitted against each other for centuries in countries such as India, they share several similar principles and ideologies.",
        "url": "https://www.semanticscholar.org/paper/ae2b197afc03970b2705444ea09b0cf8bb4438a1",
        "stream": "Scriptural Sources",
        "domain": "Quran & Tafsir",
        "topic": "Processing & Analysis",
        "leaf": "Morphology/Syntax; Semantics/Topics"
    },
    {
        "title": "Islamic Lifestyle Applications: Meeting the Spiritual Needs of Modern Muslims",
        "abstract": "We evaluated contemporary Islamic lifestyle applications supporting religious practices and motivation among Muslims. We reviewed 11 popular applications using self-determination theory and the technology-as-experience framework to assess their support for motivation and affective needs. Most applications lack features that foster autonomy, competence, and relatedness. We also interviewed ten devoted Muslim application users to gain insights into their experiences and unmet needs. Our findings indicate that existing applications fall short in providing comprehensive learning, social connections, and scholar consultations. We propose design implications based on our results, including guided religious information, shareability, virtual community engagement, scholarly question-answering, and personalized reminders. We aim to inform the design of Islamic lifestyle applications that better facilitate ritual practices, benefitting application designers and Muslim communities. Our research provides valuable insights into the untapped potential for lifestyle applications to act as religious companions supporting Muslims' spiritual journey.",
        "url": "http://arxiv.org/abs/2402.02061v1",
        "stream": "Education & Community",
        "domain": "Islamic Education",
        "topic": "Learning Systems",
        "leaf": "User Studies"
    },
    {
        "title": "Using the Book \"Al-Miftah lil-‘Ulum\" in Teaching Arabic Grammar at the Islamic Boarding School in Indonesia: Benefits and Obstacles",
        "abstract": "This research aims to comprehend the utilization of the book \"Al-Miftah lil-‘Ulum\" in teaching Nahwu science at Darul Falah International School, Bagon Mataram, and to identify obstacles arising in teaching Nahwu science using the book. The research methodology employed is qualitative descriptive, utilizing observation, interviews, and documentation as data collection techniques. Data analysis involves data reduction, presentation, and result verification. The findings reveal that the Nahwu science teaching process with the book \"Al-Miftah lil-‘Ulum\" includes pre-lesson, core activities, and concluding activities. Challenges encountered encompass students' difficulty in reading writings on the board, specific difficulties in each volume, student boredom, and teacher absenteeism hindering goal achievement. Teacher obstacles include student delays, students not bringing books during teaching, non-repetition of \"Al-Miftah lil-‘Ulum\" lessons in the dormitory, difficulty understanding students' abilities, classroom management challenges, and difficulty providing motivation. This research supports recommendations to explore the effectiveness of \"Al-Miftah lil-‘Ulum\" as a Nahwu learning source and evaluate its teaching methods. It is suggested to focus on its impact on students' understanding and strategies to enhance its integration into the official curriculum. The research encourages exploring student responses to the book's use, identifying challenges, and proposing solutions through qualitative and quantitative methods for comprehensive understanding.",
        "url": "https://www.semanticscholar.org/paper/c4136fe16ac471e685fa729b308e592ff4a22a1a",
        "stream": "Education & Community",
        "domain": "Islamic Education",
        "topic": "Pedagogy",
        "leaf": "Qualitative Studies"
    },
    {
        "title": "Evaluating the Regular Sharaf Learning Program at the Foundation of Islamic and Arabic Language Learning In Indonesia",
        "abstract": "This research aims to scrutinize and assess the learning dynamics within the regular Sharaf learning program conducted by the Islamic and Arabic Learning Foundation. Employing a descriptive qualitative approach, data for this study were obtained through interviews with the program director, supervisors, and administrators. Data collection involved observation, interviews, and document analysis. Data analysis followed Miles and Huberman's framework, comprising data collection, reduction, presentation, and drawing conclusions. Findings indicate that the regular Sharaf learning program features effective teaching methods, sequential curriculum delivery, adequate instructional materials, and proficient instructors. The researchers aspire that this study contributes to advancing the management of Arabic language programs and facilitates the development of comprehensive Arabic language activities for enhanced outcomes.",
        "url": "https://www.semanticscholar.org/paper/572ab070c61a34bdab4b87e49ee6edc583e2a77a",
        "stream": "Education & Community",
        "domain": "Islamic Education",
        "topic": "Pedagogy",
        "leaf": "Qualitative Studies"
    },
    {
        "title": "Penerapan Langchain Retriever dengan Model Chat Openai dalam Pengembangan Sistem Chatbot Hadis Berbasis Telegram",
        "abstract": "In Islamic studies, the Hadiths of Prophet Muhammad (SAW) hold significant value as guides for behavior and faith. However, access to understanding Hadiths often presents challenges, espe-cially for those who are not Hadith experts. The digitalization of Hadiths is still limited, making it time-consuming to find answers by sifting through the vast amount of available information. This research aims to create an efficient chatbot that provides answers related to Hadiths, including the original sources, quickly. The proposed solution is a technology-based approach through the development of a Hadith chatbot on Telegram, integrated with the LangChain Retriever and the GPT-4-1106-preview chat model from OpenAI. Using LangChain Retriever helps the chatbot find accurate answers by matching user questions with relevant Hadith databases, enhancing the ac-curacy of the chatbot's responses. The GPT-4-1106-preview chat model enables the chatbot to generate natural and context-appropriate responses, improving user interaction. The Rapid Ap-plication Development (RAD) method is applied in system development, through stages of Re-quirement Planning, User Design, Construction, and Cut-Over, including data analysis of Hadiths from the Nine Imam Hadith Books, totaling 62,169 Hadiths. The chatbot's performance evaluation uses the Scoring Evaluator framework with an average evaluation score of 0.97 and quality answer evaluation testing by five Hadith experts with an accuracy percentage of 90%. The Scoring Eval-uator test results indicate that the responses are highly accurate and aligned with Hadith refer-ences, and the quality answer evaluation test on a Likert scale shows respondents strongly agree with the system's answers. This research contributes to laypersons wanting to learn Hadiths by utilizing the chatbot as an interactive and innovative learning medium. Further research can expand the focus to complex interpretations of Musykil al-Hadith and asbab al-wurud to address deeper questions about Hadith interpretation.",
        "url": "https://www.semanticscholar.org/paper/7f38a6e5cdfb36e8fc61b5318c98cc8ed56f3596",
        "stream": "Scriptural Sources",
        "domain": "Hadith Sciences",
        "topic": "Retrieval & QA",
        "leaf": "Grounded QA"
    },
    {
        "title": "Predicting Revelation Periods of Verses of the Quran via Deep Learning",
        "abstract": "The revelation period of a verse of the Quran provides invaluable insights into the historical context of that verse, helps us understand the prophet's biography, and empowers Islamic scholars to decide about the applicability of certain laws and/or to interpret that verse. They mostly relied on traditional methods (such as the occurrence of certain words and phrases, topics discussed, historical references, etc.) to decide the revelation periods of verses of the Quran. With modern deep-learning-based natural language processing (NLP) techniques, learning more complex patterns is possible, which may help us achieve this goal better. To our knowledge, no such attempt has been made before. Here, we attempt to fill this gap by employing different variations of a deep learning model to classify verses of the Quran into Meccan/Medinan categories. We analyze and interpret our results to get interesting insights.",
        "url": "https://www.semanticscholar.org/paper/4ce8831ba0b6517cc0e1f2842a925e737d81f6c9",
        "stream": "Scriptural Sources",
        "domain": "Quran & Tafsir",
        "topic": "Processing & Analysis",
        "leaf": "Morphology/Syntax; Semantics/Topics"
    },
    {
        "title": "Integration Portal of Arabic Language and Islamic Education in the Digital Era",
        "abstract": "The digital era has brought significant changes to the learning of the Arabic language and Islamic education. This study explores the potential and challenges of using an integration portal as an innovative solution in this context. Through a descriptive qualitative approach, involving literature review, content analysis of existing learning portals, and interviews with experts, this research identifies the key features of an effective integration portal, its benefits, and the challenges of implementation. The results show that the integration portal can enhance student motivation, learning efficiency, and access to quality materials. However, challenges such as resistance to change and infrastructure limitations need to be addressed. The integration of artificial intelligence (AI) opens new opportunities for personalized learning. This study concludes that the success of the integration portal lies in its ability to blend traditional values with technological innovation, and it suggests collaborative development and continuous evaluation to improve its effectiveness.",
        "url": "https://www.semanticscholar.org/paper/0e7b668ecd4526c0f41047ecf8aa85c9e7dcaf80",
        "stream": "Education & Community",
        "domain": "Islamic Education",
        "topic": "Learning Systems",
        "leaf": "Chatbots/Apps/Portals; User Studies"
    },
    {
        "title": "Do Islamic epistemology and ethics advance the understanding and promotion of sustainable development? A systematic review using PRISMA",
        "abstract": "Purpose\nThis study addresses the question of whether Islamic epistemology and ethics advance the understanding and promotion of sustainable development (SD) in the field of Islamic management, economics and finance (IMEF). This study also aims to understand how contemporary ethical theories explain and harmonise Islamic ethics in the context of SD.\n\nDesign/methodology/approach\nThis study adopts the PRISMA protocol and conducts a systematic literature review of 62 articles published from 2015 to 2023 to provide answers to four research questions. The selected publications were taken from the Web of Science, Scopus and Google Scholar databases, using the purposive sampling technique, and taking into account the selection criteria of quality, relevance and timeliness of the publications.\n\nFindings\nFour key findings emerged from the review. Firstly, Islamic epistemology and ethics, drawn from the Qur’an and Hadith, guide practices toward SD. Secondly, Islamic epistemology and ethics promote SD through various initiatives, including ethical behaviour, environmental stewardship, social responsibility, Islamic banking and financing ethics and Islamic social financing principles among others. Third, contemporary ethical theories such as virtue ethics, intentionalism, consequentialism and deontological ethics enrich the application of Islamic ethical foundations in the context of SD. Finally, the theoretical connection between Islamic epistemology, ethics and SD lies in their alignment toward promoting ethical behaviour, social responsibility and holistic ecosystem well-being.\n\nPractical implications\nThe insights provided by this review offer practical implications for researchers, policymakers and practitioners in IMEF. The insights also underscore the importance of integrating Islamic ethical principles into SD initiatives and policy frameworks.\n\nOriginality/value\nThis novel study offers unique perspectives by integrating contemporary ethical theories with Islamic ethics and epistemology to justify SD in ways that are both theoretically and practically significant. In addition, six novel propositions are suggested for future research in IMEF.",
        "url": "https://www.semanticscholar.org/paper/65d1365d976cbece39d2efbfd3655125d298c2f4",
        "stream": "Objectives & Governance",
        "domain": "Maqasid Lens",
        "topic": "Alignment",
        "leaf": "Bias/Safety Evaluation; Benchmark Creation"
    },
    {
        "title": "The Impact of Generative AI on Islamic Studies: Case Analysis of \"Digital Muhammad ibn Ismail Al-Bukhari",
        "abstract": "The emergence of large language models (LLMs) such as ChatGPT, LLaMA, Gemini, and Claude has transformed natural language processing (NLP) tasks by demonstrating remarkable capabilities in generating fluent and contextually appropriate responses. This paper examines the current state of LLMs, their applications, inherent challenges, and potential future directions necessitating multidisciplinary collaboration. A key focus is the application of generative AI in Islamic studies, particularly in managing sensitive content such as the Ahadith (corpus of sayings, actions, and approvals attributed to the Prophet Muḥammad). We detail the customization and refinement of the AI model, \"Digital Muḥammad ibn Ismail Al-Bukhari,\" designed to provide accurate responses based on the Sahih Al-Bukhari collection. Our methodology includes rigorous dataset curation, preprocessing, model customization, and evaluation to ensure the model’s reliability. Strategies to mitigate hallucinations involve implementing context-aware constraints, regular audits, and continuous feedback loops to maintain adherence to authoritative texts and correct biases. Findings indicate a significant reduction in hallucinations, though challenges such as residual biases and handling ambiguous queries persist. This research underscores the importance of recognizing LLMs’ limitations and highlights the need for collaborative efforts in fine-tuning these models with authoritative texts. It offers a framework for the cautious application of generative AI in Islamic studies, emphasizing continuous improvements to enhance AI reliability.",
        "url": "https://www.semanticscholar.org/paper/e343640203b1ec3085d2ff36fcccf20325c4e994",
        "stream": "Scriptural Sources",
        "domain": "Hadith Sciences",
        "topic": "Retrieval & QA",
        "leaf": "Grounded QA"
    },
    {
        "title": "Quranic Audio Dataset: Crowdsourced and Labeled Recitation from Non-Arabic Speakers",
        "abstract": "This paper addresses the challenge of learning to recite the Quran for non-Arabic speakers. We explore the possibility of crowdsourcing a carefully annotated Quranic dataset, on top of which AI models can be built to simplify the learning process. In particular, we use the volunteer-based crowdsourcing genre and implement a crowdsourcing API to gather audio assets. We integrated the API into an existing mobile application called NamazApp to collect audio recitations. We developed a crowdsourcing platform called Quran Voice for annotating the gathered audio assets. As a result, we have collected around 7000 Quranic recitations from a pool of 1287 participants across more than 11 non-Arabic countries, and we have annotated 1166 recitations from the dataset in six categories. We have achieved a crowd accuracy of 0.77, an inter-rater agreement of 0.63 between the annotators, and 0.89 between the labels assigned by the algorithm and the expert judgments.",
        "url": "http://arxiv.org/abs/2405.02675v1",
        "stream": "Shared Resources",
        "domain": "Datasets & Benchmarks",
        "topic": "Creation",
        "leaf": "Corpora/Annotation"
    },
    {
        "title": "The Contribution of al-'Ilm Sharaf To the Development of Understanding Classical Arabic Grammar at Islamic Educational Institutions",
        "abstract": "This study examines the contribution of al-'Ilm Sharaf to the development of understanding classical Arabic grammar in Islamic educational institutions. Al-'Ilm Sharaf is a key branch of Arabic grammar that focuses on word formation and meaning through the manipulation of root letters. Although this subject has been integrated into the curriculum, there is still a gap between theoretical knowledge and its practical application. This research employs a library research method to gather data from various relevant written sources. The findings show that students often struggle to apply the theoretical aspects of Arabic morphology when analyzing classical texts, and al-'Ilm Sharaf instruction requires a more interactive and practice-based approach. Therefore, this study offers valuable insights into how teaching methods and materials can be improved to enhance students' comprehension of classical Arabic grammar.",
        "url": "https://www.semanticscholar.org/paper/4ecc74aecb74f1ed7ac3a1cb925b0e547ada8dee",
        "stream": "Education & Community",
        "domain": "Islamic Education",
        "topic": "Pedagogy",
        "leaf": "Qualitative Studies"
    },
    {
        "title": "AraTrust: An Evaluation of Trustworthiness for LLMs in Arabic",
        "abstract": "The swift progress and widespread acceptance of artificial intelligence (AI) systems highlight a pressing requirement to comprehend both the capabilities and potential risks associated with AI. Given the linguistic complexity, cultural richness, and underrepresented status of Arabic in AI research, there is a pressing need to focus on Large Language Models (LLMs) performance and safety for Arabic-related tasks. Despite some progress in their development, there is a lack of comprehensive trustworthiness evaluation benchmarks, which presents a major challenge in accurately assessing and improving the safety of LLMs when prompted in Arabic. In this paper, we introduce AraTrust, the first comprehensive trustworthiness benchmark for LLMs in Arabic. AraTrust comprises 522 human-written multiple-choice questions addressing diverse dimensions related to truthfulness, ethics, safety, physical health, mental health, unfairness, illegal activities, privacy, and offensive language. We evaluated a set of LLMs against our benchmark to assess their trustworthiness. GPT-4 was the most trustworthy LLM, while open-source models, particularly AceGPT 7B and Jais 13B, struggled to achieve a score of 60% in our benchmark.",
        "url": "https://www.semanticscholar.org/paper/504f07874899ad12db96abb0121d9a86b00cbb63",
        "stream": "Objectives & Governance",
        "domain": "Maqasid Lens",
        "topic": "Alignment",
        "leaf": "Bias/Safety Evaluation; Benchmark Creation"
    },
    {
        "title": "CamelEval: Advancing Culturally Aligned Arabic Language Models and Benchmarks",
        "abstract": "Large Language Models (LLMs) are the cornerstones of modern artificial intelligence systems. This paper introduces Juhaina, a Arabic-English bilingual LLM specifically designed to align with the values and preferences of Arabic speakers. Juhaina inherently supports advanced functionalities such as instruction following, open-ended question answering, information provisioning, and text processing. Our model contains 9.24 billion parameters and is trained on a context window of up to 8,192 tokens. This paper details the creation process of Juhaina and provides an extensive empirical evaluation. Furthermore, we identify the limitations of widely-adopted Open Arabic LLM Leaderboard (OALL) and propose a new evaluation benchmark, CamelEval. Our findings demonstrate that Juhaina surpasses existing LLMs of comparable sizes, such as the Llama and Gemma families, in generating helpful responses in Arabic, providing factually accurate information about the region, and understanding nuanced cultural aspects. We aspire for Juhaina to democratize cutting-edge AI technologies, serving over 400 million Arabic speakers by offering LLMs that not only communicate in their language but also comprehend their culture. We publicly release all models on Huggingface \\url{https://huggingface.co/elmrc}.",
        "url": "https://www.semanticscholar.org/paper/adb9dc13a0ffdda8aa5cb472b10c41fbbfcaf10f",
        "stream": "Shared Resources",
        "domain": "Datasets & Benchmarks",
        "topic": "Evaluation",
        "leaf": "Cross-domain Benchmarks; Reproducible Protocols"
    },
    {
        "title": "Investigating Cultural Alignment of Large Language Models",
        "abstract": "The intricate relationship between language and culture has long been a subject of exploration within the realm of linguistic anthropology. Large Language Models (LLMs), promoted as repositories of collective human knowledge, raise a pivotal question: do these models genuinely encapsulate the diverse knowledge adopted by different cultures? Our study reveals that these models demonstrate greater cultural alignment along two dimensions -- firstly, when prompted with the dominant language of a specific culture, and secondly, when pretrained with a refined mixture of languages employed by that culture. We quantify cultural alignment by simulating sociological surveys, comparing model responses to those of actual survey participants as references. Specifically, we replicate a survey conducted in various regions of Egypt and the United States through prompting LLMs with different pretraining data mixtures in both Arabic and English with the personas of the real respondents and the survey questions. Further analysis reveals that misalignment becomes more pronounced for underrepresented personas and for culturally sensitive topics, such as those probing social values. Finally, we introduce Anthropological Prompting, a novel method leveraging anthropological reasoning to enhance cultural alignment. Our study emphasizes the necessity for a more balanced multilingual pretraining dataset to better represent the diversity of human experience and the plurality of different cultures with many implications on the topic of cross-lingual transfer.",
        "url": "https://www.semanticscholar.org/paper/b1890367317f0657c08ed96be4c474035b34b485",
        "stream": "Objectives & Governance",
        "domain": "Maqasid Lens",
        "topic": "Alignment",
        "leaf": "Bias/Safety Evaluation; Benchmark Creation"
    },
    {
        "title": "Exploring Bengali Religious Dialect Biases in Large Language Models with Evaluation Perspectives",
        "abstract": "While Large Language Models (LLM) have created a massive technological impact in the past decade, allowing for human-enabled applications, they can produce output that contains stereotypes and biases, especially when using low-resource languages. This can be of great ethical concern when dealing with sensitive topics such as religion. As a means toward making LLMS more fair, we explore bias from a religious perspective in Bengali, focusing specifically on two main religious dialects: Hindu and Muslim-majority dialects. Here, we perform different experiments and audit showing the comparative analysis of different sentences using three commonly used LLMs: ChatGPT, Gemini, and Microsoft Copilot, pertaining to the Hindu and Muslim dialects of specific words and showcasing which ones catch the social biases and which do not. Furthermore, we analyze our findings and relate them to potential reasons and evaluation perspectives, considering their global impact with over 300 million speakers worldwide. With this work, we hope to establish the rigor for creating more fairness in LLMs, as these are widely used as creative writing agents.",
        "url": "http://arxiv.org/abs/2407.18376v1",
        "stream": "Objectives & Governance",
        "domain": "Maqasid Lens",
        "topic": "Alignment",
        "leaf": "Bias/Safety Evaluation"
    },
    {
        "title": "Integration of AI Chatbots in Islamic Religious Education: Potential and Challenges from a Doctoral Student Perspective",
        "abstract": "This article examines the application of artificial intelligence (AI), particularly chatbot technology such as ChatGPT, in higher education, with a specific focus on Islamic religious learning.  The study involved 27 doctoral students from Sunan Ampel State Islamic University, Surabaya, using a survey method to explore their perceptions of ChatGPT in Islamic religious learning. Data was obtained via Google Forms using purposive and convenience sampling techniques. The survey contains 28 questions covering various aspects of ChatGPT's uses, benefits, limitations, and ethical issues. Data analysis using SPSS software, including frequency analysis, mean, and reliability. The results show a high level of reliability and reveal that using ChatGPT can improve productivity, learning quality, and personalization. However, there are limitations such as a lack of context understanding, limited personalization capabilities, and the potential to hinder human-to-human interactions. In addition, students also raised concerns about ethical issues such as plagiarism, assessment fairness, data privacy, dependency, and information bias. This article provides insights into the use of ChatGPT in higher education and emphasises the importance of considering ethical aspects in its implementation. To mitigate the ethical risks that may arise from the use of ChatGPT in educational settings, it is recommended that institutions develop policies, provide education, and ensure the availability of adequate resources. The article also emphasises the need for ethical risk mitigation measures associated with the use of ChatGPT in the educational environment.",
        "url": "https://www.semanticscholar.org/paper/245d8489af00fe5e06cb7a51c34719ad0a69c5ad",
        "stream": "Education & Community",
        "domain": "Islamic Education",
        "topic": "Learning Systems",
        "leaf": "User Studies"
    },
    {
        "title": "Model of Text-to-Text Transfer Transformer for Hadith Question Answering System",
        "abstract": "The advancement of Artificial Intelligence (AI), notably in Natural Language Processing (NLP), has been remarkable. Among its applications, Question-Answering (QA) systems stand out, assisting users in accessing pertinent information across various topics, including religious contexts. Religion plays a significant role in providing guidance on moral values to modern society, such as tolerance, compassion and social norms. Religious practices taught by religion serve as significant foundations for addressing the increasingly advancing influence of technology. The primary goal of this paper is to create a question-answering system proficient in analyzing user inquiries and precisely extracting data from translated Indonesian Hadith datasets. This research endeavors to enhance question-answering accuracy through Deep Learning techniques. Employing pre-processing methods, the system interprets user query intents. Furthermore, the Text-to-Text Transfer Transformer (T5), a text-based language Transformer model, is utilized to streamline the retrieval process for Hadith-related queries based on relevant subjects. The research findings demonstrate the precision of answers through BLEU and ROUGE scores. The novelty of this study lies in the creation of a dataset of hadith translations in Indonesian and the fine-tuning of the T5 model that has been trained using a dataset of questions and answers based on these translations. This research demonstrates the following evaluation scores: BLEU: 0.606, ROUGE-1: 0.702, ROUGE-2: 0.548, and ROUGE-L: 0.701, indicating that the answers generated by this particular research model are better compared to those produced using the standard mT5 model.",
        "url": "https://www.semanticscholar.org/paper/f09b3178a74d653cfdcf18231cccd8c9f03aa969",
        "stream": "Scriptural Sources",
        "domain": "Hadith Sciences",
        "topic": "Retrieval & QA",
        "leaf": "Grounded QA; IR & Citations"
    },
    {
        "title": "ArabLegalEval: A Multitask Benchmark for Assessing Arabic Legal Knowledge in Large Language Models",
        "abstract": "The rapid advancements in Large Language Models (LLMs) have led to significant improvements in various natural language processing tasks. However, the evaluation of LLMs’ legal knowledge, particularly in non English languages such as Arabic, remains under-explored. To address this gap, we introduce ArabLegalEval, a multitask benchmark dataset for assessing the Arabic legal knowledge of LLMs. Inspired by the MMLU and LegalBench datasets, ArabLegalEval consists of multiple tasks sourced from Saudi legal documents and synthesized questions. In this work, we aim to analyze the capabilities required to solve legal problems in Arabic and benchmark the performance of state-of-the-art LLMs. We explore the impact of in-context learning on performance and investigate various evaluation methods. Additionally, we explore workflows for automatically generating questions with automatic validation to enhance the dataset’s quality. By releasing ArabLegalEval and our code, we hope to accelerate AI research in the Arabic Legal domain",
        "url": "https://www.semanticscholar.org/paper/d614fbd773678d2844a829b0c91716f3ddb3e28a",
        "stream": "Shared Resources",
        "domain": "Datasets & Benchmarks",
        "topic": "Creation",
        "leaf": "Corpora/Annotation; Shared Tasks"
    },
    {
        "title": "Opportunities, Challenges and Ethics of Artificial Intelligence Implementation in Teaching Islamic Religious Education in Public Universities: A Case Study in South Kalimantan",
        "abstract": "This research presents a comprehensive overview of the opportunities and challenges in the utilization of Artificial Intelligence (AI) to improve the quality of Islamic Religious Education teaching in universities in South Kalimantan. Furthermore, the researcher explores how the ethics of using AI in Islamic Education learning in public universities. The research method used is qualitative with the type of case study. Data collection techniques used observation, interviews, and document studies. The research sample was PAI lecturers at public universities in South Kalimantan. Data analysis techniques using interactive data models. The results showed that the level of understanding of PAI lecturers in South Kalimantan was not very high due to a lack of understanding of the latest digital literacy, there were concerns that the use of AI would conflict with Islamic values and the lack of maximum internet infrastructure in South Kalimantan. This study also shows that AI has great potential in improving the quality of learning. These findings provide important implications for the development of innovative PAI learning models that are relevant to technological developments. This research aims to provide recommendations for PAI curriculum development that integrates AI technology. By identifying the opportunities, challenges and ethics of AI implementation, this research is expected to contribute to designing more effective and engaging learning strategies for students without violating academic integrity and supporting efforts to improve the quality of higher education in Indonesia.",
        "url": "https://www.semanticscholar.org/paper/7411c19c67986e45b50722f82da12a7a3f132ce6",
        "stream": "Education & Community",
        "domain": "Islamic Education",
        "topic": "Pedagogy",
        "leaf": "Qualitative Studies"
    },
    {
        "title": "Adjusting the Ideal Islamic Religious Education Curriculum to the Development of AI-Based Technology",
        "abstract": "The development of technology is currently experiencing a very rapid development, one of which is the emergence of an innovation called AI (artificial intelligence). Islamic religious education indirectly gets an impact on the emergence of AI (artificial intelligence) so that it requires adjustments in the Islamic religious education curriculum so that the Islamic religious education curriculum remains ideal with the times. This research is a qualitative research using library study research method with causal descriptiva analysis. Primary sources in this research are all literature relevant to this theme, namely the Islamic religious education curriculum and AI (artificial intelligence) and secondary sources focus on other literature that is indirectly relevant to this research. The result of this study is to describe five adjustments to the Islamic religious education curriculum towards AI (artificial intelligence), namely understanding the concept of technology and AI, ethics of using AI, digital literacy skills, character education, and strengthening Islamic values.",
        "url": "https://www.semanticscholar.org/paper/12a8db799175465dbad38af6d52bce7fb2235d96",
        "stream": "Education & Community",
        "domain": "Islamic Education",
        "topic": "Pedagogy",
        "leaf": "Curriculum Design"
    },
    {
        "title": "Topic Modeling of Quranic Verses using Latent Dirichlet Allocation with English Language",
        "abstract": "This study aims to assess the effectiveness of topic modeling in the English translation of the Holy Quran. Topic modeling is a popular text mining technique for uncovering latent semantic patterns in the collection of textual documents and helps to annotate the documents based on these topics. This study identifies the most significant topics in each document as well as grasping an understanding of the topic distribution throughout the document sets. Different steps are performed to acquire the dominant topics in each document and identify the distribution of topics across documents. In this context, the present research work chose to employ Latent Dirichlet Allocation as an unsupervised approach for topic modeling since there is no requirement for a training phase as hidden topics can be discovered throughout the topic modeling process. For this, the word cloud is generated to understand and interpret the results after pre-processing. A dictionary and corpus are created to extract the features from the dataset using the Bag of Words approach. The results are evaluated by calculating the perplexity and coherence score, where high coherence indicates the goodness of well-structured topic models and low perplexity score indicates the correctness of prediction made by the topic models. Lastly, the visualization step is performed.",
        "url": "https://www.semanticscholar.org/paper/c76ff407a2ca0ff35f5a69e5fc5f64c2d263e179",
        "stream": "Scriptural Sources",
        "domain": "Quran & Tafsir",
        "topic": "Processing & Analysis",
        "leaf": "Morphology/Syntax; Semantics/Topics"
    },
    {
        "title": "Integrating English Language Materials and Islamic Values: Research and Development in Islamic Higher Education",
        "abstract": "Developing English material is an effort to develop and validate English material based on students' characteristics and students’ needs. Students of Islamic universities have different characters and needs from general universities. Therefore, this study aims at describing the process of developing English language material for Islamic learners in Islamic higher education based on students’ needs. The method of this research was Borg and Gall's research and development model. In this study, the researchers employed the procedures in four steps only such as research and collecting the data, planning, and developing the product. The participants of the study were the second students semester of the Islamic education study program (PAI) of Tarbiyah Faculty of a private Islamic university in Indonesia. The number of participants involved in this model was 30 participants. The researchers collected the data by using questionnaires, and interviews. The product of this study was evaluated by two experts between English language teaching and Islamic materials. The data was analyzed in qualitative and quantitative analysis. The results of this study showed that the developing English materials based on the integration of English language materials and Islamic values for the students of Islamic higher education are developed by the researchers in appropriate quality.",
        "url": "https://www.semanticscholar.org/paper/d3a44473592281d5de128764234bab776d8aa6cb",
        "stream": "Education & Community",
        "domain": "Islamic Education",
        "topic": "Pedagogy",
        "leaf": "Curriculum Design; Qualitative Studies"
    },
    {
        "title": "UTILIZING RETRIEVAL-AUGMENTED GENERATION IN LARGE LANGUAGE MODELS TO ENHANCE INDONESIAN LANGUAGE NLP",
        "abstract": "The improvement of Large Language Models (LLM) such as ChatGPT through Retrieval-Augmented Generation (RAG) techniques has urgency in the development of natural language translation technology and dialogue systems. LLMs often experience obstacles in addressing special requests that require information outside the training data. This study aims to discuss the use of Retrieval-Augmented Generation (RAG) on large-scale language models to improve the performance of Natural Language Processing (NLP) in Indonesian, which has so far been poorly supported by high-quality data and to overcome the limitations of traditional language models in understanding the context of Indonesian better. The method used is a combination of retrieval capabilities (external information search) with generation (text generation), where the model utilizes broader and more structured basic data through the retrieval process to produce more accurate and relevant text. The data used includes the Indonesian corpus of the 30 Juz Quran translation into Indonesian. The results of the trial show that the RAG approach significantly improves the performance of the model in various NLP tasks, including token usage optimization, text classification, and context understanding, by increasing the accuracy and relevance of the results",
        "url": "https://www.semanticscholar.org/paper/1ffbf3ddf77375fccb5bc9e1552df7509d0cb2f8",
        "stream": "Scriptural Sources",
        "domain": "Quran & Tafsir",
        "topic": "Retrieval & QA",
        "leaf": "RAG & Evidence Linking; Search & Datasets"
    },
    {
        "title": "A Proposed Model for Organizing The Regulation and Supervision of The Saudi Central Bank on Islamic Banks",
        "abstract": "The study aimed to design a proposed model for a system of regulation and supervision of Islamic banks that is consistent with the characteristics and nature of its work, by answering the main question: What is the proposed vision for the Saudi Central Bank to create an appropriate regulatory and supervisory regime for Islamic banks? To accomplish its main goal represented in establishing a proposed model for designing a supervision and regulation system for Islamic banks operating in the Saudi banking sector. The study used the deductive and inductive approaches to achieve its main goal. The study considers its construction of a proposed model that enables the Central Bank of Saudi Arabia to reach the formulation of a system of supervision and control of Islamic banks, the most important result that has been reached.",
        "url": "https://www.semanticscholar.org/paper/7114721011ced29c150bd5ff837f630207891780",
        "stream": "Objectives & Governance",
        "domain": "Doctrinal Integrity",
        "topic": "Authenticity",
        "leaf": "Attribution Checks; Fabrication Signals"
    },
    {
        "title": "Islamic QA with Chatbot System Using Convolutional Neural Network",
        "abstract": "Many questions and answers about Islamic law are scattered on the internet and have been explained repeatedly by various sites. One solution is presented by the website www.piss-ktb.com, which creates a web-based source of information in the form of Frequently Asked Questions (FAQ). However, web-based FAQs have a weakness: users still have to browse through the available questions one by one according to the questions they want to know the answers to. Browsing through thousands of FAQs is inefficient and exhausting.\nThus, a chatbot system can become a better alternative to the FAQ website. Still, chatbots are difficult to use because most of their conversations are  hard to understand. A single character error will cause the system to misunderstand its meaning. In reality, users expect a chatbot that can understand everyday language. Thus, it is necessary to develop a chatbot system that can understand various common sentence combinations  in everyday language and understand the meaning of words. In addition, it should be able to predict answers automatically to various kinds of questions and requests, even though the initial training data is relatively low. Therefore, this study aims to develop a system that can provide answers automatically based on user commands in natural language using Global Vectors for Word Representations (GloVe), Convolutional Neural Networks (CNN), and Transfer Learning techniques. The result shows that the use of transfer learning and the Nadam optimizer can improve the system’s performance.",
        "url": "https://www.semanticscholar.org/paper/18a830f1ea73e2295d8ab247613de7fc11e7a4a8",
        "stream": "Education & Community",
        "domain": "Islamic Education",
        "topic": "Learning Systems",
        "leaf": "Chatbots/Apps/Portals; User Studies"
    },
    {
        "title": "An Islamic Perspective on AI Ethics",
        "abstract": "This case study examines the confluence of Islamic finance and AI ethics in the rapidly growing Robo-Advisory sector, focusing on Wahed Invest LLC (Wahed). As a frontrunner in providing Islamic-compliant financial solutions, Wahed Investments seeks to align its offerings with core Islamic ethical principles. However, recent violations of the Securities and Exchange Commission (SEC) regulations, including misleading clients and insufficient disclosures, have highlighted the urgent need to strictly comply with both Islamic ethical standards and regulatory requirements to rebuild trust and maintain its status as a Shari’ah-compliant entity advisor.",
        "url": "https://www.semanticscholar.org/paper/0162206ad98e63bfee3b022a0cfeeae11857ab3d",
        "stream": "Objectives & Governance",
        "domain": "Maqasid Lens",
        "topic": "Alignment",
        "leaf": "Bias/Safety Evaluation; Benchmark Creation"
    },
    {
        "title": "Utilising AI-based Chatbot for Maximising Value and Profitability of Islamic Financial Institutions",
        "abstract": "global Islamic finance industry has experienced significant growth in recent years, establishing Islamic financial institutions (IFIs) as prominent players in the international financial landscape. To maintain competitiveness and sustainability, IFIs must embrace innovation and explore avenues for maximising their performance. This research aims to investigate the effect of AI-based Chatbots on the value and profitability of IFIs in Organisation of Islamic Cooperation (OIC) countries. The study has employed quantitative methodology, and the data was collected from the Bloomberg database, Thomson Reuters DataStream, World Development Indicators and annual reports of 104 IFIs across 44 OIC countries from 2020 to 2022. Employing the Generalised Method of Moments (GMM), this study investigates the impact of AI-based Chatbots on the value and profitability of IFIs. The findings show a positive impact of Chatbot on Return on Assets (ROA), Return on Equity (ROE), and Tobin’s Q (TBQ). Furthermore, the analysis reveals that variables such as Gross Domestic Product (GDP), institutional size (SIZE), and age (AGE) exhibit positive associations with the value and profitability of IFIs. Conversely, the study identifies Consumer Price Index (CPI) as exerting a negative influence on the value and profitability of IFIs, indicating potential challenges posed by inflationary pressures. IFIs may consider investing in the development and deployment of advanced AI technologies to enhance overall profitability. Keywords: AI-based Chatbot; Profitability; Islamic financial institutions (IFIs); OIC Countries; Dynamic GMM",
        "url": "https://www.semanticscholar.org/paper/bfd36e9e2c8cc72c971503fa5d360d699096adae",
        "stream": "Education & Community",
        "domain": "Islamic Education",
        "topic": "Learning Systems",
        "leaf": "Chatbots/Apps/Portals; User Studies"
    },
    {
        "title": "Machine Translation of Quranic Verses: A Transformer-Based Approach to Urdu Rendering",
        "abstract": "Translate Quranic Arabic into Urdu is a Challenge due to linguistics and theological differences. While machine translation has advanced significantly, transformer-based Neural Machine Translation (NMT) models have not yet been utilized for Quranic Arabic to Urdu translation. This study addresses this gap by developing a transformer-based model that ensuresaccurate and context-sensitive translation of Quranic verses. A dataset has been initialized that contains Quranic Arabic text and Urdu translation of respected. I performed preprocessing on the dataset by applying it towards tokenization, stemming,and lemmatization, without compromising the theological nature of the theme. To enrich the model to mine the linguistic and stylistic cues, transformer architectures such as Helsinki NLP/MiarinMT were used with the transfer learning. Finally, the model was evaluated for theological correctness by Islamic scholars, and, secondly, by some automated metrics (BLEU, Rouge, and Cosine Similarity). Results show that the transformer model is a better model by far that provides better translation quality in the sense that meanings are preserved, that is, contextual meaning as well as religious meaning, implying better accessibility to Urdu-speaking Muslims. This research proposes a new approach to the problem of translating sacred texts and solves, albeit theologically correct, otherwise unsolvable problemsin Quranic translation, computational linguistics,and AI development. This research introduces a novel approach toQuranic translation, and Future work will explore multimodal learning for deeper contextual understanding.",
        "url": "https://www.semanticscholar.org/paper/7aad622e3b04abb66055ebc9f38fa44acda3a4f8",
        "stream": "Scriptural Sources",
        "domain": "Quran & Tafsir",
        "topic": "Processing & Analysis",
        "leaf": "Morphology/Syntax; Semantics/Topics"
    },
    {
        "title": "Sacred or Synthetic? Evaluating LLM Reliability and Abstention for Religious Questions",
        "abstract": "Despite the increasing usage of Large Language Models\n(LLMs) in answering in questions in a variety of domains,\ntheir reliability and accuracy remain unexamined for a\na plethora of domains, including the religious domains. In\nthis paper, we introduce a novel benchmark FiqhQA focused\non the LLM generated Islamic rulings explicitly categorized\nby the four major Sunni schools of thought, in both Arabic\nand English. Unlike prior work, which either overlooks the\ndistinctions between religious schools of thought or fails\nto evaluate abstention behavior, we assess LLMs not only on\ntheir accuracy but also on their ability to recognize when\nnot to answer. Our zero-shot and abstention experiments\nreveal significant variation across LLMs, languages, and\nlegal schools of thought. While GPT-4o outperforms all\nother models in accuracy, Gemini and Fanar demonstrate\nsuperior abstention behavior critical for minimizing\nconfident incorrect answers. Notably, all models exhibit a\nperformance drop in Arabic, highlighting the limitations in\nreligious reasoning for languages other than English. To\nthe best of our knowledge, this is the first study to\nbenchmark the efficacy of LLMs for fine-grained Islamic\nschool of thought specific ruling generation and to\nevaluate abstention for Islamic jurisprudence queries. Our\nfindings underscore the need for task-specific evaluation\nand cautious deployment of LLMs in religious applications.",
        "url": "https://www.semanticscholar.org/paper/4d6606388f4e924182bfb025aa01a18401015ad0",
        "stream": "Law & Practice",
        "domain": "Fiqh & Fatwa",
        "topic": "Reasoning & Evaluation",
        "leaf": "School-aware Evaluation"
    },
    {
        "title": "From Human Scholars to AI Fatwas: Media, Ethics, and the Limits of AI in Islamic Religious Communication",
        "abstract": "The integration of Artificial Intelligence (AI) into Islamic jurisprudence, particularly in issuing fatwas, raises significant theological, ethical and practical concerns. Traditionally, Islamic legal rulings have been derived through scholarly interpretations of the Quran, Hadith, Ijma (consensus), and Qiyas (analogy). The rise of AI-driven fatwa systems challenges this conventional framework by introducing automated decision-making processes that lack of ijtihad (independent reasoning), niyyah (intention), and divine inspiration elements that are essential for legitimate Islamic rulings. While AI-powered applications can assist in providing quick access to established and stable rulings, concerns persist regarding their ability to uphold the ethical and spiritual integrity of Islamic jurisprudence. This research concludes that AI-generated fatwas cannot fully replace human scholars, primarily due to their limitations in contextual reasoning. This conclusion is drawn through a qualitative descriptive content analysis of recent research papers and official announcements regarding the use of AI by various Darul-Ifta institutions in Muslim countries. However, AI can be used effectively under scholarly supervision in areas such as Islamic finance, halal certification, and preliminary legal guidance. A balanced approach, where AI serves as a supportive tool rather than an authoritative source of religious rulings, ensures that technological advancements align with Islamic ethical principles. The study emphasizes the necessity of human oversight to maintain the authenticity of religious verdicts and proposes a framework for integrating AI responsibly within Islamic jurisprudence.",
        "url": "https://www.semanticscholar.org/paper/dc8cca99d1ad7a3c783f452d1e75e0e68086376a",
        "stream": "Objectives & Governance",
        "domain": "Doctrinal Integrity",
        "topic": "Authenticity",
        "leaf": "Attribution Checks; Fabrication Signals"
    },
    {
        "title": "The Role of AI In Islamic Education and E- Learning Platform",
        "abstract": "The advancement of Artificial Intelligence (AI) has significantly impacted various sectors, including education. This research explores the role of AI in enhancing Islamic education through e-learning platforms. The study investigates how AI technologies such as Natural Language Processing (NLP), machine learning, virtual tutors, and voice recognition are being integrated into Quranic studies, Hadith learning, Fiqh interpretation, and Arabic language teaching. The research also addresses the ethical considerations of using AI in Islamic contexts, ensuring that AI systems align with Sharia guidelines. A mixed-method approach was adopted, involving surveys, interviews, and data mining from existing AI-powered Islamic educational platforms. The findings, presented through extensive tables and figures, reveal that AI-based applications have improved accessibility, personalized learning experiences, and learner engagement in Islamic studies. However, challenges such as limited datasets, lack of scholarly involvement in AI system development, and concerns over religious accuracy remain critical issues. This study provides practical recommendations for developing more culturally and religiously sensitive AI tools to support the global Muslim community in accessing quality Islamic education",
        "url": "https://www.semanticscholar.org/paper/64e57254108c3e6f874eeb47b4c36092347eeeee",
        "stream": "Education & Community",
        "domain": "Islamic Education",
        "topic": "Learning Systems",
        "leaf": "Chatbots/Apps/Portals; User Studies"
    },
    {
        "title": "Opportunities and Challenges of Integrating Artificial Intelligence (AI) into Religious Education Systems: A Descriptive Study on Madrasa Education in Sri Lanka",
        "abstract": "Madrasa education in Sri Lanka has historically served as a basis of Islamic learning and community development, providing instruction in Qur’an, Hadith, Fiqh, Arabic, and related disciplines, while also promoting moral and spiritual formation. In recent decades, some Madrasas have incorporated secular subjects, yet they continue to face challenges such as limited resources, traditional teaching methods, and the need to balance religious authenticity with modern relevance. Simultaneously, Artificial Intelligence (AI) is transforming global education through tools such as adaptive learning platforms, intelligent tutoring systems, natural language processing, and learning analytics, which enhance personalized learning, assessment, and administrative efficiency. This study explores the integration of AI in Madrasa education in Sri Lanka, examining potential opportunities, challenges, and lessons from global experiences. Using a qualitative methodology, data were collected from primary sources through observation and discussion with teachers, administrators, and students, alongside secondary sources including scholarly literature and policy documents. Findings indicate that AI can support personalized and adaptive learning, multilingual assistance, digital Qur’an and Hadith study aids, performance tracking, and resource management. However, technological limitations, financial constraints, cultural and religious concerns, and regulatory gaps present significant obstacles. The study concludes that careful, context-sensitive integration of AI can enhance pedagogical effectiveness, administrative efficiency, and global connectivity while preserving Islamic values. Future efforts should focus on localized AI tools, teacher training, and policy frameworks to ensure sustainable and culturally appropriate adoption.",
        "url": "https://www.semanticscholar.org/paper/d89b37748a6dc821576f166be79723198ee086ba",
        "stream": "Education & Community",
        "domain": "Islamic Education",
        "topic": "Pedagogy",
        "leaf": "Qualitative Studies"
    },
    {
        "title": "MizanQA: Benchmarking Large Language Models on Moroccan Legal Question Answering",
        "abstract": "The rapid advancement of large language models (LLMs) has significantly propelled progress in natural language processing (NLP). However, their effectiveness in specialized, low-resource domains-such as Arabic legal contexts-remains limited. This paper introduces MizanQA (pronounced Mizan, meaning\"scale\"in Arabic, a universal symbol of justice), a benchmark designed to evaluate LLMs on Moroccan legal question answering (QA) tasks, characterised by rich linguistic and legal complexity. The dataset draws on Modern Standard Arabic, Islamic Maliki jurisprudence, Moroccan customary law, and French legal influences. Comprising over 1,700 multiple-choice questions, including multi-answer formats, MizanQA captures the nuances of authentic legal reasoning. Benchmarking experiments with multilingual and Arabic-focused LLMs reveal substantial performance gaps, highlighting the need for tailored evaluation metrics and culturally grounded, domain-specific LLM development.",
        "url": "https://www.semanticscholar.org/paper/0365c444d48248d3c8df5432539dff51ac67e77e",
        "stream": "Shared Resources",
        "domain": "Datasets & Benchmarks",
        "topic": "Creation",
        "leaf": "Corpora/Annotation; Shared Tasks"
    },
    {
        "title": "Ethics of the Use of Artificial Intelligence (AI) in the Paradigm of Islamic Law",
        "abstract": "Objective: The principal objective of this scholarly inquiry is to meticulously examine the ethical implications of artificial intelligence (AI) within the context of Islamic jurisprudence, with a distinct focus on the principles of maqosid al-shari‘ah (the paramount objectives of Islamic law) serving as a moral and legal foundation for the evaluation of AI applications. Theoretical framework: The theoretical foundations of this investigation are derived from Islamic legal and ethical philosophy, specifically the five fundamental values of maqosid al-shari‘ah, safeguarding of faith, life, intellect, lineage, and property employed as evaluative criteria to assess the integration of technology within Muslim societies. Literature review: A diverse array of primary sources, including the Qur’an and Hadith, is meticulously scrutinized alongside contemporary Islamic scholarship that addresses the intersection of ethics and technology. Previous research on Islamic ethics in the digital and biomedical spheres is referenced, elaborated upon, and critically appraised to ensure a contemporary and contextually relevant analysis. Methods: This investigation adopts a qualitative methodology based on an exhaustive literature review. Primary religious texts and secondary academic discourses concerning AI ethics and Islamic law are analyzed through thematic content analysis to develop a normative framework that harmonizes Shariah principles with emerging AI technologies. Results: The findings of this research indicate that while AI offers substantial benefits in areas such as healthcare, education, and governance, it simultaneously presents ethical challenges, including issues related to surveillance, algorithmic bias, and a reduction in human accountability. From an Islamic standpoint, AI should not replace human moral agency but rather enhance it. Justice, accountability, and the welfare of the community must remain of utmost importance in its application. Implications: This study highlights the urgent need for interdisciplinary dialogue between Islamic scholars and technology developers, the promotion of Islamic ethical awareness among Muslim AI practitioners, and the establishment of fatwas and Shariah-compliant regulatory frameworks to ensure the ethical incorporation of AI into Muslim societies. Novelty: This research offers a noteworthy contribution to the burgeoning field of Islamic AI ethics by providing a structured, Shariah-aligned ethical framework for the assessment and guidance of AI technologies. It underscores the adaptability of Islamic jurisprudence in addressing contemporary innovations while remaining steadfastly anchored in enduring ethical principles.",
        "url": "https://www.semanticscholar.org/paper/7526ec41d691039bd104afd2039fdb5f7e41d55f",
        "stream": "Objectives & Governance",
        "domain": "Maqasid Lens",
        "topic": "Alignment",
        "leaf": "Bias/Safety Evaluation; Benchmark Creation"
    },
    {
        "title": "Can LLMs Write Faithfully? An Agent-Based Evaluation of LLM-generated Islamic Content",
        "abstract": "Large language models are increasingly used for Islamic guidance, but risk misquoting texts, misapplying jurisprudence, or producing culturally inconsistent responses. We pilot an evaluation of GPT-4o, Ansari AI, and Fanar on prompts from authentic Islamic blogs. Our dual-agent framework uses a quantitative agent for citation verification and six-dimensional scoring (e.g., Structure, Islamic Consistency, Citations) and a qualitative agent for five-dimensional side-by-side comparison (e.g., Tone, Depth, Originality). GPT-4o scored highest in Islamic Accuracy (3.93) and Citation (3.38), Ansari AI followed (3.68, 3.32), and Fanar lagged (2.76, 1.82). Despite relatively strong performance, models still fall short in reliably producing accurate Islamic content and citations -- a paramount requirement in faith-sensitive writing. GPT-4o had the highest mean quantitative score (3.90/5), while Ansari AI led qualitative pairwise wins (116/200). Fanar, though trailing, introduces innovations for Islamic and Arabic contexts. This study underscores the need for community-driven benchmarks centering Muslim perspectives, offering an early step toward more reliable AI in Islamic knowledge and other high-stakes domains such as medicine, law, and journalism.",
        "url": "http://arxiv.org/abs/2510.24438v1",
        "stream": "Shared Resources",
        "domain": "Datasets & Benchmarks",
        "topic": "Evaluation",
        "leaf": "Reproducible Protocols"
    },
    {
        "title": "Benchmarking the Legal Reasoning of LLMs in Arabic Islamic Inheritance Cases",
        "abstract": "Islamic inheritance domain holds significant importance for Muslims to ensure fair distribution of shares between heirs. Manual calculation of shares under numerous scenarios is complex, time-consuming, and error-prone. Recent advancements in Large Language Models (LLMs) have sparked interest in their potential to assist with complex legal reasoning tasks. This study evaluates the reasoning capabilities of state-of-the-art LLMs to interpret and apply Islamic inheritance laws. We utilized the dataset proposed in the ArabicNLP QIAS 2025 challenge, which includes inheritance case scenarios given in Arabic and derived from Islamic legal sources. Various base and fine-tuned models, are assessed on their ability to accurately identify heirs, compute shares, and justify their reasoning in alignment with Islamic legal principles. Our analysis reveals that the proposed majority voting solution, leveraging three base models (Gemini Flash 2.5, Gemini Pro 2.5, and GPT o3), outperforms all other models that we utilized across every difficulty level. It achieves up to 92.7% accuracy and secures the third place overall in Task 1 of the Qias 2025 challenge.",
        "url": "http://arxiv.org/abs/2508.15796v1",
        "stream": "Law & Practice",
        "domain": "Fiqh & Fatwa",
        "topic": "Reasoning & Evaluation",
        "leaf": "Benchmarks"
    },
    {
        "title": "HANA: An AI Chatbot for Islamic Jurisprudence on Menstruation using SBERT and TF-IDF",
        "abstract": "The advancement of Artificial Intelligence (AI), particularly in Natural Language Processing (NLP), has opened new opportunities for religious technological innovation, especially in addressing practical Islamic jurisprudence issues such as menstruation (fiqh haid). This research proposes and implements HANA, an AI chatbot developed for Telegram, utilizing a hybrid approach combining Term Frequency-Inverse Document Frequency (TF-IDF) and Sentence-BERT (SBERT) models. A curated dataset of over 1000 question-answer pairs from classical and contemporary Islamic literature was used, primarily based on the Shafi'i school of thought. The chatbot matches user queries through a two-stage retrieval: initial keyword matching via TF-IDF and deeper semantic matching via SBERT embeddings. Evaluations were conducted by comparing TF-IDF, SBERT, and hybrid approaches using cosine similarity, precision, recall, and F1-score metrics, focused on top-1 retrieval accuracy. HANA achieved an average cosine similarity score of 0.6581 and a semantic relevance rating of 87% based on expert validation, while User Acceptance Testing (UAT) involving 15 respondents indicated 86.7% satisfaction. Although the system is deployed as a proof-of-concept on Google Colab without persistent hosting, it demonstrates the viability of lightweight AI chatbots for Shariah consultation services. Future improvements include multi-turn conversation handling and integration with large language models for better context understanding. This research contributes to expanding NLP applications within techno-dakwah initiatives, providing a scalable approach to enhance women's access to Islamic jurisprudence knowledge.",
        "url": "https://www.semanticscholar.org/paper/2449a76b663c92eeb6f2c1dd09c699628e18ebbd",
        "stream": "Law & Practice",
        "domain": "Fiqh & Fatwa",
        "topic": "Fatwa QA & Support",
        "leaf": "RAG + Citations"
    },
    {
        "title": "Implications of Using Artificial Intelligence Chatbot in Fiqh Learning at Islamic Universities",
        "abstract": "The rapid advancement of artificial intelligence (AI) has transformed various sectors, including education. This research explores the implications of AI chatbot utilization in fiqh learning at Islamic universities, analyzing its benefits, challenges, and ethical considerations. Employing a qualitative descriptive approach, data were collected through observations and closed-ended questionnaires distributed to lecturers and students from three Islamic universities: Sekolah Tinggi Dirasat Islamiyah Imam Syafi’i Jember, Safwa University Egypt, and International Quran University Gambia. The findings indicate that AI chatbots, particularly ChatGPT, are widely adopted among students (59%), while lecturers' usage remains relatively low (14%). This research reveals that AI chatbots enhance accessibility, engagement, and understanding of fiqh concepts, with 74% of respondents considering the responses accurate. However, concerns arise regarding misinformation, ethical accountability, and the risk of diminishing human interaction in religious learning. Despite their advantages, AI chatbots require continuous improvement to align with Islamic teachings and maintain scholarly rigor. This research recommends a balanced integration of AI chatbot technology with traditional fiqh instruction to ensure the depth and accuracy of religious education while addressing ethical and pedagogical challenges.",
        "url": "https://www.semanticscholar.org/paper/8b6c4701b9aeff3068efd403e971bcfa1e56e2b6",
        "stream": "Education & Community",
        "domain": "Islamic Education",
        "topic": "Learning Systems",
        "leaf": "Chatbots/Apps/Portals; User Studies"
    },
    {
        "title": "PalmX 2025: The First Shared Task on Benchmarking LLMs on Arabic and Islamic Culture",
        "abstract": "Large Language Models (LLMs) inherently reflect the vast data distributions they encounter during their pre-training phase. As this data is predominantly sourced from the web, there is a high chance it will be skewed towards high-resourced languages and cultures, such as those of the West. Consequently, LLMs often exhibit a diminished understanding of certain communities, a gap that is particularly evident in their knowledge of Arabic and Islamic cultures. This issue becomes even more pronounced with increasingly under-represented topics. To address this critical challenge, we introduce PalmX 2025, the first shared task designed to benchmark the cultural competence of LLMs in these specific domains. The task is composed of two subtasks featuring multiple-choice questions (MCQs) in Modern Standard Arabic (MSA): General Arabic Culture and General Islamic Culture. These subtasks cover a wide range of topics, including traditions, food, history, religious practices, and language expressions from across 22 Arab countries. The initiative drew considerable interest, with 26 teams registering for Subtask 1 and 19 for Subtask 2, culminating in nine and six valid submissions, respectively. Our findings reveal that task-specific fine-tuning substantially boosts performance over baseline models. The top-performing systems achieved an accuracy of 72.15% on cultural questions and 84.22% on Islamic knowledge. Parameter-efficient fine-tuning emerged as the predominant and most effective approach among participants, while the utility of data augmentation was found to be domain-dependent.",
        "url": "http://arxiv.org/abs/2509.02550v1",
        "stream": "Shared Resources",
        "domain": "Datasets & Benchmarks",
        "topic": "Creation",
        "leaf": "Shared Tasks"
    },
    {
        "title": "A computational system to handle the orthographic layer of tajwid in contemporary Quranic Orthography",
        "abstract": "Contemporary Quranic Orthography (CQO) relies on a precise system of phonetic notation that can be traced back to the early stages of Islam, when the Quran was mainly oral in nature and the first written renderings of it served as memory aids for this oral tradition. The early systems of diacritical marks created on top of the Quranic Consonantal Text (QCT) motivated the creation and further development of a fine-grained system of phonetic notation that represented tajwid-the rules of recitation. We explored the systematicity of the rules of tajwid, as they are encountered in the Cairo Quran, using a fully and accurately encoded digital edition of the Quranic text. For this purpose, we developed a python module that can remove or add the orthographic layer of tajwid from a Quranic text in CQO. The interesting characteristic of these two sets of rules is that they address the complete Quranic text of the Cairo Quran, so they can be used as precise witnesses to study its phonetic and prosodic processes. From a computational point of view, the text of the Cairo Quran can be used as a linchpin to align and compare Quranic manuscripts, due to its richness and completeness. This will let us create a very powerful framework to work with the Arabic script, not just within an isolated text, but automatically exploring a specific textual phenomenon in other connected manuscripts. Having all the texts mapped among each other can serve as a powerful tool to study the nature of the notation systems of diacritics added to the consonantal skeleton.",
        "url": "http://arxiv.org/abs/2505.11379v1",
        "stream": "Scriptural Sources",
        "domain": "Quran & Tafsir",
        "topic": "Processing & Analysis",
        "leaf": "Morphology/Syntax; Semantics/Topics"
    },
    {
        "title": "The Role of Artificial Intelligence (AI) and Digital Technology in Authenticating and Preserving Hadith Literature",
        "abstract": "This paper explores the evolving intersection between classical Islamic scholarship and modern technological advancements, specifically focusing on the role of Artificial Intelligence (AI) and digital tools in the authentication and preservation of Hadith literature. Historically, the science of Hadith underwent rigorous processes of transmission, verification, and documentation through established methodologies such as isnād analysis and matn criticism. With the emergence of digital technology, the preservation of Hadith texts has been significantly enhanced through digitization, archival systems, and online platforms, enabling broader accessibility and safeguarding rare manuscripts. More recently, AI technologies—such as machine learning, natural language processing (NLP), and data mining—have been applied to Hadith sciences, offering innovative ways to analyze narrator chains, detect textual inconsistencies, and classify Hadith based on authenticity. The paper further examines the contributions of digital platforms and AI applications in facilitating research, improving pedagogical practices, and democratizing access to Hadith knowledge. While acknowledging these advancements, the study also critically evaluates associated challenges, including ethical concerns, data integrity, over-reliance on automation, and the digital divide among scholars. Limitations in Arabic NLP models and the need for scholarly oversight are emphasized to ensure that technological tools remain accurate and respectful of the sacredness of Hadith traditions. Finally, the study offers future prospects and strategic recommendations, including cross-disciplinary collaboration, digital literacy training for scholars, and the establishment of global metadata standards. The conclusion underscores that while AI and digital tools can augment traditional methods, they must be employed within a framework of Islamic epistemology and scholarly integrity. By embracing innovation with caution and purpose, the Islamic scholarly tradition can thrive in the digital age while remaining anchored in its rich heritage.",
        "url": "https://www.semanticscholar.org/paper/55d06531911309d878eb93b8c9feffa363c09ac0",
        "stream": "Scriptural Sources",
        "domain": "Hadith Sciences",
        "topic": "Authenticity & Isnad",
        "leaf": "Chain/Matn Features; Graph/Network Analysis"
    },
    {
        "title": "Computationally Distinguishing Quran and Pre-Islamic Arabic Poetry",
        "abstract": "The literary uniqueness and coherence of the Quran have been debated for centuries, with some Western scholars claiming that it draws from pre-Islamic Arabic poetry and lacks coherence, while others refuting these claims. However, this entire body of work relies mainly on qualitative analyses of selected verses. Here, we employed modern NLP techniques to systematically compare and contrast all verses of the Quran and pre-Islamic poetry. Specifically, we applied two BERT-based pre-trained models on Quran and pre-Islamic poetry verses to get embeddings, preprocessed them, and applied four clustering algorithms. Our results show that Quran (even Makki verses of the Quran - which are more poetic) and poem verses tend to form distinct clusters. Thus, our quantitative approach addresses gaps in the literature, offering fresh insights into long-standing debates. To our knowledge, this work is the first of its kind.",
        "url": "https://www.semanticscholar.org/paper/5238b3456f49e1186f87c6302c2aea2fcf5cf994",
        "stream": "Scriptural Sources",
        "domain": "Quran & Tafsir",
        "topic": "Processing & Analysis",
        "leaf": "Morphology/Syntax; Semantics/Topics"
    },
    {
        "title": "Faraid distribution calculation using AI-based Quranic chatbot",
        "abstract": "Faraid, Islamic inheritance law, refers to that aspect of Shariah law which is not properly understood and has created issues and impediments in the distribution of estates. This paper discusses the development of an AI-based Quranic chatbot to be used by the public to learn the Faraid rules and automate calculations of inheritance distribution. The chatbot has been developed using natural language processing and a rule-based algorithm, which intends to search and get an accurate interpretation from the user queries, retrieve relevant verses of the Quran, and compute the share of inheritance according to the established Islamic jurisprudence. Fuzzy match identifies and corrects variation in queries, enhancing user interaction, ensuring that it appears more intuitive and accessible. The system processes user input regarding heirs of the deceased, estate value, and debts, and applies Faraid rules to generate accurate distribution results that happen to be web-based platforms of this chatbot. It intends to link traditional Islamic knowledge with modern digital solutions, bringing Faraid calculations closer, more comfortable, faster, and transparent. Through rigorous tests and user feedback will prove above, revealing the chatbot’s potential in understanding the application of Islamic inheritance law and promoting digital engagement in all these through Quranic teachings.",
        "url": "https://www.semanticscholar.org/paper/7e056ff4a8521f1516d2050638589d9c9e47b6b3",
        "stream": "Education & Community",
        "domain": "Islamic Education",
        "topic": "Learning Systems",
        "leaf": "Chatbots/Apps/Portals; User Studies"
    },
    {
        "title": "HUMAIN at IslamicEval 2025 Shared Task 1: A Three-Stage LLM-Based Pipeline for Detecting and Correcting Hallucinations in Quran and Hadith",
        "abstract": ",",
        "url": "https://www.semanticscholar.org/paper/4819b6a66529b56258f4d80f34434e0dc1f254c6",
        "stream": "Shared Resources",
        "domain": "Datasets & Benchmarks",
        "topic": "Creation",
        "leaf": "Shared Tasks"
    },
    {
        "title": "Classification of Hadith Authenticity Using ArabicBERT",
        "abstract": "The authenticity of Hadith is vital for Muslims, as they are commanded to follow the example of Prophet Muhammad (PBUH).Hadith has two main components: the Matan, the textual content of a Hadith, and the Sanad, the chain of narrators who convey the Hadith. With the advancement of the Internet, accessing Hadith has become significantly easier, but this increases the risk of spreading false Hadith. This study explores the use of Natural Language Processing (NLP) for Hadith authenticity classification into three classes (Sahih, Hasan, and Da’if) and two classes (Accepted and Rejected), using both the Hadith full-text and Sanad-only text to compare them on the same task. It compares the performance of ArabicBERT against the traditional Machine Learning (ML) model Multinomial Naive Bayes (NB) and the deep learning (DL) model CNN-LSTM. The results show that ArabicBERT, fine-tuned using Optuna, performs the best in all of the configurations, In the 3-class configuration, ArabicBERT achieved an F1-score of 74.53% for both the full-text and Sanad-only versions. In the 2-class configuration, it achieved 94.83% (full-text) and 94.90% (Sanad-only), showing better results compared to ARBERT in a previous study. The results show that using either full-text or Sanad-only text does not impact the performance of the models significantly. These results indicate that the use of ArabicBERT is effective in the task of Hadith classification, but the 3-class configuration can still be improved by handling the misclassification between Hasan and Da’if classes.",
        "url": "https://www.semanticscholar.org/paper/44c1db3c403f2b20fd3896c8ef29353d449cf935",
        "stream": "Scriptural Sources",
        "domain": "Hadith Sciences",
        "topic": "Authenticity & Isnad",
        "leaf": "Chain/Matn Features"
    },
    {
        "title": "Artificial Intelligence (AI) Opens a New Horizon in the Study of the Holy Quran",
        "abstract": "This article investigates the transformative impact of Artificial Intelligence (AI) on the study of the Holy Quran, highlighting the intersection between Islamic theology, computer science, and linguistics. AI technologies, particularly Natural Language Processing (NLP), Machine Learning (ML), and Deep Learning, are increasingly employed to analyse Quranic texts in innovative ways, enhancing traditional exegesis (tafsir), semantic interpretation, and linguistic pattern recognition. Through qualitative content analysis and case study approaches, this paper examines how AI enhances Quranic translation, accessibility, and educational applications, while also addressing the ethical, epistemological, and theological challenges that arise from its use. The findings reveal that AI not only supplements traditional scholarly frameworks but also democratises Quranic knowledge by improving accessibility for diverse linguistic and cognitive communities. However, the study emphasises the need for ethical guidelines and interdisciplinary collaboration to maintain theological integrity and avoid interpretive misuse. AI, when guided by Islamic ethical principles and scholarly oversight, can serve as a powerful tool for augmenting human understanding of the Quran. This paper proposes a balanced integration of AI in Quranic studies, positioning it as a support mechanism that enhances, rather than replaces, the profound human engagement with the sacred text.",
        "url": "https://www.semanticscholar.org/paper/2eda0e8ada48489bb86ba7ac1c212315e9830df7",
        "stream": "Scriptural Sources",
        "domain": "Quran & Tafsir",
        "topic": "Processing & Analysis",
        "leaf": "Morphology/Syntax; Semantics/Topics"
    },
    {
        "title": "FARSIQA: Faithful and Advanced RAG System for Islamic Question Answering",
        "abstract": "The advent of Large Language Models (LLMs) has revolutionized Natural Language Processing, yet their application in high-stakes, specialized domains like religious question answering is hindered by challenges like hallucination and unfaithfulness to authoritative sources. This issue is particularly critical for the Persian-speaking Muslim community, where accuracy and trustworthiness are paramount. Existing Retrieval-Augmented Generation (RAG) systems, relying on simplistic single-pass pipelines, fall short on complex, multi-hop queries requiring multi-step reasoning and evidence aggregation. To address this gap, we introduce FARSIQA, a novel, end-to-end system for Faithful Advanced Question Answering in the Persian Islamic domain. FARSIQA is built upon our innovative FAIR-RAG architecture: a Faithful, Adaptive, Iterative Refinement framework for RAG. FAIR-RAG employs a dynamic, self-correcting process: it adaptively decomposes complex queries, assesses evidence sufficiency, and enters an iterative loop to generate sub-queries, progressively filling information gaps. Operating on a curated knowledge base of over one million authoritative Islamic documents, FARSIQA demonstrates superior performance. Rigorous evaluation on the challenging IslamicPCQA benchmark shows state-of-the-art performance: the system achieves a remarkable 97.0% in Negative Rejection - a 40-point improvement over baselines - and a high Answer Correctness score of 74.3%. Our work establishes a new standard for Persian Islamic QA and validates that our iterative, adaptive architecture is crucial for building faithful, reliable AI systems in sensitive domains.",
        "url": "http://arxiv.org/abs/2510.25621v1",
        "stream": "Law & Practice",
        "domain": "Fiqh & Fatwa",
        "topic": "Fatwa QA & Support",
        "leaf": "RAG + Citations"
    },
    {
        "title": "Murajaah as a Key Strategy in Quranic Retention: Insights from a Mini Review",
        "abstract": "Murajaah, or the systematic repetition of the Quran's memorized verses, is the backbone of Quranic studies, providing memorization, oral fluency, and spiritual connection through memorization strategies. This mini review addresses the state of current murajaah in the retention of the Quran, covering three essential aspects: the technological element of integration, the educational approach, and the implementation. Philosophical frameworks and technological aids such as AI applications, speech recognition, and Quranic natural language processing (NLP) have found increased use to facilitate murajaah, especially among the students who are pressed for time or do not have reasonable access to teachers. Nonetheless, although these instruments are convenient and accessible, they usually do not have the same accuracy when it comes to citation, cultural accommodation, or empirical verification when applied to learning. Such educational techniques as performance monitoring, peer-guided revision, and Islamic religious education principles can be taken as the basic principles of regulating murajaah activities. These methodologies boost the learner's remembering and interest when coupled with the correct methods like Qiraat Murajaah and Hifz exercises. Though the existing ones are promising, many strategies and approaches are underutilized within personalized or technology-augmented environments. This review illustrates the present gaps in the literature/practice, especially as to the prospects of modern models of education being incorporated in the traditional murajaah systems with the digital medium. It hinders a greater focus on context-based research, user-based design, and empirical evaluation to ensure that murajaah is feasible and applicable to modern students. According to the findings, the critical issue is integrating traditional knowledge with modernity to preserve the integrity of Quranic memorizing within the changing educational environments.",
        "url": "https://www.semanticscholar.org/paper/143410a2bf178539096d2eaadaa2e78e90cd98b1",
        "stream": "Education & Community",
        "domain": "Islamic Education",
        "topic": "Learning Systems",
        "leaf": "Chatbots/Apps/Portals; User Studies"
    },
    {
        "title": "From Guidelines to Practice: A New Paradigm for Arabic Language Model Evaluation",
        "abstract": "This paper addresses critical gaps in Arabic language model evaluation by establishing comprehensive theoretical guidelines and introducing a novel evaluation framework. We first analyze existing Arabic evaluation datasets, identifying significant issues in linguistic accuracy, cultural alignment, and methodological rigor. To address these limitations in LLMs, we present the Arabic Depth Mini Dataset (ADMD), a carefully curated collection of 490 challenging questions spanning ten major domains (42 sub-domains, see Figure 1. Using ADMD, we evaluate five leading language models: GPT-4, Claude 3.5 Sonnet, Gemini Flash 1.5, CommandR 100B, and Qwen-Max. Our results reveal significant variations in model performance across different domains, with particular challenges in areas requiring deep cultural understanding and specialized knowledge. Claude 3.5 Sonnet demonstrated the highest overall accuracy at 30\\%, showing relative strength in mathematical theory in Arabic, Arabic language, and islamic domains. This work provides both theoretical foundations and practical insights for improving Arabic language model evaluation, emphasizing the importance of cultural competence alongside technical capabilities.",
        "url": "https://www.semanticscholar.org/paper/e5bdc7c06581bbc5871432f95a9036850c541dc1",
        "stream": "Shared Resources",
        "domain": "Datasets & Benchmarks",
        "topic": "Evaluation",
        "leaf": "Cross-domain Benchmarks"
    },
    {
        "title": "Chatbot Assistant for Enhancing Religious Court Services in Indonesia Using Deep Learning-based Algorithms",
        "abstract": "The Religious Courts have the authority to carry out and settle Islamic law cases and need to continue to adapt to improve legal services for Muslim communities in Indonesia. This research aims to build chatbot artificial intelligence technology to improve the services of the Religious Courts, which are optimal, available at any time, responsive, and real-time. Chatbot technology is built using the Deep Neural Network (DNN), Transfer Learning-based, and Long Short-Term Memory (LSTM) as deep learning methods. Experiments were conducted using 1,702 pairs of questions and answers with service and case labels handled by the Religious Court. Experiment results using LSTM with 50 epochs, the SoftMax activation function, and Adam's optimization show that the LSTM has an accuracy rate of 0.9583 and a loss of 0.0848. LSTM has the best results compared to Transfer Learning-based and DNN on the chatbot service of the Religious Courts in Indonesia. This research contributes to using artificial intelligence technology in the legal sector to improve the quality of Religious Courts services.",
        "url": "https://www.semanticscholar.org/paper/8fdc1af6249fc6a62923b6f93075f78977f0ee4d",
        "stream": "Education & Community",
        "domain": "Islamic Education",
        "topic": "Learning Systems",
        "leaf": "Chatbots/Apps/Portals"
    },
    {
        "title": "CAMELBERT-CNN-BILSTM: HYBRID NEURAL ARCHITECTURE WITH IMPROVED PREPROCESSING TO NER OF ARABIC HADITH TEXTS",
        "abstract": "The application of Natural Language Processing (NLP) to classic religious works is unique in that it may include the use of archaic language, complicated grammar constructions, and lack of suspended writings. The issue that this study is aimed at handling is the recognition of named entities (NERs) in the hadith, which is the compilation of sayings of the Prophet Muhammad (peace be upon him). We suggest a new hybrid neural network, a pretrained transformer CAMeLBERT, which is narrowly trained on Classical Arabic, that is embedded with a convolutional neural network and long-term and short-term memory (BiLSTM). The other important innovation is introduction of a hadith text specific preprocessing pipeline based on morphological segmentation and rule-based inference to determine the boundary between the narrative and text strings (narrative-text string) in order to maximize the BIO labeling system. We made our model test on a well selected catalogue of suspended hadiths. Tested experiments reveal that our model of proposal has a high accuracy of 98.07 percent, which is much greater than the basic models on the basis of the common preprocessing and (mono)frames. The article has highlighted that to realize high NER results on Hadith texts, domain preprocessing and a hybrid model are crucial.",
        "url": "https://www.semanticscholar.org/paper/922f534bc37ba2c96eec23070f745da6cfcd2de0",
        "stream": "Scriptural Sources",
        "domain": "Hadith Sciences",
        "topic": "Structuring",
        "leaf": "NER & Ontologies"
    },
    {
        "title": "Cross-Language Approach for Quranic QA",
        "abstract": "Question answering systems face critical limitations in languages with limited resources and scarce data, making the development of robust models especially challenging. The Quranic QA system holds significant importance as it facilitates a deeper understanding of the Quran, a Holy text for over a billion people worldwide. However, these systems face unique challenges, including the linguistic disparity between questions written in Modern Standard Arabic and answers found in Quranic verses written in Classical Arabic, and the small size of existing datasets, which further restricts model performance. To address these challenges, we adopt a cross-language approach by (1) Dataset Augmentation: expanding and enriching the dataset through machine translation to convert Arabic questions into English, paraphrasing questions to create linguistic diversity, and retrieving answers from an English translation of the Quran to align with multilingual training requirements; and (2) Language Model Fine-Tuning: utilizing pre-trained models such as BERT-Medium, RoBERTa-Base, DeBERTa-v3-Base, ELECTRA-Large, Flan-T5, Bloom, and Falcon to address the specific requirements of Quranic QA. Experimental results demonstrate that this cross-language approach significantly improves model performance, with RoBERTa-Base achieving the highest MAP@10 (0.34) and MRR (0.52), while DeBERTa-v3-Base excels in Recall@10 (0.50) and Precision@10 (0.24). These findings underscore the effectiveness of cross-language strategies in overcoming linguistic barriers and advancing Quranic QA systems",
        "url": "http://arxiv.org/abs/2501.17449v1",
        "stream": "Scriptural Sources",
        "domain": "Quran & Tafsir",
        "topic": "Retrieval & QA",
        "leaf": "RAG & Evidence Linking; Search & Datasets"
    },
    {
        "title": "Curriculum Integration in Semi-Modern Pesantren: A Holistic Approach in Arabic Language Education",
        "abstract": "Purpose – This article analyzes the components and implementation of the Arabic curriculum at Pondok Pesantren Al-Hikmah Banjarmasin, focusing on how it addresses the evolving needs of students while integrating traditional Islamic knowledge with modern education.\nDesign/methodology/approach – The research employs a qualitative descriptive approach, utilizing interviews, observations, and documentation to collect data.\nFindings- The findings reveal that the Arabic curriculum at the pesantren combines classical Islamic texts with general education, offering a balanced educational model. This integration allows students to understand religious texts in Arabic while acquiring modern knowledge. Despite the benefits, challenges arise in adapting to technological advancements and meeting the demands of a rapidly changing global context. The study also identifies that the curriculum model at Al-Hikmah aligns with a holistic approach, which integrates intellectual, spiritual, emotional, and physical development. The research highlights the need for continuous curriculum evaluation to ensure its relevance and effectiveness.\nResearch Limitations/Implications – This study is limited by its specific focus on a single pesantren, which may not fully represent other pesantren models in the region. Further research is recommended to explore broader implications for the integration of Arabic language education within semi-modern pesantren systems.",
        "url": "https://www.semanticscholar.org/paper/0064eae2e668e6a2849fd80068ccd4674066f572",
        "stream": "Education & Community",
        "domain": "Islamic Education",
        "topic": "Pedagogy",
        "leaf": "Curriculum Design; Qualitative Studies"
    },
    {
        "title": "Artificial Intelligence in Islamic Guidance: Assessing Chatbot Performance and Jurisprudential Adherence",
        "abstract": "The rise of AI chatbots for Islamic guidance has prompted questions about their accuracy and adherence to Islamic jurisprudence (fiqh). This study assessed five Islamic chatbots using Bloom’s Taxonomy, Islamic accuracy from the perspectives of Ahl al-ḥadīth and Ahl al-raʾy, and the risks of AI hallucinations. The evaluation involved 80 questions on Islamic law, which were analyzed for cognitive level, clarity, reasoning, textual evidence, and methodological soundness. The results revealed significant performance variability, with the chatbots failing to meet the standards of Islamic legal reasoning. Issues included misattribution of Qurʾānic verses and ḥadīth, oversimplification, and inconsistent responses. No chatbot achieved the “Trusted Educational Output” status, underscoring the epistemic challenges in religious domains, where knowledge depends on authenticated transmission chains (isnād). This study recommends collaboration between Islamic scholars and AI developers to create epistemologically grounded systems. Although AI can improve access to Islamic knowledge, it cannot substitute trained Islamic scholars (Muftīs).",
        "url": "https://www.semanticscholar.org/paper/e8ad3c0486317121f70d40c32cc9fda63a50ae4d",
        "stream": "Law & Practice",
        "domain": "Fiqh & Fatwa",
        "topic": "Reasoning & Evaluation",
        "leaf": "Benchmarks"
    },
    {
        "title": "A Domain Ontology for Modeling the Book of Purification in Islam",
        "abstract": "This paper aims to address a gap in major Islamic topics by developing an ontology for the Book of Purification in Islam. Many authoritative Islamic texts begin with the Book of Purification, as it is essential for performing prayer (the second pillar of Islam after Shahadah, the profession of faith) and other religious duties such as Umrah and Hajj.   The ontology development strategy followed six key steps: (1) domain identification, (2) knowledge acquisition, (3) conceptualization, (4) classification, (5) integration and implementation, and (6) ontology generation. This paper includes examples of the constructed tables and classifications.   The focus is on the design and analysis phases, as technical implementation is beyond the scope of this study. However, an initial implementation is provided to illustrate the steps of the proposed strategy.   The developed ontology ensures reusability by formally defining and encoding the key concepts, attributes, and relationships related to the Book of Purification. This structured representation is intended to support knowledge sharing and reuse.",
        "url": "http://arxiv.org/abs/2505.18222v1",
        "stream": "Law & Practice",
        "domain": "Ibadat (Rituals)",
        "topic": "Tutoring & QA",
        "leaf": "Hajj/Umrah Guidance"
    },
    {
        "title": "I Am Aligned, But With Whom? MENA Values Benchmark for Evaluating Cultural Alignment and Multilingual Bias in LLMs",
        "abstract": "We introduce MENAValues, a novel benchmark designed to evaluate the cultural alignment and multilingual biases of large language models (LLMs) with respect to the beliefs and values of the Middle East and North Africa (MENA) region, an underrepresented area in current AI evaluation efforts. Drawing from large-scale, authoritative human surveys, we curate a structured dataset that captures the sociocultural landscape of MENA with population-level response distributions from 16 countries. To probe LLM behavior, we evaluate diverse models across multiple conditions formed by crossing three perspective framings (neutral, personalized, and third-person/cultural observer) with two language modes (English and localized native languages: Arabic, Persian, Turkish). Our analysis reveals three critical phenomena:\"Cross-Lingual Value Shifts\"where identical questions yield drastically different responses based on language,\"Reasoning-Induced Degradation\"where prompting models to explain their reasoning worsens cultural alignment, and\"Logit Leakage\"where models refuse sensitive questions while internal probabilities reveal strong hidden preferences. We further demonstrate that models collapse into simplistic linguistic categories when operating in native languages, treating diverse nations as monolithic entities. MENAValues offers a scalable framework for diagnosing cultural misalignment, providing both empirical insights and methodological tools for developing more culturally inclusive AI.",
        "url": "https://www.semanticscholar.org/paper/53adb6afcd0750d7557b0b40a71a768ff71bbd74",
        "stream": "Objectives & Governance",
        "domain": "Maqasid Lens",
        "topic": "Alignment",
        "leaf": "Bias/Safety Evaluation; Benchmark Creation"
    },
    {
        "title": "QU-NLP at QIAS 2025 Shared Task: A Two-Phase LLM Fine-Tuning and Retrieval-Augmented Generation Approach for Islamic Inheritance Reasoning",
        "abstract": "This paper presents our approach and results for SubTask 1: Islamic Inheritance Reasoning at QIAS 2025, a shared task focused on evaluating Large Language Models (LLMs) in understanding and reasoning within Islamic inheritance knowledge. We fine-tuned the Fanar-1-9B causal language model using Low-Rank Adaptation (LoRA) and integrated it into a Retrieval-Augmented Generation (RAG) pipeline. Our system addresses the complexities of Islamic inheritance law, including comprehending inheritance scenarios, identifying eligible heirs, applying fixed-share rules, and performing precise calculations. Our system achieved an accuracy of 0.858 in the final test, outperforming other competitive models such as, GPT 4.5, LLaMA, Fanar, Mistral and ALLaM evaluated with zero-shot prompting. Our results demonstrate that QU-NLP achieves near state-of-the-art accuracy (85.8%), excelling especially on advanced reasoning (97.6%) where it outperforms Gemini 2.5 and OpenAI's o3. This highlights that domain-specific fine-tuning combined with retrieval grounding enables mid-scale Arabic LLMs to surpass frontier models in Islamic inheritance reasoning.",
        "url": "http://arxiv.org/abs/2508.15854v1",
        "stream": "Shared Resources",
        "domain": "Datasets & Benchmarks",
        "topic": "Creation",
        "leaf": "Shared Tasks"
    },
    {
        "title": "Multi-stage Training of Bilingual Islamic LLM for Neural Passage Retrieval",
        "abstract": "This study examines the use of Natural Language Processing (NLP) technology within the Islamic domain, focusing on developing an Islamic neural retrieval model. By leveraging the robust XLM-R model, the research employs a language reduction technique to create a lightweight bilingual large language model (LLM). Our approach for domain adaptation addresses the unique challenges faced in the Islamic domain, where substantial in-domain corpora exist only in Arabic while limited in other languages, including English.   The work utilizes a multi-stage training process for retrieval models, incorporating large retrieval datasets, such as MS MARCO, and smaller, in-domain datasets to improve retrieval performance. Additionally, we have curated an in-domain retrieval dataset in English by employing data augmentation techniques and involving a reliable Islamic source. This approach enhances the domain-specific dataset for retrieval, leading to further performance gains.   The findings suggest that combining domain adaptation and a multi-stage training method for the bilingual Islamic neural retrieval model enables it to outperform monolingual models on downstream retrieval tasks.",
        "url": "http://arxiv.org/abs/2501.10175v1",
        "stream": "Shared Resources",
        "domain": "Datasets & Benchmarks",
        "topic": "Creation",
        "leaf": "Corpora/Annotation"
    },
    {
        "title": "Examining factors influencing chatbot adoption in Takaful industry: Malaysian evidence",
        "abstract": "This study aims to investigate the potential of artificial intelligence (AI), particularly chatbots, to enhance Takaful services in Malaysia by examining the factors influencing users’ behavioural intention to adopt chatbot technology, grounded in the technology acceptance model.\n \n \n \n The study employed a quantitative approach, collecting survey data from 229 Takaful subscribers in Malaysia. The data were analysed using SmartPLS to evaluate the relationships between key constructs, including perceived accuracy, ease of use, completeness, user satisfaction and behavioural intention, in predicting the adoption of chatbot technology. Additionally, the analysis examined the direct effect of perceived convenience on behavioural intention (BI), providing further insight into the drivers of chatbot usage in the Takaful context.\n \n \n \n The analysis revealed that perceived ease of use and perceived accuracy have a significant positive impact on user satisfaction, which in turn strongly predicts behavioural intention to use chatbots. Furthermore, perceived completeness and perceived convenience were found to exert a direct positive influence on behavioural intention. These findings underscore the importance of functional reliability and user-centric design in fostering chatbot adoption. Although limitations remain, such as difficulties in handling complex queries and delivering real-time updates, users responded positively to the simplicity, responsiveness and accessibility of chatbot interfaces. Overall, the results underscore the need for continuous improvement of chatbot capabilities to enhance service quality in the Takaful sector.\n \n \n \n This study addresses a research gap at the intersection of AI and Islamic finance, focusing on the underexplored potential of AI-driven chatbots in the Takaful industry. It represents one of the first empirical investigations within this context, offering practical insights for Malaysian Takaful providers to enhance service agility, customer experience and operational efficiency, while upholding Shariah compliance.",
        "url": "https://www.semanticscholar.org/paper/4c37bc3b1c563f1abf12d033183c9762fcad6791",
        "stream": "Education & Community",
        "domain": "Islamic Education",
        "topic": "Learning Systems",
        "leaf": "Chatbots/Apps/Portals; User Studies"
    },
    {
        "title": "ADAPT–MTU HAI at QIAS2025: Dual-Expert LLM Fine-Tuning and Constrained Decoding for Arabic Islamic Inheritance Reasoning",
        "abstract": ",",
        "url": "https://www.semanticscholar.org/paper/c930dea66f4f7f7b63c4854c4ac67daaf6f28872",
        "stream": "Shared Resources",
        "domain": "Datasets & Benchmarks",
        "topic": "Creation",
        "leaf": "Shared Tasks"
    },
    {
        "title": "N&N at QIAS 2025: Chain-of-Thought Ensembles with Retrieval-Augmented framework for Classical Arabic Islamic",
        "abstract": "We present our system developed for the Question-and-Answer in Islamic Studies Assessment Shared Task on Evaluating LLMs for Islamic Knowledge (QIAS 2025), which focuses on answering Arabic multiple-choice questions (MCQs) derived from classical Is-lamic texts. Our methodology integrates few-shot chain-of-thought prompting across multiple LLMs, enhanced by a majority-vote ensemble mechanism. In situations of ensemble uncertainty, we deploy a retrieval-augmented re-prompting module that extracts contextually relevant passages from digitized Islamic sources to refine model predictions. Our final system achieves an accuracy of 89.8% on the hidden test set.",
        "url": "https://www.semanticscholar.org/paper/71bc89c9735d0793f268a5d41a270faa0b5da05d",
        "stream": "Shared Resources",
        "domain": "Datasets & Benchmarks",
        "topic": "Creation",
        "leaf": "Shared Tasks"
    },
    {
        "title": "QuranMorph: Morphologically Annotated Quranic Corpus",
        "abstract": "We present the QuranMorph corpus, a morphologically annotated corpus for the Quran (77,429 tokens). Each token in the QuranMorph was manually lemmatized and tagged with its part-of-speech by three expert linguists. The lemmatization process utilized lemmas from Qabas, an Arabic lexicographic database linked with 110 lexicons and corpora of 2 million tokens. The part-of-speech tagging was performed using the fine-grained SAMA/Qabas tagset, which encompasses 40 tags. As shown in this paper, this rich lemmatization and POS tagset enabled the QuranMorph corpus to be inter-linked with many linguistic resources. The corpus is open-source and publicly available as part of the SinaLab resources at (https://sina.birzeit.edu/quran)",
        "url": "http://arxiv.org/abs/2506.18148v1",
        "stream": "Shared Resources",
        "domain": "Datasets & Benchmarks",
        "topic": "Creation",
        "leaf": "Corpora/Annotation"
    },
    {
        "title": "AI and Healthcare Ethics Islamic Perspectives on Medical Accountability",
        "abstract": "provides a detailed examination of the ethical implications of artificial intelligence (AI) technologies, with a special focus on the context of the Gulf Region and the broad Arab-Muslim world where Islamic values are an integral part of the moral world of these societies. For an in-depth and systematic analysis of the Islamic bioethical deliberations on AI, mainly focusing on the concept of medical accountability",
        "url": "https://www.semanticscholar.org/paper/ae4e6f57bee6e01f7b94a9e51aec2bd737ec219d",
        "stream": "Objectives & Governance",
        "domain": "Maqasid Lens",
        "topic": "Alignment",
        "leaf": "Bias/Safety Evaluation; Benchmark Creation"
    },
    {
        "title": "Burhan at IslamicEval: Fact-Augmented and LLM-Driven Retrieval for Islamic QA",
        "abstract": "This paper presents our approach to the Qur’an and Hadith QA task in the IslamicEval 2025 Shared Task. Reliable retrieval requires both accuracy and context-aware answers from Qur’anic and Hadith text. To address this challenge, We combine semantic search with LLM-based re-ranking. To enhance alignment, we augment the corpus with LLM-extracted Is-lamic facts and paraphrased queries. An LLM-based binary classifier further verifies whether retrieved passages answer the questions. Re-sults show improved accuracy and better alignment with user intent.",
        "url": "https://www.semanticscholar.org/paper/4126c22d1e5033d8cbfdc1174f4e05418a2fa7fd",
        "stream": "Shared Resources",
        "domain": "Datasets & Benchmarks",
        "topic": "Creation",
        "leaf": "Shared Tasks"
    },
    {
        "title": "MedArabiQ: Benchmarking Large Language Models on Arabic Medical Tasks",
        "abstract": "Large Language Models (LLMs) have demonstrated significant promise for various applications in healthcare. However, their efficacy in the Arabic medical domain remains unexplored due to the lack of high-quality domain-specific datasets and benchmarks. This study introduces MedArabiQ, a novel benchmark dataset consisting of seven Arabic medical tasks, covering multiple specialties and including multiple choice questions, fill-in-the-blank, and patient-doctor question answering. We first constructed the dataset using past medical exams and publicly available datasets. We then introduced different modifications to evaluate various LLM capabilities, including bias mitigation. We conducted an extensive evaluation with five state-of-the-art open-source and proprietary LLMs, including GPT-4o, Claude 3.5-Sonnet, and Gemini 1.5. Our findings highlight the need for the creation of new high-quality benchmarks that span different languages to ensure fair deployment and scalability of LLMs in healthcare. By establishing this benchmark and releasing the dataset, we provide a foundation for future research aimed at evaluating and enhancing the multilingual capabilities of LLMs for the equitable use of generative AI in healthcare.",
        "url": "https://www.semanticscholar.org/paper/00873a8228e515b87a0e0690cff8fbc1e71200e9",
        "stream": "Shared Resources",
        "domain": "Datasets & Benchmarks",
        "topic": "Evaluation",
        "leaf": "Cross-domain Benchmarks; Reproducible Protocols"
    },
    {
        "title": "FanarGuard: A Culturally-Aware Moderation Filter for Arabic Language Models",
        "abstract": "Content moderation filters are a critical safeguard against alignment failures in language models. Yet most existing filters focus narrowly on general safety and overlook cultural context. In this work, we introduce FanarGuard, a bilingual moderation filter that evaluates both safety and cultural alignment in Arabic and English. We construct a dataset of over 468K prompt and response pairs, drawn from synthetic and public datasets, scored by a panel of LLM judges on harmlessness and cultural awareness, and use it to train two filter variants. To rigorously evaluate cultural alignment, we further develop the first benchmark targeting Arabic cultural contexts, comprising over 1k norm-sensitive prompts with LLM-generated responses annotated by human raters. Results show that FanarGuard achieves stronger agreement with human annotations than inter-annotator reliability, while matching the performance of state-of-the-art filters on safety benchmarks. These findings highlight the importance of integrating cultural awareness into moderation and establish FanarGuard as a practical step toward more context-sensitive safeguards.",
        "url": "http://arxiv.org/abs/2511.18852v1",
        "stream": "Shared Resources",
        "domain": "Datasets & Benchmarks",
        "topic": "Creation",
        "leaf": "Corpora/Annotation; Shared Tasks"
    },
    {
        "title": "LLM Alignment for the Arabs: A Homogenous Culture or Diverse Ones?",
        "abstract": "Large language models (LLMs) have the potential of being useful tools that can automate tasks and assist humans. However, these models are more fluent in English and more aligned with Western cultures, norms, and values. Arabic-specific LLMs are being developed to better capture the nuances of the Arabic language, as well as the views of the Arabs. Yet, Arabs are sometimes assumed to share the same culture. In this position paper, I discuss the limitations of this assumption and provide preliminary thoughts for how to build systems that can better represent the cultural diversity within the Arab world. The invalidity of the cultural homogeneity assumption might seem obvious, yet, it is widely adopted in developing multilingual and Arabic-specific LLMs. I hope that this paper will encourage the NLP community to be considerate of the cultural diversity within various communities speaking the same language.",
        "url": "http://arxiv.org/abs/2503.15003v1",
        "stream": "Objectives & Governance",
        "domain": "Maqasid Lens",
        "topic": "Pluralism",
        "leaf": "Handling Disagreement"
    },
    {
        "title": "Pretrained Models Against Traditional Machine Learning for Detecting Fake Hadith",
        "abstract": "The proliferation of fake news, particularly in sensitive domains like religious texts, necessitates robust authenticity verification methods. This study addresses the growing challenge of authenticating Hadith, where traditional methods relying on the analysis of the chain of narrators (Isnad) and the content (Matn) are increasingly strained by the sheer volume in circulation. To combat this issue, machine learning (ML) and natural language processing (NLP) techniques, specifically through transfer learning, are explored to automate Hadith classification into Genuine and Fake categories. This study utilizes an imbalanced dataset of 8544 Hadiths, with 7008 authentic and 1536 fake Hadiths, to systematically investigate the collective impact of both linguistic and contextual features, particularly the chain of narrators (Isnad), on Hadith authentication. For the first time in this specialized domain, state-of-the-art pre-trained language models (PLMs) such as Multilingual BERT (mBERT), CamelBERT, and AraBERT are evaluated alongside classical algorithms like logistic regression (LR) and support vector machine (SVM) for Hadith authentication. Our best-performing model, AraBERT, achieved a 99.94% F1score when including the chain of narrators, demonstrating the profound effectiveness of contextual elements (Isnad) in significantly improving accuracy, providing novel insights into the indispensable role of computational methods in Hadith authentication and reinforcing traditional scholarly emphasis. This research represents a significant advancement in combating misinformation in this important field.",
        "url": "https://www.semanticscholar.org/paper/4b575e2f4b3e6cc83cd877401990b2572b8a7ad7",
        "stream": "Scriptural Sources",
        "domain": "Hadith Sciences",
        "topic": "Authenticity & Isnad",
        "leaf": "Chain/Matn Features"
    },
    {
        "title": "Investigating Retrieval-Augmented Generation in Quranic Studies: A Study of 13 Open-Source Large Language Models",
        "abstract": "Accurate and contextually faithful responses are critical when applying large language models (LLMs) to sensitive and domain-specific tasks, such as answering queries related to quranic studies. General-purpose LLMs often struggle with hallucinations, where generated responses deviate from authoritative sources, raising concerns about their reliability in religious contexts. This challenge highlights the need for systems that can integrate domain-specific knowledge while maintaining response accuracy, relevance, and faithfulness. In this study, we investigate 13 open-source LLMs categorized into large (e.g., Llama3:70b, Gemma2:27b, QwQ:32b), medium (e.g., Gemma2:9b, Llama3:8b), and small (e.g., Llama3.2:3b, Phi3:3.8b). A Retrieval-Augmented Generation (RAG) is used to make up for the problems that come with using separate models. This research utilizes a descriptive dataset of Quranic surahs including the meanings, historical context, and qualities of the 114 surahs, allowing the model to gather relevant knowledge before responding. The models are evaluated using three key metrics set by human evaluators: context relevance, answer faithfulness, and answer relevance. The findings reveal that large models consistently outperform smaller models in capturing query semantics and producing accurate, contextually grounded responses. The Llama3.2:3b model, even though it is considered small, does very well on faithfulness (4.619) and relevance (4.857), showing the promise of smaller architectures that have been well optimized. This article examines the trade-offs between model size, computational efficiency, and response quality while using LLMs in domain-specific applications.",
        "url": "https://www.semanticscholar.org/paper/328e5b7792e1d76d608041912250eb4833010d45",
        "stream": "Scriptural Sources",
        "domain": "Quran & Tafsir",
        "topic": "Retrieval & QA",
        "leaf": "RAG & Evidence Linking; Search & Datasets"
    },
    {
        "title": "Improving LLM Reliability with RAG in Religious Question-Answering: MufassirQAS",
        "abstract": "Religious teachings can sometimes be complex and challenging to grasp, but chatbots can serve as effective assistants in this domain. Large Language Model (LLM) based chatbots, powered by Natural Language Processing (NLP), can connect related topics and provide well-supported responses to intricate questions, making them valuable tools for religious education. However, LLMs are prone to hallucinations as they can generate inaccurate or irrelevant information, and these can include sensitive content that could be offensive, inappropriate, or controversial. Addressing such topics without inadvertently promoting hate speech or disrespecting certain beliefs remains a significant challenge. As a solution to these issues, we introduce MufassirQAS, a system that enhances LLM accuracy and transparency using a vector database-driven Retrieval-Augmented Generation (RAG) approach. We built a dataset comprising fundamental books containing Turkish translations and interpretations of Islamic texts. This database is leveraged to answer religious inquiries while ensuring that responses remain reliable and contextually grounded. Our system also presents the relevant dataset sections alongside the LLM-generated answers, reinforcing transparency. We carefully designed system prompts to prevent harmful, offensive, or disrespectful outputs, ensuring that responses align with ethical and respectful discourse. Moreover, MufassirQAS provides supplementary details, such as source page numbers and referenced articles, to enhance credibility. To evaluate its effectiveness, we tested MufassirQAS against ChatGPT with sensitive questions, and our system demonstrated superior performance in maintaining accuracy and reliability. Future work will focus on improving accuracy and refining prompt engineering techniques to further minimize biases and ensure even more reliable responses.",
        "url": "https://www.semanticscholar.org/paper/84dd92820eb559745d817b0241b73e00ce83c011",
        "stream": "Scriptural Sources",
        "domain": "Quran & Tafsir",
        "topic": "Retrieval & QA",
        "leaf": "RAG & Evidence Linking"
    },
    {
        "title": "EMasjid, Islamic Chatbot Application With RAG (RetrievalAugmented Generation)",
        "abstract": "The development of a religious chatbot is crucial for fostering good understanding and mitigating potential social conflicts arising from religious misunderstandings. This study introduces the Intelligent Religious Assistant ChatBot, developed using the Retrieval-Augmented Generation (RAG) method within a Large Language Model (LLM). RAG combines information retrieval from authoritative sources integrated into a database with text generation to produce user-specific answers. The application has been fully developed and performance-tested, demonstrating its capability to provide accurate and contextually appropriate answers based on authoritative Islamic references endorsed by major Indonesian Islamic organizations, including Nahdlatul Ulama, Muhammadiyah, and the Indonesian Ulema Council (MUI).",
        "url": "https://www.semanticscholar.org/paper/d3e1c43c20cb7beec130a7a061466e0c770abf58",
        "stream": "Education & Community",
        "domain": "Islamic Education",
        "topic": "Learning Systems",
        "leaf": "Chatbots/Apps/Portals; User Studies"
    },
    {
        "title": "Artificial Intelligence and the Transformation of Digital Services in Islamic Banking: A Case Study of Bank Syariah Indonesia",
        "abstract": "Digital transformation in the Islamic banking sector is necessary in the era of technological disruption. However, implementing artificial intelligence (AI) still faces challenges, especially in non-metropolitan areas. This research aims to explore the role of AI in transforming digital services at Bank Syariah Indonesia (BSI) Semarang Branch, while emphasizing its compliance with maqashid Sharia principles. This research uses a phenomenological qualitative approach through in-depth interviews, participatory observation, and analysis of internal documentation of employees and customers. The main findings show that AI significantly improves service efficiency through digital onboarding, chatbot “Hasanah Assistant”, and a pattern-based automated transaction system. This innovation is considered to accelerate services while maintaining the principles of property protection (hifzh al-mal) and life (hifzh al-nafs). However, challenges arise regarding AI’s limited adaptation to local cultural contexts, senior employees’ resistance to digitalization, and customers’ limited digital literacy. This highlights the importance of a hybrid approach between technology and humanization of Islamic banking services. The uniqueness of this research lies in its focus on regional branches that have not been widely explored in the academic literature, as well as its contribution to expanding the understanding of AI as a strategic medium, not just an automation tool. The implications of this research emphasize the need for an efficient, ethical, and inclusive AI system design, oriented towards Islamic values. The research suggests a participatory digital transformation strategy that is adaptive to local values and consistent with maqashid Sharia to ensure the sustainability of technological innovation in Islamic banking.",
        "url": "https://www.semanticscholar.org/paper/244ac9868777cc3fba1d5fb853af2f8c6695cb0e",
        "stream": "Objectives & Governance",
        "domain": "Maqasid Lens",
        "topic": "Alignment",
        "leaf": "Bias/Safety Evaluation; Benchmark Creation"
    },
    {
        "title": "Implementation of Natural Language Processing (NLP) in Developing a Chatbot Application for Classical Islamic Text Learning at Pesantren El-Huda El-Islamy",
        "abstract": "El-Huda El-Islamy Islamic Boarding School is an Islamic educational institution that aims to mould students into competent and noble religious preachers. This institution focuses on learning and deep understanding of Islamic teachings, including the study of classical books such as the Yellow Book of Fathul Qorib. This research aims to develop and evaluate an Android-based chatbot application that uses the BERT model to help the learning process of the Yellow Book of Fathul Qorib at El-Huda Islamic Boarding School. In this research, the BERT model is integrated into the chatbot application to understand and respond to user questions appropriately. Testing was done by asking 25 questions to the chatbot, which successfully answered 11 questions with a success rate of 44%. Evaluation of the model performance using confusion matrix showed that the chatbot had 90% accuracy, 87% precision, 87% recall, and 86% F1-score. These results show that the chatbot has not been able to provide relevant and accurate responses, and recognise most of the questions asked. This research concludes that this chatbot application is not yet an effective tool to support the learning process at El-Huda Islamic Boarding School",
        "url": "https://www.semanticscholar.org/paper/1d53e1f5d0cbd8bff3eb943fca187380554a4cbb",
        "stream": "Education & Community",
        "domain": "Islamic Education",
        "topic": "Learning Systems",
        "leaf": "Chatbots/Apps/Portals; User Studies"
    },
    {
        "title": "Implementation of an Interactive Chatbot System Using ChatGPT and Leonardo AI to Support Islamic Studies Teaching for MI Teachers",
        "abstract": "This community engagement project facilitated the integration of interactive AI-based chatbot technologies, namely ChatGPT and Leonardo AI, into Islamic Religious Education at Madrasah Ibtidaiyah (MI) in Probolinggo City. The program aimed to enhance teaching quality by empowering teachers through intensive training based on the Participatory Action Research (PAR) approach, which included four key stages: planning (identifying digital literacy and instructional challenges), action (hands-on training in AI tools), observation (monitoring classroom implementation), and reflection (evaluation and feedback). ChatGPT effectively supported teachers in generating quizzes, assessments, and text-based materials, while Leonardo AI enabled the creation of engaging visual learning media. The results revealed a significant improvement in teachers' digital competencies, reflected in increased creativity, confidence, and autonomy in developing AI-based instructional content. This was evidenced by reflective journals, focus group discussions, and performance assessments, with 82% of participants showing measurable progress post-training. Despite challenges such as limited internet access and digital infrastructure, teachers demonstrated strong enthusiasm and adaptability. The program recommends continuous mentoring and the enhancement of digital infrastructure to ensure the sustainability of AI-driven educational transformation at the elementary madrasah level",
        "url": "https://www.semanticscholar.org/paper/cf25a2e1b221b63af6e0c59d127d39fbcd494c22",
        "stream": "Education & Community",
        "domain": "Islamic Education",
        "topic": "Learning Systems",
        "leaf": "Chatbots/Apps/Portals; User Studies"
    },
    {
        "title": "CulFiT: A Fine-grained Cultural-aware LLM Training Paradigm via Multilingual Critique Data Synthesis",
        "abstract": "Large Language Models (LLMs) have demonstrated remarkable capabilities across various tasks, yet they often exhibit a specific cultural biases, neglecting the values and linguistic diversity of low-resource regions. This cultural bias not only undermines universal equality, but also risks reinforcing stereotypes and perpetuating discrimination. To address this, we propose CulFiT, a novel culturally-aware training paradigm that leverages multilingual data and fine-grained reward modeling to enhance cultural sensitivity and inclusivity. Our approach synthesizes diverse cultural-related questions, constructs critique data in culturally relevant languages, and employs fine-grained rewards to decompose cultural texts into verifiable knowledge units for interpretable evaluation. We also introduce GlobalCultureQA, a multilingual open-ended question-answering dataset designed to evaluate culturally-aware responses in a global context. Extensive experiments on three existing benchmarks and our GlobalCultureQA demonstrate that CulFiT achieves state-of-the-art open-source model performance in cultural alignment and general reasoning.",
        "url": "http://arxiv.org/abs/2505.19484v2",
        "stream": "Objectives & Governance",
        "domain": "Maqasid Lens",
        "topic": "Alignment",
        "leaf": "Bias/Safety Evaluation; Benchmark Creation"
    },
    {
        "title": "A Rhythm-Aware Phrase Insertion for Classical Arabic Poetry Composition",
        "abstract": "This paper presents a methodology for inserting phrases in Arabic poems to conform to a specific rhythm using ByT5, a byte-level multilingual transformer-based model. Our work discusses a rule-based grapheme-to-beat transformation tailored for extracting the rhythm from fully diacritized Arabic script. Our approach employs a conditional denoising objective to fine-tune ByT5, where the model reconstructs masked words to match a target rhythm. We adopt a curriculum learning strategy, pre-training on a general Arabic dataset before fine-tuning on poetic dataset, and explore cross-lingual transfer from English to Arabic. Experimental results demonstrate that our models achieve high rhythmic alignment while maintaining semantic coherence. The proposed model has the potential to be used in co-creative applications in the process of composing classical Arabic poems.",
        "url": "http://arxiv.org/abs/2509.18514v1",
        "stream": "History & Heritage",
        "domain": "Turath & Manuscripts",
        "topic": "Discovery & Analysis",
        "leaf": "Citation/Entity Analysis"
    },
    {
        "title": "INTEGRATING GENERATIVE AI IN JOURNALISM EDUCATION THROUGH ISLAMIC COMMUNICATION ETHICS",
        "abstract": "Research on Artificial Intelligence in journalism is rapidly expanding, but studies on adoption in Islamic higher education remain limited. In practice, students actively utilize various generative AI tools, but often without sufficient ethical understanding. This condition creates potential risks such as misinformation, cultural insensitivity, and weakened professional accountability. This study examines the integration of generative AI in the Islamic Communication and Broadcasting (KPI) program at UIN Ponorogo through a qualitative case study approach. The analysis using Rogers’ Diffusion of Innovation theory alongside the framework of Islamic communication ethics, encompassing the principles of ṣidq (truthfulness), amānah (responsibility), maṣlaḥah (public benefit), ʿadl (justice), tabayyun (verification), wasatiyya (moderation), and tablīgh (ethical communication). Findings reveal distinct adoption patterns: students adopt AI rapidly with minimal ethical filtering, lecturers adopt selectively with oversight, while practitioners prioritize authenticity. These differences highlight gaps in digital ethics, institutional readiness, and curriculum design. The study proposes a conceptual framework to align AI adoption with Islamic communication ethics, thereby fostering more responsible journalism practices.",
        "url": "https://www.semanticscholar.org/paper/8956014f43c55cc2a6dbe524d399f53ca62197c0",
        "stream": "Education & Community",
        "domain": "Islamic Education",
        "topic": "Pedagogy",
        "leaf": "Curriculum Design; Qualitative Studies"
    },
    {
        "title": "Assessing Large Language Models on Islamic Legal Reasoning: Evidence from Inheritance Law Evaluation",
        "abstract": "This paper evaluates the knowledge and reasoning capabilities of Large Language Models in Islamic inheritance law, known as 'ilm al-mawarith. We assess the performance of seven LLMs using a benchmark of 1,000 multiple-choice questions covering diverse inheritance scenarios, designed to test models' ability to understand the inheritance context and compute the distribution of shares prescribed by Islamic jurisprudence. The results reveal a significant performance gap: o3 and Gemini 2.5 achieved accuracies above 90%, whereas ALLaM, Fanar, LLaMA, and Mistral scored below 50%. These disparities reflect important differences in reasoning ability and domain adaptation. We conduct a detailed error analysis to identify recurring failure patterns across models, including misunderstandings of inheritance scenarios, incorrect application of legal rules, and insufficient domain knowledge. Our findings highlight limitations in handling structured legal reasoning and suggest directions for improving performance in Islamic legal reasoning. Code: https://github.com/bouchekif/inheritance_evaluation",
        "url": "http://arxiv.org/abs/2509.01081v2",
        "stream": "Law & Practice",
        "domain": "Fiqh & Fatwa",
        "topic": "Reasoning & Evaluation",
        "leaf": "Benchmarks"
    },
    {
        "title": "Enhancing Quranic Ethics and Morality: An NLP- Based Semantic Search Model for Urdu Translation",
        "abstract": "he Quran offers unparalleled guidance on ethics and morality, but extracting relevant teachings from its Urdu translations remains a challenge due to conventional keyword-based search methods that lack contextual understanding. This research proposes a Natural Language Processing (NLP)--based query model designed to improve the retrieval of Quranic verses related to ethics and morality in Urdu translations. By integrating Sentence Transformers for semantic search and a custom synonym expansion module, the model enhances accuracy and relevance in retrieving verses. The dataset widely accepted Urdu translation of the Quran, and the system is evaluated using precision, recall,and relevance scoring metrics to ensure effectiveness. The study demonstrates how NLP techniques can bridge the gap between traditional Quranic studies and modern computational methods, providing scholars, educators, and researchers with an advanced tool for exploring Quranic ethics. The proposed system achieves high precision and recall, offering a more effective approach to Quranic verse retrieval compared to conventional keyword-based searches. The research also highlights future opportunities for expanding the model to support multiple languages and broader thematic searches, further enhancing accessibility to Quranic knowledge.",
        "url": "https://www.semanticscholar.org/paper/03ec0af0712fbb4e0b5acb846d52487da6f1af82",
        "stream": "Scriptural Sources",
        "domain": "Quran & Tafsir",
        "topic": "Retrieval & QA",
        "leaf": "Search & Datasets"
    },
    {
        "title": "Bridging Revelation and Algorithm",
        "abstract": "This study explores the epistemological and methodological integration of Artificial Intelligence (AI) within ḥadīth criticism, focusing on its relationship with the classical Islamic concept of malakah—the intellectual and spiritual faculty enabling a muḥaddith to discern authenticity and hidden defects (ʿillah) within prophetic narrations. Employing a qualitative descriptive approach and library research method, the study analyses both classical Islamic scholarship and contemporary AI research to construct an integrative framework for AI-assisted ḥadīth analysis. The research demonstrates that AI, particularly through Natural Language Processing (NLP) and Machine Learning (ML), offers significant potential to enhance the analytical precision, scalability, and efficiency of ḥadīth authentication. However, it contends that AI must be situated as an epistemological instrument rather than an autonomous interpretive authority. The study argues that while AI can replicate heuristic and linguistic reasoning, it cannot emulate the moral and spiritual intuition inherent in malakah. Consequently, it proposes a hybrid epistemic model where AI serves as a supportive analytical tool, guided by Islamic epistemological principles rooted in tawḥīd, ʿadl, and scholarly ethics. This integration reaffirms the role of human interpretive authority while ensuring that technological innovation in ḥadīth studies remains consistent with the ethical and intellectual heritage of Islamic scholarship.",
        "url": "https://www.semanticscholar.org/paper/3c44030fe448c2e07b4f543c110671e8a6cffec9",
        "stream": "Scriptural Sources",
        "domain": "Hadith Sciences",
        "topic": "Authenticity & Isnad",
        "leaf": "Chain/Matn Features"
    },
    {
        "title": "Artificial Intelligence is Not God: Between Academic Ethics and the Worship of AI in Academic Publications at Islamic Universities",
        "abstract": "This study examines the phenomenon of artificial intelligence (AI) usage in academic publications at Islamic universities, focusing on the implications for academic ethics and spiritual values. Using a qualitative case study approach, data were collected from 150 students and 25 lecturers at both public and private Islamic universities in North Sumatra through in-depth interviews, observations, and document analysis. The findings reveal that AI is often perceived as an instant solution capable of replacing human intellectual processes, leading to a phenomenon of \"AI worship\" that contradicts the principle of tawhid (monotheism) in Islam. The pressure of academic meritocracy fosters instrumental logic, where the end result is prioritized over the learning process and deep reflection. This study recommends the integration of technology ethics education into curricula, training on the ethical use of AI, and the development of ethical guidelines that incorporate Islamic values. Collaboration among scholars, academics, and technology experts is also necessary to create a holistic framework that bridges Islamic scholarly traditions with modern technological innovations. This research underscores the urgency of transforming academic culture to ensure AI remains a complementary tool rather than a replacement for human intellectual capabilities, thereby preserving spiritual values and academic integrity in the digital era.",
        "url": "https://www.semanticscholar.org/paper/0399a423ed68f6cf43a3289d076201f112ac4ee2",
        "stream": "Objectives & Governance",
        "domain": "Maqasid Lens",
        "topic": "Alignment",
        "leaf": "Bias/Safety Evaluation"
    },
    {
        "title": "Integrating Islamic Ethics in STEM Education: The Path to a Sustainable Economy",
        "abstract": "Entering the era of the Fourth Industrial Revolution and Society 5.0, STEM (Science, Technology, Engineering, and Mathematics) education plays a strategic role in driving innovation-based economic growth. However, technological advances that are not accompanied by ethical values give rise to complex social and ecological challenges. This article examines the importance of integrating Islamic ethics into STEM education as an effort to create fair, inclusive, and sustainable economic development. Using a qualitative approach based on literature review and bibliometric analysis, this study explores how Islamic principles such as khalifah, mizan, maslahah, amanah, ‘adl, and hifzal-‘aql can serve as a foundation for designing STEM curricula. This integration is expected to produce students who are not only academically excellent but also have moral concern and social responsibility. The research findings indicate that the integration of Islamic ethics into STEM education can create a curriculum framework that balances mastery of knowledge with character development based on spiritual values. These findings confirm that this approach contributes to the emergence of academically excellent students who are environmentally conscious and committed to social justice. Additionally, this integration has positive implications for sustainable economic development (SDGs), particularly in the context of sharia-based green economy through the optimization of sharia financial instruments such as zakat, wakaf, and green sukuk.",
        "url": "https://www.semanticscholar.org/paper/590e734212e4d256b3c4f7e257098e6ca0d984cf",
        "stream": "Education & Community",
        "domain": "Islamic Education",
        "topic": "Pedagogy",
        "leaf": "Curriculum Design; Qualitative Studies"
    },
    {
        "title": "THE IMPORTANCE OF ISLAMIC WORK ETHICS IN MOTIVATING THE NON-TECHNOLOGY BACKGROUND EDUCATORS FOR ARTIFICIAL INTELLIGENCE (AI) APPLICATION IN EDUCATION",
        "abstract": "With the awareness of Islamic Work Ethics (IWE) and its implementation as an individual’s commitment as an educator, this study intends to see the motivating factors that caused the non-technology background educators to stay inspired in grasping the knowledge on artificial intelligence (AI) and includes the AI tools implementation while educating. As many are aware, AI tools can be an easy application for those with technology fundamentals, but it can be hard for those who are “digitally illiterate”. Using a qualitative research method, an in-depth interview session has been conducted with six participants who are the educators at private higher education in Malaysia. All participants were non-technology background educators. The data were analysed using thematic analysis. Findings showed that all participants agreed that IWE awareness, such as effort and commitment, has driven them to seek knowledge on AI tools. Additionally, institutional support and personal satisfaction have caused them to include AI in their teaching and learning performances apart from valuing Islamic work ethics (IWE) in their profession.",
        "url": "https://www.semanticscholar.org/paper/3b1fbdbcb9b0caca2eb9b33b9b95bb6df14c3f4d",
        "stream": "Education & Community",
        "domain": "Islamic Education",
        "topic": "Pedagogy",
        "leaf": "Qualitative Studies"
    },
    {
        "title": "Fine-tuning Large Language Model (BERT) for Islamic Moral Inquiry and Response",
        "abstract": "The development of Large Language Models (LLM) that are capable of understanding and responding to issues from an Islamic perspective is extremely insightful as it will benefit many people. For an LLM to do so, it is not enough for the model to only understand the language, but it also needs to understand the context and specific doctrines within the Islamic texts due to the complexity of Islamic jurisprudence and moral philosophy. Therefore, in this research, we intend to fine-tune an LLM model which is known as Bidirectional Encoder Representations from Transformers (BERT) for Islamic moral inquiry and response. By incorporating Islamic principles, norms, and teaching into the model, we aim to enhance the pre-trained BERT model’s ability to perform moral-related Question Answering (QA) tasks. The original model that we chose is deepset BERT model which was built based on BERT-large and meticulously pre-trained using the SQuaD 2.0 dataset, specifically for QA tasks. We fine-tune the model using the data extracted from “Islam: Questions and Answers: Character and Morals”, the Volume 13 of a Series of Islamic Books by Muhammad Saed Abdul-Rahman, where the data has been cleaned and pre-processed. The fine-tuning process used supervised learning techniques, to ensure its proficiency in understanding Islamic principles, providing accurate, contextually appropriate, and theologically sound responses. We assessed the model using F1 score and Levenshtein similarity evaluation metrics where F1 score merges precision and recall by computing their harmonic mean, while Levenshtein similarity compares the predicted and actual answers at the character level by normalizing the Levenshtein distance. Our research yielded significant success, evidenced by the remarkable enhancement in the average F1 scores and Levenshtein similarities, soaring from 0.30 and 0.24, to 0.74 and 0.67 respectively.",
        "url": "https://www.semanticscholar.org/paper/667aa09874957f72d8910ef52ba8253164e1b9cc",
        "stream": "Objectives & Governance",
        "domain": "Maqasid Lens",
        "topic": "Alignment",
        "leaf": "Bias/Safety Evaluation; Benchmark Creation"
    },
    {
        "title": "Aftina: enhancing stability and preventing hallucination in AI-based Islamic fatwa generation using LLMs and RAG",
        "abstract": "Question–answering (QA) systems face considerable challenges when involved in Islamic fatwas due to the complexity and sensitivity of the data. Such problems involve providing accurate and reliable responses, managing hallucinations and inaccurate responses, and maintaining the stability of the generated responses. Prior studies have concentrated mainly on collecting and preprocessing Islamic datasets or developing retrieval-based QA systems, overlooking the precision and reliability required for fatwa issuance. To address this issue, we propose a QA approach utilizing advanced retrieval-augmented generation (RAG), which is enhanced by a re-ranker to increase response stability, eliminate hallucinations, and prioritize the most appropriate and exact answer. This enhancement significantly improves response stability and reduces hallucinations by improving the data used for answer generation. We conducted experiments across three setups: (1) base LLM, (2) LLM with RAG, and (3) LLM with RAG and re-ranker. The third method of LLM with RAG includes a re-ranker for knowledge retrieval, which improves the process and ensures relevant and trustworthy data. This differentiates it from the second method, which uses a retrieval model. The Flash re-ranker retrieves the most relevant data, which increases the response stability and trustworthiness. Evaluations using BERTScore, hallucination, completeness, and irrelevance metrics demonstrated that the third experiment LLM with RAG and re-ranker outperformed other setups, providing precise, stable, and dependable answers. This research contributes a robust methodology to improve AI-driven fatwa systems, guaranteeing higher precision and trustworthiness in Islamic QA systems.",
        "url": "https://link.springer.com/article/10.1007/s00521-025-11229-y",
        "stream": "Law & Practice",
        "domain": "Fiqh & Fatwa",
        "topic": "Fatwa QA & Support",
        "leaf": "RAG + Citations; Uncertainty/Deferral"
    }
]